{"lecture_id": "linux12del11", "chunk_id": "linux12del11_0000", "start": 0.0, "end": 268.36, "token_count": 584, "text": "GetDate gir datoen nå. Eller dato, det gir dato og klokkeslett. Dette er et såkalt datetime object. Igjen så kan man sende dette til getmember og se hva det egentlig inneholder. Da ser vi det inneholder en rekke properties, sånn som year og... I tillegg har det en rekke metoder, f.eks. add og add days. Det kan være nyttig, for da kan man på en enkel måte legge til en dag eller legge til en time. Sånn generelt, på samme måte som andre kommandolett, så kan man da f.eks. Skrive time og year på den måten. Ja. Så kan man også definere... definere datoer. Det vi skal gjøre nå, er å definere en dato, og så skal vi etterpå dra ut dette som et objekt. Og så skal vi se på hvordan vi kan manipulere på dette. Men la oss si vi ønsker å legge inn en dato med et visst år. 2017... med måned fem. Og dag 17. Get day, hva er feil...? Get date. Og da ser vi at vi får 17. mai 2017, som da var på en onsdag. Så vi får et klokkeskjøtt der, 11.55, men det er fordi jeg... Vi får da klokkeskjøtt som er nå. Og la oss si jeg ønsker klokka 16.01 på 17. mai. Så kan jeg sette den helt nøyaktig. Sånn, f.eks. Da kan jeg spesifisere en dato. Helt spesifikt. Det fins mange litt lettere måter å gjøre det på. Definerer det samme ved 17.0.2017 klokka... 16.00. Sånn. Igjen så får vi riktig dato. Men nå skal vi prøve å... Siden dette er objekter, så skal vi prøve å manipulere litt på objektene. Så vi kan starte opp med f.eks. å si at no - det er get date. Da har vi et objekt som vi ikke kan ta ut year på, men year. Sånn. År 2020. Men dette objektet her... Det kan vi nå manipulere på. Vi så vi hadde en metode som het ad. Så her kan vi lett da lage... Lage i går, for i går det vil da være... now. Og så kan vi da bruke metoden ad... ad days.", "source": "lecture"}
{"lecture_id": "linux12del11", "chunk_id": "linux12del11_0001", "start": 204.44, "end": 392.68, "token_count": 431, "text": "så skal vi prøve å manipulere litt på objektene. Så vi kan starte opp med f.eks. å si at no - det er get date. Da har vi et objekt som vi ikke kan ta ut year på, men year. Sånn. År 2020. Men dette objektet her... Det kan vi nå manipulere på. Vi så vi hadde en metode som het ad. Så her kan vi lett da lage... Lage i går, for i går det vil da være... now. Og så kan vi da bruke metoden ad... ad days. Nå kunne jeg tabbe gjennom hvilke metoder jeg har. Jeg startet med Nav, bare. Hvis jeg begynner å tabbe da, så går jeg gjennom alle propertiste metoder. Men jeg ønsker et add og mer spesifikt add days. Hvis jeg skal ha yesterday, så må jeg adde minus én da. Så ser vi at det var... Det var i går. Så kan jeg jo ta en tomorrow. Det blir da lørdag. Så kan jeg også... Legge på en time... Nei, jeg må jo være 17-19 nå. Skal vi se hvis jeg kan den oppå. Nei. Add over. Den finnes tydeligvis ikke. Så da må jeg begynne å lete i metodene for å finne ut hvordan man gjør det. Da... En måte kan være å... ... å tabbe igjennom. En annen måte kan være å se i get numbers. Men her tabbet jeg igjennom, og så ser jeg add. Det var ikke add over, men det var add overs. Så da kan jeg prøve å legge til én time. Og dollar ho nå vil da være om én time. Så på den måten så er det veldig lett. Lett å manipulere på...", "source": "lecture"}
