{"lecture_id": "linux2del3", "chunk_id": "linux2del3_0000", "start": 0.0, "end": 170.1, "token_count": 588, "text": "En liten oppsummering om Linux-selskript. Ja, det er som om vi har sett en samling av kommandolinjer. Han kan også ha if-tester og forlocker osv., men i utgangspunktet skal man bare samle kommandolinjer som man har testet ut der, inn i en tekstinstruktor, og så blir det et skript. Og det er program som utføres linje for linje. Det kompileres ikke. Så det betyr at hvis du har en syntaksfeil et godt stykke ned i skriptet, så vil skriptet kjøre helt til det kommer ned dit, og så vil det feile der nede. Fordeler med det er at det er veldig raskt å lage. Og så er det veldig tett opp mot kommandolinjen, sånn at det løsner til å teste ut det du skal gjøre, og så bare putte inn et skript når det virker. For små oppgaver som skal gjøres, og som ligger tett inntil operativsystemet. Det er mange negative sider også. Det er f.eks. veldig langsomt i forhold til komplisert kode. Vi skal teste litt etter hvert. Det mangler avanserte datastrukturer. Vi skal se at man kan bruke RI, f.eks. Men det også er litt tungvint. Og litt krypt. Generert er syntaksen til Shellscript ganske kryptisk, og dermed blir scriptene vanskelige å lese for andre. Hvis du har prøvd å se på noen litt større Shellscript, så finner du fort ut det. I tillegg blir det vanskelig å feilsøke å debugge. Det er også generelt et problem. Så det brukes først og fremst for små, enkle oppgaver. Å automatisere oppgaver hvor man skal bruke operativstemme til å utføre et eller annet, så er det veldig enkelt og praktisk å kunne automatisere jobber med Shellscript. En meget nyttig måte å teste ut bæsjscript på, er å bruke minus-x-parameteren. Da kjører du et script sånn som dette her. I tilfelle heter det mitt script. Da legger man på minus X som opsjon. Og da får man se hva som skjer, hvordan hver eneste linje i skriptet utføres. Og spesielt hvis noe går galt i skriptet, så du får bare en eller annen sær feilmelding,", "source": "lecture"}
{"lecture_id": "linux2del3", "chunk_id": "linux2del3_0001", "start": 129.52, "end": 187.76, "token_count": 222, "text": "så er det veldig enkelt og praktisk å kunne automatisere jobber med Shellscript. En meget nyttig måte å teste ut bæsjscript på, er å bruke minus-x-parameteren. Da kjører du et script sånn som dette her. I tilfelle heter det mitt script. Da legger man på minus X som opsjon. Og da får man se hva som skjer, hvordan hver eneste linje i skriptet utføres. Og spesielt hvis noe går galt i skriptet, så du får bare en eller annen sær feilmelding, så kan det være veldig nyttig å legge på den minus X, og så kjøre det på den måten der. I stedet for å kjøre det med frikslash minus skript, så kjører du med bæsj minus X, Da ser du nøyaktig hva som skjer i hver linje i koden når den kjøres.", "source": "lecture"}
