{"lecture_id": "linux7del19", "chunk_id": "linux7del19_0000", "start": 0.0, "end": 256.86, "token_count": 600, "text": "Men det vi kan gjøre først, er å se litt på en av oppgavene denne uken. Som går ut på å lage en kopi av en eksisterende konteiner. Hvis jeg nå bare stopper den konteineren, så... Så kan jeg ikke starte den opp igjen med det samme innholdet. Nå har jeg lagd... Jeg lister image her nå. Container image LS. Da ser vi at jeg har en Ubuntu. Men den Ubuntu der, det er en plain Ubuntu uten webserver. Så det jeg skal prøve nå, er å lage en kopi. Nå har jeg gjort endringer, så jeg vil lage en kopi av den tegneren. Det jeg kan gjøre da, er å... Komit er sånn generelt det man gjør når man skal commit-kode. Hvis man har lagd ferdig kode, så vil man sende til Egypt-hub eller andre steder. Men i dette tilfellet vil jeg nå commit-e og lage en kopi av min eksisterende ubuntu. Da tegner jeg id-en til ubuntu. Det er den her. Der den står og kjører. Kom hit. Nå vil jeg lage en kopi av den her. Så vil jeg kalle den f.eks. en Apache-Ubuntu. Det er da en Ubuntu med en Apache-server. Dette tar litt tid, for den må da kopiere hele imaget. Der var den ferdig. Så når jeg lister imaget nå, gjør det at jeg har fått et nytt image, som heter Apache Ubunte. Og som er en god del større enn det standard-Ubunte-imaget. Fordi nå har det fått inn en hel webserver her oppe. Så kan jeg prøve å starte det imaget, og så kan jeg prøve å forte det. Da kan jeg gjøre omtrent det samme som jeg gjorde her med EngineX. For å se at det er noe annet, kan jeg ta et annet portnummer her. 7878. Innkommende rekvest til port 7878 på Linux-VM-en min nå. Det vil jeg sende til port 80, og så vil jeg kjøre det på... Bakgrunn. Jeg vil sende det nå til Apartsjubentu. Sånn. Nå prøver jeg å starte en ny konteiner som inneholder den serveren jeg satte opp. Nå lister jeg kjørende kommandtegnere, så ser vi at jeg har... Men det er bare den der som jeg har forbeholdt 78-78. Da kan jeg prøve å koble meg til den med Execute.", "source": "lecture"}
{"lecture_id": "linux7del19", "chunk_id": "linux7del19_0001", "start": 192.16, "end": 481.48, "token_count": 582, "text": "Det vil jeg sende til port 80, og så vil jeg kjøre det på... Bakgrunn. Jeg vil sende det nå til Apartsjubentu. Sånn. Nå prøver jeg å starte en ny konteiner som inneholder den serveren jeg satte opp. Nå lister jeg kjørende kommandtegnere, så ser vi at jeg har... Men det er bare den der som jeg har forbeholdt 78-78. Da kan jeg prøve å koble meg til den med Execute. Da går jeg inn på den. Så kobler jeg meg til den nye kopien, den av Apache-Ubuntu. Det som er interessant der nå... Er det nå mulig å starte Apache-webserveren? Hvis jeg hadde vanlig Ubuntu-image, så ville jo ikke det gått. Her ser vi. Her fungerer det. Jeg har nå en Apache-server... Jeg har nå en Apache-server som står og kjører på fort 80. Hvis jeg nå gjentar kontroll P, kontroll Q og har lister, så ser vi... Her står den og kjører. Så skulle jeg nå kunne... Gå inn i et webvindu og prøve å koble meg til. Så kan jeg åpne vinduet for dere. Her ser vi den gamle siden med 7979. Hvis jeg nå tilholder den, så er det naturlig nok ikke noe der, for der kjører ikke den. Jeg prøver 7878. Da ser vi... Jo, her kommer Aparce-serveren ut. Det er da den serveren som kjører på konteineren som vi startet opp. Det ser ut som en default Aparce-server, så det er ikke så lett å se... Vi kan prøve å gå inn på... Vi kan gå inn, så kan vi prøve å bare endre litt på teksten på avanseserveren. Det er også en del av oppgaven denne uken å gjøre akkurat det. Først kan jeg ta apps install... Kanskje to her på Vemund, for det har jeg tydeligvis ikke gjort før. Appdate først. Først er å installere Apache-VM på Linux-VM. Apache2-webserver på Linux-VM. Når jeg går inn på porten på Linux-VM, så skal jeg få opp den Apache-serveren som står og kjører her. Før jeg gjør det, så skal jeg prøve nå å koble meg opp til containeren som står og kjører Apache. Den konteineren står nå på", "source": "lecture"}
{"lecture_id": "linux7del19", "chunk_id": "linux7del19_0002", "start": 408.9, "end": 748.26, "token_count": 595, "text": "Kanskje to her på Vemund, for det har jeg tydeligvis ikke gjort før. Appdate først. Først er å installere Apache-VM på Linux-VM. Apache2-webserver på Linux-VM. Når jeg går inn på porten på Linux-VM, så skal jeg få opp den Apache-serveren som står og kjører her. Før jeg gjør det, så skal jeg prøve nå å koble meg opp til containeren som står og kjører Apache. Den konteineren står nå på og kjører Apache til port 80. Men alt som sendes til 7878, vil sendes videre til den konteineren. Men det er jo ikke særlig nyttig å kjøre webserver hvis du ikke kan endre på innholdet. Det vi gjør i dag, er at vi går direkte inn på konteineren og endrer på innholdet der. Det som er mer vanlig, og som vi skal gjøre neste uke, det er å gå... Ha et volum som er... Som ligger utenfor konteineren. Nå skal vi ta Dock Container PS. Da ser vi den konteineren som står og kjører. Det er da den der. Så kobler jeg meg inn til den konteineren. Og så går jeg til der hvor webseramen ligger. Den indeks-hotml-filen er den standardsiden man ser. Så kan jeg skrive f.eks. image fra OS70. Sånn. Nå skulle den WebServe-en servere. Jeg kan altså sjekke det lokalt ved å be om å bruke køen. En opplagt fordel med både container og VM-er, er at du kan installere hva du vil. Vi ser også at konteinere er veldig minimalistiske. De skal være så små som mulig. For å bruke minst mulig ressurser. Og så kan man tilpasse det med det man har. Det tar litt tid. I mellomtiden skal jeg gå ut og sjekke webserveren, om den virker. Nå har vi satt på 78,78, så skal det fortsatt stå en webserver og kjøre. Nå skal den være endret til det vi... Skal vi se når den dukker opp hos dere. Da skal jeg refreshe. Sånn, og da ser vi dokker-image fra OS70. Det er den endringen som jeg gikk inn på dokker-konteineren og endret. Men da ser vi med det samme. Da får vi den default-pagen. Dette er nå en tjeneste fra webserveren på Linux.", "source": "lecture"}
{"lecture_id": "linux7del19", "chunk_id": "linux7del19_0003", "start": 678.92, "end": 924.9, "token_count": 590, "text": "Det tar litt tid. I mellomtiden skal jeg gå ut og sjekke webserveren, om den virker. Nå har vi satt på 78,78, så skal det fortsatt stå en webserver og kjøre. Nå skal den være endret til det vi... Skal vi se når den dukker opp hos dere. Da skal jeg refreshe. Sånn, og da ser vi dokker-image fra OS70. Det er den endringen som jeg gikk inn på dokker-konteineren og endret. Men da ser vi med det samme. Da får vi den default-pagen. Dette er nå en tjeneste fra webserveren på Linux. Med en gang jeg skriver 78, så default for en webserver er å koble seg til på port 80. Så hvis jeg eksplisitt skriver port 80 her, så kommer jeg til den samme siden. Men jeg kan generelt be om hvilken som helst port. Så hvis jeg nå... Det jeg gjør nå, egentlig, det er å be broseren om å koble seg til pepserveren på OS70 på port 7878. Når jeg gjør det, så er docky satt opp sånn at alt som sendes inn til port 7878, det videresender til docker-imaget til docky-containeren som står og kjører, på port 80. Og da ser vi. Dermed så får jeg opp den. Dermed får jeg opp webserveren som vi har laget på Dokkerinnsats. Skal vi bare helt til slutt se om... Ja, der var køllen ferdig. Sånn. På den måten så kan man teste... Teste at webserveren funker. Det er... i tesepipe så er det local host. Da får man kontakt med local host. Man kunne vel også gjort noe sånt? Det fungerer også. Så på den måten så kan du enkelt teste om webserveren faktisk funker. Den med hostname, så er du sikrere. Dette er ikke linjevis. Det kan sjekke om webserveren virker. Hvis den virker, men du ikke kommer inn utenfra, da er det noe med hvordan du har startet... Hvordan du har startet... Skal jeg se... Jeg hadde vel... Nei, det var jo ikke her jeg gjorde det. Så er det Kontroll-P og Q, og så går jeg ut. Den kommandoen skulle jeg ha frem. Etter den kommandoen startet jeg ApacheBunt. Sånn at det blir portforwarding mellom 78 og 78.", "source": "lecture"}
