{"lecture_id": "linux6del2", "chunk_id": "linux6del2_0000", "start": 0.0, "end": 199.2, "token_count": 599, "text": "Brukere i Linux er definert ut ifra en linje i passordfilen. Så hvis vi tar en titt på passordfilen, så er dette hele passordfilen på Linux V med alle brukerne. Og vi ser den første brukeren er RUT-brukeren. Så hvis man gjør sudo su, så blir man RUT. Det kan man da se ved... Sudo SU..\"Who am I?\" Da ser vi... Jo, jeg er Ruth. Og det kan være greit å bruke 'who am I' når man går inn og ut i rollen som Ruth, og i rollen som andre brukere. Igjen, hvis vi ser på passordfilen, så er det da flere brukere definert nedover her. Sys og Synk, som er sånne systembrukere. WWW Data, f.eks., som... Brukeren som kjører webserveren når du starter opp den. Nederst kommer de mer menneskelige brukerne. Group 100 ligger her. Det er da en vanlig bruker på systemet. I etcpassword ligger da alle brukerne definert. Og her er det også definert hjemmemappen. Homegroup100. Det er hjemmemappen for denne brukeren. Og så er det definert defaults passord og hvilken gruppe som brukeren er medlem av. Og i tillegg en UID. Dette er UID-en. 1000. Bruker-ID. 998 er gruppe-ID-en som denne brukeren er med. Alle brukere har en UID, og alle brukere er med i minst én gruppe. Være med i flere grupper. Og flere grupper... Eller hvilken gruppe man er med i, det kan man se i med kommandoen 'groups'. Så denne brukeren er med i group 100, som er en default gruppe for denne brukeren. Og i tillegg er den med i sudogruppen. Alle grupper kan man se i en fil som heter Etsgroup. Her ser vi det er en rekke grupper, f.eks. Group 100, som er de forholdt, Krontab osv. Så kan vi se om vi ser sudo her. Her ser vi en linje for sudo. Denne linja betyr at sudo er gruppe nummer 27, og Group 100 er med i sudo. Det at Group 100 er med i sudo, gjør at denne brukeren får sudorettigheter. Ved å se i filen... Den har jeg ikke lov til å se på når jeg ikke er Ruth, så da kan jeg ta Sudo. Og her står det en linje som sier at alle medlemmer av gruppen Sudo", "source": "lecture"}
{"lecture_id": "linux6del2", "chunk_id": "linux6del2_0001", "start": 150.0, "end": 339.44, "token_count": 585, "text": "Her ser vi det er en rekke grupper, f.eks. Group 100, som er de forholdt, Krontab osv. Så kan vi se om vi ser sudo her. Her ser vi en linje for sudo. Denne linja betyr at sudo er gruppe nummer 27, og Group 100 er med i sudo. Det at Group 100 er med i sudo, gjør at denne brukeren får sudorettigheter. Ved å se i filen... Den har jeg ikke lov til å se på når jeg ikke er Ruth, så da kan jeg ta Sudo. Og her står det en linje som sier at alle medlemmer av gruppen Sudo har alle disse rettighetene. Og det betyr at de kan gjøre hva som helst og bli Ruth med Sudo SU. Så kan man... Med ruterettigheter så kan man legge til nye brukere. Så jeg kan f.eks. si at jeg ønsker å legge til en bruker. Da kan jeg bruke kommandoen add user. Så la oss si jeg ønsker å legge til en bruker med navn S123456. Da blir jeg bedt om å gi denne brukeren et passord. Og da er det veldig viktig å lage et godt passord som er langt nok, bruker litt forskjellige tegn, gjerne store bokstaver, tall osv. Men hvis man har et vanskelig brukernavn, eller et spesielt brukernavn, så gjør det også sjansen mindre for at noen skal hacke seg inn med Brute Force Attack. Den informasjonen som kommer her, det er bare å trykke på 'enter' hele tiden. Man trenger ikke å legge inn en informasjon. Man kan legge inn hvis man vil med fullt navn osv., men man må ikke. Så jeg bare svarte blankt på alle spørsmålene. Og'return' her, da svarte jeg egentlig 'ja'. Når jeg har gjort det, så kan du se at i passordfilen der, så skal det ha kommet... Og det ser vi nederst her. Så har det kommet en ekstrabruker med UD 1001 og gruppe nummer 1000. Denne brukeren er i utgangspunktet ikke-studiouser. Så hvis du lager en ny bruker, så blir den brukeren ikke-studiouser. Men man kan gjøre brukeren til studiouser ved å bruke... En kommando som heter ADD GROUP. Oi... ADD GROUP. Sånn.", "source": "lecture"}
{"lecture_id": "linux6del2", "chunk_id": "linux6del2_0002", "start": 291.66, "end": 394.98, "token_count": 281, "text": "Når jeg har gjort det, så kan du se at i passordfilen der, så skal det ha kommet... Og det ser vi nederst her. Så har det kommet en ekstrabruker med UD 1001 og gruppe nummer 1000. Denne brukeren er i utgangspunktet ikke-studiouser. Så hvis du lager en ny bruker, så blir den brukeren ikke-studiouser. Men man kan gjøre brukeren til studiouser ved å bruke... En kommando som heter ADD GROUP. Oi... ADD GROUP. Sånn. Og jeg ønsker å gjøre S1-2-3-4-5-6 til sudo-user. Så da må jeg adde denne brukeren til gruppen sudo på den måten. Da ser vi... Adding user til sudo. Og da kan vi se at... S123. Nå vil ha... Nå vil også være tilføyd i en linje i ettertidsgruppe S12356. Så det kan man også sjekke ved Groups SN2356. Da får man beskjed om at jo, denne brukeren er med i sudogruppen. Gjøre sudo-SU og bli rundt og gjøre installasjoner osv.", "source": "lecture"}
