{"lecture_id": "linux6del6", "chunk_id": "linux6del6_0000", "start": 0.0, "end": 174.08, "token_count": 578, "text": "Nå skal jeg se på hvordan man kan sette opp passordløs innlogging fra neste DSOS til RUT på Linux-VM. Altså til RUT-brukeren på Linux-VM. Og hvis man ikke har gjort det før, så kan man da starte med å sette opp passordløs tilkobling til den vanlige OS-brukeren. Og som jeg har sett tidligere, så kan man gjøre det, så kan man gjøre det tidligere, så kan man gjøre det tidligere, så kan man gjøre det tidligere, så kan man gjøre det tidligere, så kan man gjøre det til passordløs tilkobling til den vanlige OS-brukeren. Og som jeg har sett tidligere, så kan man gjøre det, og sette opp passordlørløs tilkobling til den vanlige OS-brukeren. Så har jeg nå en brukergruppe 100. Så da kan jeg legge over den, og da må jeg taste passordet. Da kan jeg prøve å gå direkte inn uten å tasse passordet. Sånn. Da kan vi se på hva som skjedde da jeg gjorde dette her. Altså da jeg fikk til passordløs tilkobling. Eller SSO-innlogging med SSO-nøkler. Det som skjedde, var at en fil som blir generert med ssokeegan.idrsa.pup, Det er den public-nøkkelen. Det er min public-nøkkel. Den ser sånn ut. Og det som skjer, er at denne kopieres over til Linux-VM. Så det skjer med SSH copy-ID. Derimot... Den private nøkkelen, den ligger også i.so. Jeg vil ikke vise den frem engang. Kopierer man den, så kan man få adgang til alle steder hvor jeg har adgang. Men den ligger i den filen, IDRSA. Så den må man være veldig forsiktig med. Den må ikke andre få tilgang til. Nøkkelen er ikke så nøye, for der den legger, der får du tilgang. Og om noen andre skulle legge den et annet sted, så får du tilgang. For å få tilgang dit du skal. Så vi kan nå gå inn og se om dette faktisk har skjedd, hvis vi logger inn her. Da slipper jeg å taste passord, og så kan vi se... Ligger faktisk den nøkkelen her i Authorized Keys?", "source": "lecture"}
{"lecture_id": "linux6del6", "chunk_id": "linux6del6_0001", "start": 131.24, "end": 343.88, "token_count": 597, "text": "Så den må man være veldig forsiktig med. Den må ikke andre få tilgang til. Nøkkelen er ikke så nøye, for der den legger, der får du tilgang. Og om noen andre skulle legge den et annet sted, så får du tilgang. For å få tilgang dit du skal. Så vi kan nå gå inn og se om dette faktisk har skjedd, hvis vi logger inn her. Da slipper jeg å taste passord, og så kan vi se... Ligger faktisk den nøkkelen her i Authorized Keys? Ja, det er den nøkkelen her som ligger der. Og fordi den nøkkelen ligger der, Så kan jeg også få direkte tilgang. Det jeg skal prøve å gjøre nå, er å også få tilgang direkte som Ruth. Men Ruth har ikke noe eget passord her på Linux-VM. Så dermed kan du ikke bruke den samme teknikken med å bruke SSO-copy-ID. Men siden vi allerede har fått denne over her, så kan vi gjøre... Altså kopiere denne filen til Ruth. Og da vil Ruth også få adgang. Hvis jeg kopierer hele filen, så må jeg være oppmerksom på at da får også de andre som har her, tilgang. Så for å gjøre det veldig eksplisitt, så kan man også bare kopiere den strengen direkte inn i Autorized Keys hos Ruth. Eller Public Ease for de som får alga. Så... Det jeg da kan gjøre, er først å gå inn som Ruth. Og så CD-er går jeg hjem til Ruth. Og hjem til Ruth, det er i DotRuth. Og så må jeg sjekke først... Fins det en DotSSH her? Nei, det gjør det ikke. Det fins ikke noen.ssh. Og for å få rettigheter og sånn riktig kan det mest praktiske også rett og slett være å kjøre en ssh-key. Jen for Ruth, for da opprettes mappen. Vi ser da lages også en idrsa og idrsa.pub, men vi skal ikke bruke de nå. Å bruke denne mappen her. Det vi skal bruke den til, er å kopiere over Otterize Keys fra... ... fra group 100. Hvis jeg får den inn her, så vil alle som har tilgang, inn som group 100, og så vil det komme rett inn som Ruth. Sånn. Og så kan det være lurt å sjekke om rettighetene er riktig. Og rettighetene, de skal være sånn som de er for Grupp 100.", "source": "lecture"}
{"lecture_id": "linux6del6", "chunk_id": "linux6del6_0002", "start": 300.0, "end": 482.42, "token_count": 578, "text": "Å bruke denne mappen her. Det vi skal bruke den til, er å kopiere over Otterize Keys fra... ... fra group 100. Hvis jeg får den inn her, så vil alle som har tilgang, inn som group 100, og så vil det komme rett inn som Ruth. Sånn. Og så kan det være lurt å sjekke om rettighetene er riktig. Og rettighetene, de skal være sånn som de er for Grupp 100. Og vi ser Othrice Keys har disse rettighetene. Og så har vi da de samme rettighetene som Ruth. Så da ser alt ut til å være i orden. Så nå kan jeg gå ut igjen.  Og så, istedenfor å prøve å logge inn som group100, så kan jeg prøve å gå rett inn som brut. Og det får jeg nå lov til fordi jeg har lagt inn min ID rsa.pub, min public key, i.authorized keys og slutt. Men da må jeg altså, siden jeg la inn hele denne filen, så må jeg nå også være klar over at den som har denne private ID-en, Så hvis jeg f.eks. ønsker å ta bort den, så kan jeg bare fjerne den linjen. Kontroll-K, fjerner en linje. Og nå har jeg bare den Stud.SSH-tilgangen. Men den er fortsatt ille. Nå kan jeg gå direkte inn som Ruth. Og alt det krever, er da at public key må ligge i.sh. Så får man direkte tilgang. Generelt så bør man være litt forsiktig med å bruke Rute-kontoen direkte. Men på dokkecontainere og virtuelle maskiner, så er det ikke så farlig som det er på fysiske servere, som er tenkt å stå lenge. Dokkecontainere er raske å bygge på nytt og starte opp. Så kan man bygge opp på nytt. Det gjelder også de dokkekonteinerne vi bruker i OS-kurset. Men husk på at da vil alt dere har lagret, bli borte. Så ta hele tiden backup av skript og kanskje history og hvilke kommandoer dere har gjort, slik at dere alltid til enhver tid har alt som har blitt gjort i disse vemmene. Sånn at dere ikke risikerer å miste dem hvis de skulle. Eller bli ødelagt, og må bygges på nytt.", "source": "lecture"}
