{"lecture_id": "linux8del6", "chunk_id": "linux8del6_0000", "start": 0.0, "end": 219.0, "token_count": 587, "text": "Først og fremst skal vi se på dokkefiles. Men før det så skal vi prøve å se litt på volumes. Og generelt hvordan man får dokkefilene... Nei, får konteinerne til å koble seg opp mot det lokale filsystemet. For da kan man... Hvis man kobler en dokkefil til... Så kan man da koble løs containeren, sånn at den er en uavhengig enhet som raskt kan startes og stoppes. For hele tiden ønsker man å ha konteinere uavhengige. De skal gjerne gjøre så lite som mulig. Typisk så kjører en container én prosess. F.eks. én webserver, eller én applikasjon som skal testes og kjøres. Men vi vil gjerne kunne stoppe starten. Og gjerne kaste den også, bygge den på nytt. Uten at innholdet blir kastet. Så derfor skal vi nå begynne å se litt på volumer og hvordan man kobler til eksterne filer til en dokkerinstans. Dokkerinstans er da det samme som en container. Så det er en annen måte å si container på. Da skal jeg... I stedet dele slidene til Mike Long, som vi så på sist. Vi har en ca. 20 slider til. Da skal vi se på volumer. Ja... Dukkevolum, det er da... Som jeg sa, det er en mappe. Eller en fil som man bruker for å koble opp varige filer til en dokkeinstans. Sånn at man kan... Sånn at en... Selv om man da dreper og til og med avslutter. ... så kan man bruke de samme filene senere. Ved å bygge en ny container fra et nytt image og koble opp mot de samme filene. Så kan de også deles mellom containere. Det er et par-tre måter å gjøre dette på. Det er som en link. Du kan ha en fil eller mappe her i containeren som peker direkte på en mappe på filsystemet på hosen du kjører containeren. Da kan du endre på filene på hosen, og så endres det i containeren. En litt mer abstrakt og foretrukket metode er volum. Et volum, det defineres av dokker-dimen. Så da er det dokker som står og styrer. Dette kan i større grad gjøre at konteinere kan dele data med hverandre også.", "source": "lecture"}
{"lecture_id": "linux8del6", "chunk_id": "linux8del6_0001", "start": 180.0, "end": 385.36, "token_count": 594, "text": "Det er som en link. Du kan ha en fil eller mappe her i containeren som peker direkte på en mappe på filsystemet på hosen du kjører containeren. Da kan du endre på filene på hosen, og så endres det i containeren. En litt mer abstrakt og foretrukket metode er volum. Et volum, det defineres av dokker-dimen. Så da er det dokker som står og styrer. Dette kan i større grad gjøre at konteinere kan dele data med hverandre også. Så dette er en litt mer abstrakt måte å styre filer på. Som også er styrt av dokker. Sånn at det er dokker som styrer dette. Så kan jeg altså montere direkte minne, det kommer ikke vi til å se på. De to måtene vi skal se på, er bind-mounts... Det er da direkte å binde hosen. Når man starter en container... Docky container run... Så legger man på den opsjonen minus v. Og slash house dir er da filsystemet her på hosen. I vårt tilfelle er det på Linux v. Og så slash-app. Det er da filsystemet i containeren. Så det vi skal gjøre etterpå, er å koble det til vår WWW hotml på containeren. Koble det til et filsystem her, sånn at vi kan endre innholdet på webserveren mens den kjører. Dette gjør det samme med et volum, men da må vi først gi dokker. Kreere et volum med docker volum create, og så navnet på volumet. Men det er fortsatt litt tilsvarende. Den vil da i praksis ligge på i fyllsystemet her, men den kan da styres av docker. Så vi skal straks ta en pause, men vi ser her... Hvis dere vil prøve på dette i pausen, Og starte å gjøre oppgaver. Før vi tar pause... Det er noen volum... Volume, best practices. Container should be ephemeral. Og det betyr at de skal være bruk og kast. Altså de skal ikke være evigvarende. Det er liksom hele filosofien. Men dette er et litt mer sånn avansert råd. Avoid monting directories from the host in production. Det som er en kanskje enda bedre måte å gjøre dette på, er å ha egne containere som inneholder data. Og som det står her, dette er hvordan det er brukt i Kates K8S.", "source": "lecture"}
{"lecture_id": "linux8del6", "chunk_id": "linux8del6_0002", "start": 342.26, "end": 400.0, "token_count": 166, "text": "Volume, best practices. Container should be ephemeral. Og det betyr at de skal være bruk og kast. Altså de skal ikke være evigvarende. Det er liksom hele filosofien. Men dette er et litt mer sånn avansert råd. Avoid monting directories from the host in production. Det som er en kanskje enda bedre måte å gjøre dette på, er å ha egne containere som inneholder data. Og som det står her, dette er hvordan det er brukt i Kates K8S. Det er da en forkortelse for Kubernet. Men det vi skal se på i dag, er hvordan vi faktisk monterer pilsystemer fra Håsen inn i...", "source": "lecture"}
