{"lecture_id": "linux8del2", "chunk_id": "linux8del2_0000", "start": 0.0, "end": 189.88, "token_count": 591, "text": "Jo, for det første så gjør det det enkelt å sette opp og kopiere et helt driftsmiljø. Hvis man har en applikasjon som man skal utvikle, så kan man sette opp hele det miljøet med nøyaktig riktige versjoner av kompulator, bibliotek osv.. Den som skriver koden, kan da enkelt teste ut koden, at den virker som den skal, i en kopi av det miljøet som faktisk skal kjøre koden. Man kan ikke teste i produksjon direkte, for da kan du risikere å stoppe hele produksjonsmiljøet. Men samtidig er det... veldig oppsiktsvekkende. Når en utvikler testekoden sin, så kjøres den i et miljø som ikke er helt lik driftsmiljøet. Da blir det mye vanskeligere å teste, og det blir en mye større prosess å committe kode. Og få den til å kjøre. Vi har ikke sett så mye på det, men vi skal se litt mer på... Og det kanskje allerede neste uke. Virtuelle maskiner og VM-er. Men dere har jo fått virtuelle maskiner som dere kjører, Linux-VM-er. Og mange av dere har også installert Windows-VM-er med version-boks. Og det er på en måte en annen måte å sette opp et helt stort miljø, som kan være nøyaktig likt driftsmiljøet. Da må du ha for hver maskin, for hver virkuell maskin, så må du ha hele operativsystemet. Og det er veldig omfattende. Det er digert i forhold til containere. Containere er små og raske å starte og stoppe. Og det skyldes rett og slett at hvis du kjører ti Linux-containere på én maskin, sånn som... Oppgaven denne og forrige uke går ut på. Så bruker alle de ti konteinerne det samme underliggende operativsystemet. Da sparer man masse ressurser i forhold til om man skulle kjøre ti virtuelle maskiner. For da ville hver enkelt virtuelle maskin ha hele Ubuntu-operativsystemet, hvis man brukte Ubuntu. Og det krever veldig mye mer ressurser å... Både minne og... Se spesielt til minne. En annen grunn til, eller kanskje en av de viktigste grunnene til", "source": "lecture"}
{"lecture_id": "linux8del2", "chunk_id": "linux8del2_0001", "start": 150.0, "end": 335.64, "token_count": 590, "text": "Oppgaven denne og forrige uke går ut på. Så bruker alle de ti konteinerne det samme underliggende operativsystemet. Da sparer man masse ressurser i forhold til om man skulle kjøre ti virtuelle maskiner. For da ville hver enkelt virtuelle maskin ha hele Ubuntu-operativsystemet, hvis man brukte Ubuntu. Og det krever veldig mye mer ressurser å... Både minne og... Se spesielt til minne. En annen grunn til, eller kanskje en av de viktigste grunnene til at dokker har blitt så populært og så mye brukt, er at det er en viktig del av continuous delivery og continuous development. Historisk så var det sånn at for ca. 20 år siden, rundt år 2000, så ble alt drift... Da hadde man serverrom hvor fysiske servere hadde applikasjoner som så kjørte. Da kunne det være både webservere og databaser på samme fysiske server. Men felles for alle var at det var veldig tungt å drifte. Hvis man skulle oppgradere eller vedlikeholde, så var det en stor prosess. Så kom man med oppdateringer en gang i halvåret, maks en gang i måneden. Kanskje noen kom en gang i året med oppdateringer av applikasjoner. Fordi det var en stor prosess å sette det opp og teste osv. Og ikke minst å kopiere driftsmiljøet og gjøre reelle tester av programmene. Men så kom... Nå har det kommet en revolusjon med DevOps, som er et tettere samarbeid mellom Development Operations. Altså mellom de som utvikler og de som drifter programvåret. For 20 år siden var det sånn at de var to helt atskilte miljøer som samarbeidet veldig lite. Programmererne var fornøyd når de hadde fått ferdig koden, og så sendte den til drift, som så skulle drifte. Men det førte med seg en enorm rekke med problemer når man deployer, setter i gang nye systemer og skal gjøre det. Og dermed så kom det et nytt mantra, som var på at man skulle kunne committe kode mye oftere. Ti ganger om dagen var liksom det første målet som man hadde. Og for 20 år siden så var det nærmest utenkelig. Men i dag så er dette hverdagen i veldig mange bedrifter,", "source": "lecture"}
{"lecture_id": "linux8del2", "chunk_id": "linux8del2_0002", "start": 294.58, "end": 515.76, "token_count": 587, "text": "når de hadde fått ferdig koden, og så sendte den til drift, som så skulle drifte. Men det førte med seg en enorm rekke med problemer når man deployer, setter i gang nye systemer og skal gjøre det. Og dermed så kom det et nytt mantra, som var på at man skulle kunne committe kode mye oftere. Ti ganger om dagen var liksom det første målet som man hadde. Og for 20 år siden så var det nærmest utenkelig. Men i dag så er dette hverdagen i veldig mange bedrifter, og spesielt store, moderne bedrifter som Google og Facebook osv. De bruker dette hele tiden. At hver gang en utvikler... lager noe nytt, så blir det automatisk, i veldig stor grad automatisk testet i driftsmiljø. Men da er det i driftsmiljø. Kua er også en del av det. Alt foregår automatisk. Docker, eller containere, er en veldig viktig del av hele det løpet med å levere kode kontinuerlig. Det er å sette opp store, komplekse systemer med kubernetis. Kubernetis er en måte å orkestrere eller sette opp komplekse systemer ved hjelp av dokker og konteinere. I en kubernetis kalles det pods. Det er et system av én eller flere dokkerkonteinere som kjører innen Dette ble også mye brukt, eller nærmest eksplodert, i bruk av containere. Og spesielt Kubernetes. Et eksempel på dette, som jeg nevnte sist, er finn.no. Og neste slide er hentet fra en bloggpost fra en som jobber i Finn. Vi ser at det er et ganske... Det er et ganske komplekst system som de har i Finn. De bruker en rekke forskjellige verktøy. Vi ser nederst her infrastrukturen, hvor de bruker både cloud, men også open sack lokalt. Men det som er kjernen i det hele, som vi ser her, Utviklerne som sitter her oppe og bruker alle disse verktøyene. Den typiske strømmen er at de committer til Github. Og så både testes og kjøres konen deres i dockercontainere. Og alt dette her er da typisk orkestrert med kybernetis. Allerede i dag så er det ganske vanlig å komme ut i bedrifter som bruker dere,", "source": "lecture"}
{"lecture_id": "linux8del2", "chunk_id": "linux8del2_0003", "start": 463.96, "end": 538.0, "token_count": 209, "text": "Vi ser nederst her infrastrukturen, hvor de bruker både cloud, men også open sack lokalt. Men det som er kjernen i det hele, som vi ser her, Utviklerne som sitter her oppe og bruker alle disse verktøyene. Den typiske strømmen er at de committer til Github. Og så både testes og kjøres konen deres i dockercontainere. Og alt dette her er da typisk orkestrert med kybernetis. Allerede i dag så er det ganske vanlig å komme ut i bedrifter som bruker dere, og det kommer helt sikkert til å øke kontinuerlig. Så det var den lange forklaringen på hvorfor vi snakker om dere. Men det er generelt fornuftig å stille den type spørsmål. Hvorfor holder vi på med akkurat det vi gjør?", "source": "lecture"}
