{"lecture_id": "linux5del13", "chunk_id": "linux5del13_0000", "start": 0.0, "end": 245.36, "token_count": 593, "text": "Vi skal se på assosiative ri, som er ri som er indeksert med tekststrenger i stedet for tall med vanlige ri. Og for å bruke assosiative ri, så må vi deklarere dem. Så de deklarerer vi på følgende måte, declare, minus a, og så navnet på ri. Nå vil jeg ha et rr-e som heter mann. Og dette rr-et skal da definere f.eks. hvem som er mannen til Eva. Det er da typisk Adam. Kan man f.eks. ha mannen til Kari er Per, osv. Så kan man også ha strenger som inneholder mellomrom, f.eks. mann til kun Kari på den måten. Da må man bruke apostrofer. Det kan f.eks. være Per Olav som er mannen til Kari. Sånn. Av et terrøy, altså av mann, så kunne man tenke seg at man kunne skrive det sånn. Mann av Eva. Men det fungerer ikke helt. Igjen, assosiativære har kommet i ettertid. Så igjen må man bruke denne konstruksjonen for å få ut mann av Eva. Og også... Man skriver nå Gunn Karison. Så fungerer det faktisk. Men det fungerer uten å ha anførsel til Per Olav i begge tilfellene. Så har man da igjen de vanlige konstruksjonene med at hvis man skriver mann av alfakrønn på den måten, så får man ut alle... Så får man ut alle verdiene. Det er som vanlig Røy. Alle verdiene og alle indeksene får man også, som for vanlig Røy, med et utropstegn foran. Da er verdiene Kari, Eva og Gunn Kari. Men dette er da ett element. Så kan man også se på antall. Som er hashtag mann. Og da ser vi at dette er tre elementer. Vi kan teste ved å løpe gjennom alle elementene. Så kan vi se om vi får ut en riktig forløper. For da vil man løpe gjennom i form av rabbel i, inn... Og så ønsker vi da å løpe gjennom... Disse, det er indeksene. For alle disse indeksene, så kan vi f.eks. skrive ut mannen til... Og så må vi da ha... Jo, mannen til I er da... Og mannen til I vil være denne. Sånn. Og på den måten så ser vi at vi løper gjennom alle indeksene.", "source": "lecture"}
{"lecture_id": "linux5del13", "chunk_id": "linux5del13_0001", "start": 185.42, "end": 299.36, "token_count": 271, "text": "Så kan vi se om vi får ut en riktig forløper. For da vil man løpe gjennom i form av rabbel i, inn... Og så ønsker vi da å løpe gjennom... Disse, det er indeksene. For alle disse indeksene, så kan vi f.eks. skrive ut mannen til... Og så må vi da ha... Jo, mannen til I er da... Og mannen til I vil være denne. Sånn. Og på den måten så ser vi at vi løper gjennom alle indeksene. Det vil si nesten... Den... Det her fungerte ikke helt. Og det vi må gjøre da, er at vi må sette... Oi. Inn den vi løper gjennom. Da fungerer det som vi skal, for da kommer Gunn og Kari. Det kommer som ett enkeltelement, siden det settes i anfølgelsestegn. Hvis man ikke gjør det, så ser vi at Gunn og Kari får bli to elementer i forløkken. Så det er viktig å ta med de anfølgelsestegnene. Løpe gjennom en løkke på den nå.", "source": "lecture"}
