{"lecture_id": "linux9del3", "chunk_id": "linux9del3_0000", "start": 0.0, "end": 216.0, "token_count": 583, "text": "Vi kan starte med PØL, som dere kanskje ikke har så stort tett forhold til. Bare for å forklare hvordan dette ser ut. Ja, her ser vi... Nei, dette var POP. Her ser vi POP-koden. Så denne POP-koden gjør dette, som er nøyaktig det samme som... Den har klart å gjøre dette 400 ganger på samme tid. Det betyr at POP-koden er 400 ganger så raskt som skjellskriftet. Så POP er oppe som en kandidat til å være raskest. Vi kan prøve å ta alle under én kamp. Jeg tror det står times equal i alle filene. Så jeg kan prøve å greppe på times equal. Og da får vi på en måte opp en resultatliste, hvis vi nå sorterer etter det største tallet. Og da ser vi... Vi kan komme tilbake til den. Men vi ser faktisk at av de som vi har kjørt, så er Java det raskeste programmet. Det er kanskje ganske overraskende. Det var bare fire av dere som trodde det. Java er 20 000 ganger raskere enn Skjellskriftet. Så det viktigste å ta med seg her fra dette, er at det er en... Ekstrem forskjell i regnekraft på programmeringsspråk som Java og C sammenlignet med et Shellscript. Shellscript er ekstremt trege til denne type oppgaver. På andreplass her så ser vi C-programmet kommer. Og på... skal vi se... ja, tredjeplass... Så kommer POP med 400, som vi så. Ganske overraskende så ser vi at Pyton også er vesentlig tregere enn f.eks. C. Vi ser at det er en faktor på 100 her. Så å kjøre dette i C og Java går mer enn 100 ganger så fort som om man kjører det i Pyton. En spearl er omtrent like rask som Pyton. Hvilken er den som har 28 000? Ja, det kommer jeg tilbake til. Så... Det første vi kan lære her, er at det er veldig stor forskjell. Og delvis skyldes dette at språk som Python, POP og Pearl er interpretert. Det betyr at de tolkes, så de kjører ikke kode direkte på CPU. Men også Java. Ved hjelp av just in time compiling, så vil Java kunne", "source": "lecture"}
{"lecture_id": "linux9del3", "chunk_id": "linux9del3_0001", "start": 175.68, "end": 374.0, "token_count": 590, "text": "En spearl er omtrent like rask som Pyton. Hvilken er den som har 28 000? Ja, det kommer jeg tilbake til. Så... Det første vi kan lære her, er at det er veldig stor forskjell. Og delvis skyldes dette at språk som Python, POP og Pearl er interpretert. Det betyr at de tolkes, så de kjører ikke kode direkte på CPU. Men også Java. Ved hjelp av just in time compiling, så vil Java kunne optimalisere, sånn at den i praksis kjører kode rett på CPU-en. Dvs. at det ikke er noen virtuell maskin imellom som først tolker koden, og så kjører den. Dette gjør at disse programmene er ganske mye tregere. Da kommer jeg tilbake til 28 000. For som vi så, så gikk faktisk sånn default, så gikk C-programmet saktere enn jeg var. Og det er det mange som stusser på, med god grunn, for man har alltid hørt at C og C pluss pluss, det er det raskeste som fins. Og det stemmer faktisk også. Men det vi har glemt å tenke på her, er... Når jeg kompilerer C-programmet på den måten her, og kjører det, så er GCC optimalisert for å kompilere raskt. Og det er ikke optimalisert for å gi rask kode. Derfor så har jeg da lagd en sum O, hvor O står for optimalisert. Og hvis man... Det er da samme koden. Hvis man kompilerer den... Og kjører. Så får man en optimalisert ferdig kode som går raskest mulig. Den gikk da litt under fem sekunder, men hovedpoenget med dette var at der kom tallet 28 000, som faktisk skulle vært litt større. Vi ser at vi kunne kanskje kommet opp i 35 000 med denne her. Så C er faktisk den... Det aller raskeste språket. Og vi ser her i kommentaren at det er nesten sju ganger raskere med minus O. Så det jeg kan... Ja, og i oppgaven denne uken, så... Så blir dere bedt om å tilpasse disse programmene til å kjøre på dokker. Jeg kommer tilbake til dokker etterpå og ser hvordan det går der. Men tanken er da at hvis tiden ikke er helt den samme som her,", "source": "lecture"}
{"lecture_id": "linux9del3", "chunk_id": "linux9del3_0002", "start": 340.24, "end": 548.66, "token_count": 599, "text": "Det aller raskeste språket. Og vi ser her i kommentaren at det er nesten sju ganger raskere med minus O. Så det jeg kan... Ja, og i oppgaven denne uken, så... Så blir dere bedt om å tilpasse disse programmene til å kjøre på dokker. Jeg kommer tilbake til dokker etterpå og ser hvordan det går der. Men tanken er da at hvis tiden ikke er helt den samme som her, så må dere prøve å tilpasse tallene sånn at dere får et antall ganger i dokker på Linux-VM. For det vil være litt forskjell på dette her. Hvis vi kjører det rett over, så skal vi se at ikke alle går på på samme tid. Måten man kan gjøre det på, den kan vi prøve å illustrere her, er at vi ser... Dette programmet, SumO.c, det burde kjørt litt flere ganger. For det skal opp i 5,5 sekunder. Så det man kan gjøre da, at man kan regne ut tiden det tok på skjellskriftet, som er ca. 5,5. Og så kan man dele på 3,69, som er tiden C-programmet bruker. Da skal vi få 1,5. R er for øvrig en liten schellscript som gjør at det kan regne i kommandolinjen. Jeg får nå 1,5, og det betyr at da kan faktisk dette programmet klare å kjøre 1,5 ganger... Jeg kan ta 1,5 ganger... 28 000. Da ser vi at jeg får 42 000. Så tanken er da... Ok, da går jeg inn i sumo.c. Og så endrer jeg den til 42 000. Sånn. Så tar jeg og kompilerer på nytt med GCC. Nå har jeg endret times, sånn at også denne tar 5,5 sekunder. Så den riktige fasiten nå er at C, optimalisert C-kode, er 42 tuner. Det er ganske enorm forskjell. Så... dette er det viktig å ha med seg når man ser på... når man vurderer hvilket språk man skal velge for å gjøre denne oppgaven. Med en gang det har noe med regning å gjøre, Så er det fornuftig å velge C eller C++. C++ er omtrent like raskt som C. Alternativt Java, som pga. Just in time compiler også er veldig raskt.", "source": "lecture"}
{"lecture_id": "linux9del3", "chunk_id": "linux9del3_0003", "start": 486.18, "end": 607.3, "token_count": 297, "text": "Så den riktige fasiten nå er at C, optimalisert C-kode, er 42 tuner. Det er ganske enorm forskjell. Så... dette er det viktig å ha med seg når man ser på... når man vurderer hvilket språk man skal velge for å gjøre denne oppgaven. Med en gang det har noe med regning å gjøre, Så er det fornuftig å velge C eller C++. C++ er omtrent like raskt som C. Alternativt Java, som pga. Just in time compiler også er veldig raskt. Den vi ser her nå, er i dette tilfellet dobbelt så raskt som Java. OK. Hvis vi går og ser på det dere svarte i utgangspunktet, så... Så er det opplagt at det er ikke så lett å... Eller generelt så har man ikke så mye intuisjon på hvor raskt ting går. Men det er en veldig stor forskjell, så det er det greit å huske å ha med seg videre. Vi skal se etterpå, etter pausen, at resultatene er veldig forskjellige. Så man kan ikke ta dette resultatet og bruke som det er. Dette gjelder kun for CPU-intensive jobber.", "source": "lecture"}
