{"lecture_id": "linux11del6", "chunk_id": "linux11del6_0000", "start": 0.0, "end": 185.88, "token_count": 597, "text": "Da skal vi se på Windows PowerShell. Windows PowerShell kom i 2006. Og det er da både et kommandolinjeverktøy og et skriftspråk for Windows. Som vi skal se, så er du veldig kraftig inspirert av Linux-versell. Det er mange ting som ligner, og mange konstruksjoner som er like. Linus har noe sånn Dev.0. Helt tilsvarende Dev.0, har man også i Foreshell. Og det er en rekke andre likheter. Pipes og omdirigering, f.eks. Er helt likt som på Linus. Siden Windows 2008 server og Windows 7, så har Foreshell vært installert sånn default. Men det er foreløpig ikke helt default. På samme måte som Linus-skjellet, så er PowerShell bygd opp av mange små programmer, eller commandlets, som gir en veldig fleksibel måte å løse oppgaver på. Siste versjon er 7,0, men all beskrift har fortsatt en else.pc1. Selv om det var opprinnelig, så var det PowerShell... Men da PowerShell versjon 2 kom, fortsatte man med PC1 Extension. Og det har man fortsatt. Et veldig viktig prinsipp i PowerShell er at alt er objekter. I utgangspunktet er Windows objektorientert, skrevet i C pluss pluss. Og alt i Windows er i utgangspunktet objekter. I tillegg er konfigurasjonen i Windows ikke basert på tekstfiller, Men på binære filer og databaser, som Registry, som er en stor binær database. Dermed kan man ikke, som vi er vant til fra Linus, trekke ut all informasjon fra tekstfiler. Man må også kommunisere med disse binære databasene. Og da er det en veldig effektiv måte å gjøre det på. Det er å bruke den samme objektorienteringen. Derfor er også Portial objektorientert. Vi har sett med Linux at der sendes strømmer av tekst mellom kommandoer med pipes og omdirigerer. Og det er et veldig kraftig verktøy. PowerShell, derimot, sender ikke tekst, men det sender hele objekter mellom sine command lets ved hjelp av pipes. Og det er, som vi skal se, ganske genialt. For det gjør at PowerShell blir enda kraftigere enn Linux selv. For når man har objekter, så kan man på en helt annen måte spørre objektet", "source": "lecture"}
{"lecture_id": "linux11del6", "chunk_id": "linux11del6_0001", "start": 150.0, "end": 328.16, "token_count": 600, "text": "Vi har sett med Linux at der sendes strømmer av tekst mellom kommandoer med pipes og omdirigerer. Og det er et veldig kraftig verktøy. PowerShell, derimot, sender ikke tekst, men det sender hele objekter mellom sine command lets ved hjelp av pipes. Og det er, som vi skal se, ganske genialt. For det gjør at PowerShell blir enda kraftigere enn Linux selv. For når man har objekter, så kan man på en helt annen måte spørre objektet om hvilke egenskaper du har som objekt. Og så kan man bruke disse egenskapene når man skriver skrift. Og da slipper man veldig mange av de problemene man har i Linux selv, med syntaksfeil og finne ut hvilken informasjon man skal gjøre, og drive og parse tekst. Plukke ut riktige biter av tekst. Det kan være tunget i Linus, men med Vinos PowerShell så er det mye enklere. Det finnes fire typer kommandoer i PowerShell. Commandlets er den viktigste. Det tilsvarer helt bæsj-shell-biltits. Kommandoer som pwd, som er en del av skjellet. I PowerShell heter det get location. Og echo, som i PowerShell heter write output. De er bygd inn i skjellet. Og det samme er command lets. Men i PowerShell så er command lets det aller vanligste. Stort sett alle kommandoer er command lets. I tillegg så har vi noen applications. Og det er eksisterende Windows-programmer, sånn som Ping og IP-konfig. Og de finnes fortsatt. Og det er programmer som ligger da på disk. Akkurat som bind.mv, f.eks. i Linus. I Linus er bind og user-bind der har de de aller fleste kommandoene. Så har vi skript. Tekstfilet med nc.pc-en er et post-it-skript. Det tilsvarer bæsj-skript som vi har drevet med. I tillegg har det funksjoner som ligner veldig på funksjoner i bæsj-hegg. Hello World-program har verdens korteste Hello World-program. For man trenger ikke å skrive ekko. Man kan bare ha en fil som inneholder strengen Hello Work. Når man kjører den, så vil den da skrive ut Hello Work. Da lager man bare en fil, hello.cn. Så gjør man det etterpå. Så kjører man den på den måten, og så får du ut Hello World.", "source": "lecture"}
{"lecture_id": "linux11del6", "chunk_id": "linux11del6_0002", "start": 286.34, "end": 487.92, "token_count": 592, "text": "Det tilsvarer bæsj-skript som vi har drevet med. I tillegg har det funksjoner som ligner veldig på funksjoner i bæsj-hegg. Hello World-program har verdens korteste Hello World-program. For man trenger ikke å skrive ekko. Man kan bare ha en fil som inneholder strengen Hello Work. Når man kjører den, så vil den da skrive ut Hello Work. Da lager man bare en fil, hello.cn. Så gjør man det etterpå. Så kjører man den på den måten, og så får du ut Hello World. For å få lov til å kjøre et skritt... Så må du sette execution policy. For i utgangspunktet så er execution policy satt sånn at det ikke er lov å kjøre påskjøttskript. Så det vi anbefaler å gjøre, er å sette execution policy til remote signed. Da betyr det at da kan du kjøre alle script som du lager selv, på din maskin. Men så kan du også kjøre script som er signert av en trusted publisher. Det er noen man stoler på, som Michaelson stoler på, som har lagd script. De kan du laste ned og fortsatt kjøre. Dette sikrer at hacker f.eks. ikke laster ned skumle PowerShell-script, og så kjører de lokalt på din maskin. For da har denne excision policyen sørget for at de ikke blir kjørt. Så lenge de ikke kommer fra en annen trøstet porters. For å få til dette, så må du ha administratorrettigheter for å sette det. Jeg har nevnt at det er mange likheter med vers, og det er også gjort eksplisitt ved at man har laget aliaser for en rekke kommandelets. På høyre side der, så står det 'kommandlets'. Vi ser opplegget med kommandlets er at det står et verb først, og så hva man skal gjøre. Get content, set location, copy item osv. Men så har man lagd alias som gjør akkurat det samme på Linux. Eller man har lagd alias som har samme navn som Linux-kommandoer som tilsvarer disse kommandonettene. Og dette betyr at hvis du er vant til dette, kan du sette deg ned og så kan du kjøre alle de kjære kommandoene som Cat, CD, CP, LS, MV. Og det gjør det veldig praktisk å gå imellom PowerShell og Linus.", "source": "lecture"}
{"lecture_id": "linux11del6", "chunk_id": "linux11del6_0003", "start": 450.0, "end": 597.96, "token_count": 423, "text": "Get content, set location, copy item osv. Men så har man lagd alias som gjør akkurat det samme på Linux. Eller man har lagd alias som har samme navn som Linux-kommandoer som tilsvarer disse kommandonettene. Og dette betyr at hvis du er vant til dette, kan du sette deg ned og så kan du kjøre alle de kjære kommandoene som Cat, CD, CP, LS, MV. Og det gjør det veldig praktisk å gå imellom PowerShell og Linus. Da kan man faktisk ta en del bæsjskrift på Linux og bare kopiere rett over, og de vil da kjøre i PowerShell. Et par andre likheter som vi skal se på, er som jeg har sagt, pipes of redirection. Dette ser ut som en standard linuskommando. Den kan du kjøre på Forcel også, og den gjør omtrent det samme som i Forcel. Nei, den gjør omtrent det samme som i Linux Sheet. Men det vi skal se, er at faktisk output fra LS det er egentlig ikke i utgangspunktet bare tekst. Det er en hel... Det er et helt objekt. Men likevel så kan man gjøre det på den måten. Variabler håndteres på samme måte som i Linux. Den eneste forskjellen er at der har man alltid et dollartegn foran variablen. Sånn som i POP, f.eks. I tillegg er ikke PowerCel som var på Syntax. Det spiller ingen rolle. Og som sagt, så trenger man ikke å skrive ekko. Bare skriv dollar hver, så skrives verdien av variabelen ut. Ok. Da har vi sett litt på Powercel på en mer teoretisk måte. Men nå skal vi se på Powercel i praksis.", "source": "lecture"}
