{"lecture_id": "linux9del6", "chunk_id": "linux9del6_0000", "start": 0.0, "end": 217.16, "token_count": 596, "text": "Det jeg tenkte å gjøre først... hvis jeg deler et annet vindu med dere... Det er altså å se på en tekstversjon av dette. For til nå har vi bare sett på CPU-intensive prosesser. Så hva nå om... Vi ser på tekst. Og da er det en... En annen oppgave denne uken går ut på å laste ned denne filen med VGT. Det er en TAR-fil som inneholder en rekke programmer som... Som gjør noe av det samme, men vi kan se hva de gjør. Vi har nå et perskript. I denne mappen som du får når du pakker ut TAR-filen, Oppgaven til dette programmet er å lage en ny fil, som vi ser øverst her. Så leser man inn linje fra linje fra den store filen. Før man begynner å kjøre dette skriptet, må man kopiere filen stor til slash temp. stor. Så leser hver linje i den store filen linje for linje. Med et tall først på linjen til en annen pil. Så dette er da en helt annen type oppgave enn å stå og regne. Her er det tekstbehandling og skriving til pil. Og det tar ofte litt tid, det å skrive til pil. Da vil du se en veldig stor forskjell på hastigheter. Da er det ikke de samme forskjellene som tidligere. Vi kan nå se på field.cpp. Det er da et C++-program som gjør akkurat det samme som Shell-skriptet. Her har jeg juksa litt og lagd en round.shell som kopilerer og kjører og timer og så videre. Så...  Før jeg gjør dette litt raskt, så kan jeg bare starte Rundot Shell. Og så ser vi... Jo. Det vi ser nå, er... Det siste tallet her var så lang tid Shell-skriptet brukte. Og dette var tiden for de andre. Det som er interessant, er at nå er det faktisk noen time. Det vil si at alle programmene utfører den samme oppgaven. Og da ser vi at Shell-skriptet bruker nå 5,5 sekunder som før. Mens Yaway, f.eks., bruker 0,8 sekunder. Så det betyr at Yaway i dette tilfellet er bare åtte ganger så raskt. Mens i regnejobben så var Javar 20 000 ganger raskere. Så vi ser en enorm forskjell i hvor mye raskere programmene er.", "source": "lecture"}
{"lecture_id": "linux9del6", "chunk_id": "linux9del6_0001", "start": 180.84, "end": 345.34, "token_count": 593, "text": "Det som er interessant, er at nå er det faktisk noen time. Det vil si at alle programmene utfører den samme oppgaven. Og da ser vi at Shell-skriptet bruker nå 5,5 sekunder som før. Mens Yaway, f.eks., bruker 0,8 sekunder. Så det betyr at Yaway i dette tilfellet er bare åtte ganger så raskt. Mens i regnejobben så var Javar 20 000 ganger raskere. Så vi ser en enorm forskjell i hvor mye raskere programmene er. Av en eller annen grunn så er Pøl veldig raskt på akkurat dette her. Nei, til og med raskere enn C++-programmene. Begge er mer enn ti ganger raskere enn Shell-skriptet. Men hvis vi husker tilbake... Så var C-programmet noe sånt som var der 48 000 ganger raskere enn Skjellskriptet. Så vi ser en enorm forskjell i hastighet. Det er en enorm forskjell i forskjellen i hastighet. Avhengig av hvilken arbeidsoppgave man skal gjøre. Typisk så er resultatene ekstreme hvis det gjelder CPU-bruk. Mens hvis det gjelder å... Og skrive til filer og ting som systemet bruker en del tid på, så er ikke forskjellene så store. Her med Shellscript er det veldig mange systemkall som går med. Kjernen bruker mye tid. Ja. En kommentar til til resultatene i hastighet. Vi så f.eks. at Python bare var 40 ganger raskere enn Shell. Mens... C pluss, pluss var 40 000 ganger raskere. Så det er en veldig stor forskjell der. Til det må man si at hvis man skulle gjort noe tilsvarende i Python... Så finnes det en rekke biblioteker i Python, og de er ofte skrevet i C og C pluss, pluss. Så det betyr at hvis man har noen regneoppgaver i Python, så brukes ofte biblioteker som er mye raskere. Sånn at... Det er ikke sånn at Python alltid er ekstremt tregt, men med de rette bibliotekene så kan Python også være veldig effektiv. Og det er en stor fordel med Python, at det fins veldig mange biblioteker som man kan bruke til å løse de problemene man har.", "source": "lecture"}
{"lecture_id": "linux9del6", "chunk_id": "linux9del6_0002", "start": 308.22, "end": 374.96, "token_count": 259, "text": "Så finnes det en rekke biblioteker i Python, og de er ofte skrevet i C og C pluss, pluss. Så det betyr at hvis man har noen regneoppgaver i Python, så brukes ofte biblioteker som er mye raskere. Sånn at... Det er ikke sånn at Python alltid er ekstremt tregt, men med de rette bibliotekene så kan Python også være veldig effektiv. Og det er en stor fordel med Python, at det fins veldig mange biblioteker som man kan bruke til å løse de problemene man har. Uansett, hvis man går på en større programmeringsoppgave hvor effektivitet spiller en rolle, så kan det være verdt... Og ta en liten sjekk på forhånd før man velger programmeringsspråk. Og se hvor effektivt programmeringsspråket er på akkurat den type oppgaver som programmet stort sett skal gjøre. Det er kanskje den viktigste lærdommen å ta med fra dette.", "source": "lecture"}
