{"lecture_id": "linux8del3", "chunk_id": "linux8del3_0000", "start": 0.0, "end": 202.64, "token_count": 594, "text": "Som dere ser så er det... Her har jeg mange konteinere som faktisk er oppe og kjører. Jeg har seks konteinere som står og kjører. Men det viser seg at det tar ikke så veldig mye ressurser. Hvis jeg kjører topp her nå, så... Ja, det... Vi har ikke all verden med minne her. Vi har en gigabyte, har brukt alt av det. Vi kan også se på... vi ser det er en del overlay som er i dokkerinstansene. Men hvis vi ser på den minnebruken, så tar imagene litt plass. Men ikke så voldsomt. Men det som er fint, er at når jeg har seks containere som kjører her, så er det egentlig seks fullverdige. De kjører webservere. Det er fullverdige systemer, men de bruker lite diskplass. Og relativt lite minne også. Det hadde ikke vært mulig å kjøre seks sånne VM-er på. På denne VM-en her. Vi sier også kjøre VM på VM, men det går faktisk an. Det er ganske vanlig å kjøre konteinere inni VM-er. Man kan også kjøre VM-er inne. Det er klart. Det går med en gang litt... litt saktere. Men det er generelt hardway-støtte for å gjøre akkurat det. Ja. Det jeg tenkte å gjøre først, var å se på hvordan man kan rydde opp i alt dette her. Vi var vel inne på det litt sist, men hvis jeg tar PC minus A, så ser vi... Enda flere. Det er også da konteinere som er stoppet. Så... Generelt så vi sist på noen metoder for å stoppe... Ikke for å stoppe, men for å fjerne containere som ikke kjører. Og bl.a. Docker Prune kan man bruke. I oppgavene denne uken så er det en oppgave som går ut på å lage et script. Som sletter alt som er av konteinere som kjører og som ikke kjører. Jeg kan vise en teknikk som vi bruker for å få til det. Hvis jeg tar Dokker container... LS... Man kan bruke både LS og PS. Så lister jeg jo alle. Så ser vi at jeg får ut... bare ID-en. Dette kan jeg bruke i et skript eller fra kommandolinje til å stoppe enkeltcontainere. Så jeg kan... Hvis jeg eksplisitt skal stoppe en container... La oss si jeg stopper den øverste her.", "source": "lecture"}
{"lecture_id": "linux8del3", "chunk_id": "linux8del3_0001", "start": 150.02, "end": 405.2, "token_count": 592, "text": "Som sletter alt som er av konteinere som kjører og som ikke kjører. Jeg kan vise en teknikk som vi bruker for å få til det. Hvis jeg tar Dokker container... LS... Man kan bruke både LS og PS. Så lister jeg jo alle. Så ser vi at jeg får ut... bare ID-en. Dette kan jeg bruke i et skript eller fra kommandolinje til å stoppe enkeltcontainere. Så jeg kan... Hvis jeg eksplisitt skal stoppe en container... La oss si jeg stopper den øverste her. Så... kopiere ID-en, og så... Sånn. Så stoppes containeren. Hvis jeg lister nå, så ser vi at vi har fått én container mindre. Hvis vi har masse containere, kan det være greit å skripte det. En måte man kan gjøre det på, er da rett og slett å skrive forløket. Får se inn for container i... Og så kan jeg ta... Og så faktisk gjøre den kommandoen der, for den gir oss da hver idé. Så nå kan jeg for hver... For hver konteiner så kan jeg do. Og så kan jeg stoppe. Dere konteiner, stopp. Og da dollar det. Her gjorde jeg tydeligvis en feil. Ja, jeg tipper den feilen jeg gjorde, var... Nei. Noen gode forslag i chatten på... Ja, hva gjorde jeg feil? Jeg skrev for C, og så skrev jeg dollar D her. Så da var det ikke så klart det ikke gikk. Så da kan man gjøre et nytt forsøk. Stopp container. Får se inn dere i containeren. Stopp container. Da ser det litt bedre ut, men det tar litt tid å stoppe. Så stopper etter hvert de andre. Så dette er første del av skriptet. Så kan man stoppe alle konteinere. Og når alle er stoppet, da er det enklere å slette alle. Da kan man... Ja, jeg tror en dokkersystem prune. Den vil... Den vil stoppe alle konteinere. Det tok litt lengre tid enn jeg hadde trodd å stoppe alle. Men da skulle det i hvert fall ikke være noen som kjører. Men hvis jeg har LSMSA, så vil fortsatt de som er exited, fortsatt være der. En dokker-system. Prune. Legg på en minus A-F. Det er for alle og Force. Da får man ikke noe spørsmål engang.", "source": "lecture"}
{"lecture_id": "linux8del3", "chunk_id": "linux8del3_0002", "start": 344.8, "end": 492.96, "token_count": 339, "text": "Da kan man... Ja, jeg tror en dokkersystem prune. Den vil... Den vil stoppe alle konteinere. Det tok litt lengre tid enn jeg hadde trodd å stoppe alle. Men da skulle det i hvert fall ikke være noen som kjører. Men hvis jeg har LSMSA, så vil fortsatt de som er exited, fortsatt være der. En dokker-system. Prune. Legg på en minus A-F. Det er for alle og Force. Da får man ikke noe spørsmål engang. Da ble det slettet en masse. Og så kan vi også se... Det var ikke så mye space som ble spart, men en god del. En halv gigabyte hjelper. Så... Hvis jeg lister nå, så vil jeg se jeg har ingen containere. Men det er fortsatt her. Det er... Nei. Det fjerner faktisk også alle image. Ja. OK. Da fikk jeg faktisk... Ja, jeg tror det var den som gjorde at alt ble slettet. Eller så kan man gjøre tilsvarende hvis man eksplisitt bare vil... fjerne image. Så kan man kjøre den kommandoen. Men nå ser vi... Alt er rensket opp. Hvis jeg nå ser på disk... DF viser diskbruk. Så ser vi at... Det er ikke enormt mye jeg har fått til. Men nå har jeg 1,6 giga. Så det var noe sånn 0,7 giga eller noe sånt som...", "source": "lecture"}
