{"lecture_id": "linux9del7", "chunk_id": "linux9del7_0000", "start": 0.0, "end": 228.42, "token_count": 599, "text": "Det jeg tenkte å se litt på nå, var regulære uttrykk. Det jeg tenkte å gjøre nå, var å teste ut noen regulære uttrykk i kommandolinjen. Vi kan først prøve... Vi kan først teste ut et eksempel på hvordan man kan bruke regulært uttrykk. Dette skriptet her... Hvis jeg kaller det RegDot selv... Dette skriptet lager et regulært uttrykk her oppe. Og så er det en wildlucky som leser inn. Og så ser vi... Her har vi testen med regulært uttrykk. Er lik til det. Det er operatoren som bæsj bruker for å teste regulære uttrykk. Og det er det samme som PØL bruker. Det vi gjør, er at vi tar én og én linje i dette programmet og tester mot det regulære uttrykket. Dette er syntaks som har kommet sent, så derfor trenger vi sånn doble klamme parenteser. Og dette skriptet sier det har match hvis vi får en match. Så vi kan bare prøve å kjøre det. Hvis vi skriver inn O sånn, så ser vi at vi får en match. Hei, så får jeg ikke noe match. Hva med en O? Nei, ingenting. Men hvis jeg skriver 'hallo', så ser vi at vi får match, for da matcher jeg den biten der. Og RGX-en så sånn ut. Det er en måte man kan bruke regulære uttrykk i skjellspråk på. Så tenkte jeg skulle se noen flere eksempler. Da kan jeg prøve å gjøre det interaktivt, sånn som det er gjort i notatene. Hvis jeg har en linje som heter Hei og ho, og så ønsker jeg å kjøre et litt mer... Avansert regulært uttrykk. Vi kan starte fra starten her. Her så ser vi vi matcher linje. Er lik tilde, den sier match med det regulære uttrykket som kommer her. Og dette er da det regulære uttrykket. Og prikk betyr den prikken som står der. Den prikken, det betyr match med... Match hvilket som helst tegn. Hvis dere ser i forelesningsnotatene lenger ned her, så har jeg listet opp noen av de viktigste regulære uttrykkene. For de av dere som har programmert til Java, så har dere kanskje brukt regulære uttrykk der.", "source": "lecture"}
{"lecture_id": "linux9del7", "chunk_id": "linux9del7_0001", "start": 186.2, "end": 410.84, "token_count": 598, "text": "Her så ser vi vi matcher linje. Er lik tilde, den sier match med det regulære uttrykket som kommer her. Og dette er da det regulære uttrykket. Og prikk betyr den prikken som står der. Den prikken, det betyr match med... Match hvilket som helst tegn. Hvis dere ser i forelesningsnotatene lenger ned her, så har jeg listet opp noen av de viktigste regulære uttrykkene. For de av dere som har programmert til Java, så har dere kanskje brukt regulære uttrykk der. Og det er stort sett de samme regulære uttrykkene. Dette bygger delvis på PØL-regulære uttrykk. Men det er noen koder som er vanlige regulære uttrykk, som man ikke kan bruke i bæsjcell. F.eks. siffer. Så har dere kanskje brukt det i regulære uttrykk slash d. Men i utgangspunktet kan man ikke gjøre det i skjell-regulære uttrykk. Man må bruke klammeparentes og null til ni for å matche et siffer. Det vi også illustrerer i dette regulære uttrykket, som generelt er veldig nyttig, er å kunne trekke ut noe av det man matcher. Hvis jeg setter parentes rundt det i det regulære uttrykket jeg vil matche, så legges det som er inni parentesen og matches, inn i en variabel som heter ra. Som heter batch. Bæsj rematch. Når vi kjører den der, så får jeg en match. For det matcher jo Hei og ho. Og så ser vi at den matchen jeg fikk inn, er Hei og... For det var det som sto inni parentesen her. Det er match én eller flere vilkårlige tegn. Og den matcher da hei og i. Det uttrykket her. Ja... Jeg ser det kommer et par spørsmål her. Skiller den på store og små bokstaver? Det er et godt spørsmål. Ja, den skiller på store og små bokstaver. Hvis jeg prøver å matche henne her, da. Så ser vi. Da får vi ingen match. Du er nødt til å ha... Du er nødt til å ha direkte match. Oi, hva klarte jeg der nå? Ja, det ser ut som jeg... Klarte å stoppe hele skjermen. Jeg kan hoppe over her. Prøver en gang til. Linje hei og ho. Og så matcher jeg med denne.", "source": "lecture"}
{"lecture_id": "linux9del7", "chunk_id": "linux9del7_0002", "start": 344.62, "end": 422.28, "token_count": 164, "text": "Skiller den på store og små bokstaver? Det er et godt spørsmål. Ja, den skiller på store og små bokstaver. Hvis jeg prøver å matche henne her, da. Så ser vi. Da får vi ingen match. Du er nødt til å ha... Du er nødt til å ha direkte match. Oi, hva klarte jeg der nå? Ja, det ser ut som jeg... Klarte å stoppe hele skjermen. Jeg kan hoppe over her. Prøver en gang til. Linje hei og ho. Og så matcher jeg med denne. Men som du ser, med en gang jeg prøver en stor bokstav, så får jeg... Ikke noe væsj.", "source": "lecture"}
