{"lecture_id": "linux5del15", "chunk_id": "linux5del15_0000", "start": 0.0, "end": 212.92, "token_count": 591, "text": "Hvis man kjører en prosess og taster kontroll c, så dreper man prosessen. Vi har også sett at man kan bruke kill, kommandoen kill, til å drepe en prosess. Det vi skal se på nå, er at prosesser kan behandle den type signaler som sendes til dem. Og det skal vi se på i et skjellskrift som behandler signaler. Her har vi noen definisjoner fra en Linux headerfile, som definerer forskjellige typer kill-signaler. Og dette er signaler som da kan sendes til... Som kan sendes til prosesser. For eksempel så er... SIGIN2 tror jeg er kontroll C. Ja, vi ser her nede at sigint 20 er kontroll Z. Og det er disse trappinstruksjonene her. Det er de som tar imot signalet. For eksempel den første her. Den tar imot signal 1, som står helt til slutt her. Og så gir den den meldingen til... I skjellet. Når... Når dette signalet tas imot. Tilsvarende tar den og behandler signal 15, 2, 20, 3, 4, 5 og kill minus 9. Det vil si, den prøver å ta imot og behandle kill minus 9. Men 9, det er en sånn sikker dreping. Sure kill. Og den kan ikke stoppe kill minus 9. Dette programmet er da bare en Lucky som står og går, og så spør den... 'Vil du avslutte?' Svarer ja eller nei? Og med mindre du svarer ja da, så nekter den å avslutte. Så vi kan starte dette skriptet. Så hvis jeg bare tasser et eller annet, så fortsetter den å kjøre. Men så kan jeg f.eks. si at jeg prøver å stoppe denne, så taster jeg kontroll C. Men da ser vi... Nei, sorry. Ignores kontroll C. Og det er fordi da, når man taster kontroll C, så sender man egentlig et signal 2, et kill-signal 2. Et interrupt-signal, men det tas imot, og så trapper man og sier... Man tar imot dette og sier... Nei, jeg vil ignorere... Så kan vi prøve å sende et kill-signal direkte til prosessen. Men da må jeg greppe på... Nå må jeg se på alle prosesser. Og da ser vi...", "source": "lecture"}
{"lecture_id": "linux5del15", "chunk_id": "linux5del15_0001", "start": 154.04, "end": 290.76, "token_count": 420, "text": "så taster jeg kontroll C. Men da ser vi... Nei, sorry. Ignores kontroll C. Og det er fordi da, når man taster kontroll C, så sender man egentlig et signal 2, et kill-signal 2. Et interrupt-signal, men det tas imot, og så trapper man og sier... Man tar imot dette og sier... Nei, jeg vil ignorere... Så kan vi prøve å sende et kill-signal direkte til prosessen. Men da må jeg greppe på... Nå må jeg se på alle prosesser. Og da ser vi... Kan jeg prøve å sende et kill-signal til denne prosessen? For det er Terpetot-shell. 19055. Hvis vi gjør det, så ser vi... Nei. Ignorerer kill minus 15. Som et standard kill-signal tilsier. Men så kan man spesifisere hvilket nummer på kill-signalet. Jeg kan prøve med minus 2. Nei, minus 2 er det samme. Så den ignorerer det. Jeg kan prøve med én. Det er hanging up. Nei, ni genererer. Det, altså. Altså for eksempel 20. Det tilsvarer kontrollsett... Det gjør vel 15, altså? Nei, det går heller ikke. Men det som fungerer, er kill minus 9. Så det... Hvis man prøver å drepe en prosess, så nekter den å dø. Og da gjør den den type signalbehandling at den... Den tar imot signalet, og så nekter den å la seg drepe. Men kill minus ni, det er en sure kill, og da ser vi... Da drepes prosessen likevel.", "source": "lecture"}
