{"lecture_id": "linux2del5", "chunk_id": "linux2del5_0000", "start": 0.0, "end": 165.8, "token_count": 593, "text": "Vi skal nå se mer på mapper og manipulere mapper med filbehandling. I Linux så er det aller meste mapper og filer. Så det er veldig nyttig å kunne manipulere på de. Flytte rundt og lage de filstrukturene man ønsker, enten fra kommandolinjen eller i et skript. Så vi tar utgangspunktet i mappen min. Som jeg står i nå. Hvis jeg lister mapper her, så ser vi her to mapper, dir1 og dir2. Det er en nyttig kommando for å se på mappestrukturen, eller trestrukturen, som heter tree. Hvis jeg kjører tree her, så ser vi at jeg får en oversikt. Da ser jeg at under dir1 så er det en mappe ved ww. Da kan jeg liste dir1, så ser jeg... Ja, her ligger det en mappe. Den er spesielt fin hvis det er relativt oversiktlige trestrukturer. Hvis de er kjempestore, så er de ikke så enkle å se. Men i dette tilfellet så får vi en fin oversikt med tre. Det jeg først skal prøve å gjøre, er å flytte dyr 1 med alt under ned til dyr 2. For å flytte på mapper så bruker jeg MV eller Move. Det er alltid det jeg ønsker å flytte, som i dette tilfellet er dir1. Og jeg ønsker å flytte dir1 til dir2, som er andre argument. Så hvis jeg gjennomfører den og ser på trestrukturen, så ser vi at da har jeg oppnådd det jeg ønsket, nemlig å flytte dir1 med undermoppe ned til dir2. Så da får jeg denne mappestrukturen. Så kan jeg flytte dir1 tilbake igjen, Så ønsker jeg å flytte den hit, til min, hvor jeg står. Og da må jeg bruke prikk, eller kan bruke prikk. Det er mappen som jeg står i. Så hvis jeg flytter tilbake sånn, så har jeg fått den opprinnelige trestrukturen jeg hadde. Så skal jeg prøve å se... Hva skjer hvis de to ikke finnes? Hvis jeg flytter de to til katt... I praksis er dir 2 katt i stedet. Hva skjer nå? Jo, da kan jeg prøve å bla tilbake med kontroll og R, og så finne den forrige MV-kommandoen. Det var ikke den.", "source": "lecture"}
{"lecture_id": "linux2del5", "chunk_id": "linux2del5_0001", "start": 133.68, "end": 294.2, "token_count": 594, "text": "Så hvis jeg flytter tilbake sånn, så har jeg fått den opprinnelige trestrukturen jeg hadde. Så skal jeg prøve å se... Hva skjer hvis de to ikke finnes? Hvis jeg flytter de to til katt... I praksis er dir 2 katt i stedet. Hva skjer nå? Jo, da kan jeg prøve å bla tilbake med kontroll og R, og så finne den forrige MV-kommandoen. Det var ikke den. Men et takt til tilbake. Nei, ikke den heller, men den var det jeg gjorde tidligere. Flyttet dir 1 til dir 2. Så hvis jeg utfører den kommandoen nå, hva skjer når ikke dir 2 finnes? Jo, den kjører den kommandoen, og det som skjer da, er at da, i stedet for å flytte dir1 til dir2, så endres da bare navnet på dir1 til dir2. Så det er klart, hvis du gjør sånne operasjoner i et skript, så må man tenke gjennom og være klar over alle muligheter. Altså hva skjer hvis dir2 finnes fra før, og hva skjer hvis den ikke finnes fra før. Da skal vi se på en litt annen problemstilling, hvor vi i stedet for å flytte, så skal vi kopiere mapper. Da kan jeg prøve å lage den samme strukturen igjen hvis jeg flytter dyr 2 til dyr 1. Og så renamer jeg katt til dyr 2. Så skulle jeg ha en lik... Filstruktur. Eller mappestruktur. Så... Ja, for å få litt mer innhold, så kan jeg lage en... Lage en fil med kommand og touch i mappe 1. Eller dire 1. Sånn som det. Og så ønsker jeg nå å ikke flytte, men å lage en kopi. Jeg ønsker å ta en kopi av hele det. Sånn som det. Så ønsker jeg nå å ikke flytte, men å lage en kopi. Med innhold og legge inn i deal 2. Da kan jeg ikke bruke MV, for da flyttes alt. Jeg ønsker en kopi. Og jeg kan heller ikke bare ta CP, for da får jeg ikke med innhold. Så hvis jeg skal ha med hele trestrukturen, så må jeg legge til opsjonen minus R for rekkerskyv.", "source": "lecture"}
{"lecture_id": "linux2del5", "chunk_id": "linux2del5_0002", "start": 259.18, "end": 400.56, "token_count": 458, "text": "Sånn som det. Og så ønsker jeg nå å ikke flytte, men å lage en kopi. Jeg ønsker å ta en kopi av hele det. Sånn som det. Så ønsker jeg nå å ikke flytte, men å lage en kopi. Med innhold og legge inn i deal 2. Da kan jeg ikke bruke MV, for da flyttes alt. Jeg ønsker en kopi. Og jeg kan heller ikke bare ta CP, for da får jeg ikke med innhold. Så hvis jeg skal ha med hele trestrukturen, så må jeg legge til opsjonen minus R for rekkerskyv. Så da tar jeg en rekkerskyv-kopi av deal 1 og ønsker å legge kopien i deal 2. Hvis jeg nå taster 3, så får jeg se at jo, da har jeg oppnådd det jeg ønsket. Jeg har fått en kopi av hele denne mappestrukturen inn i DIRL2. Så kan jeg igjen prøve å se hva ville skjedd her hvis DIRL2 ikke fantes. Og da kan jeg jo først... For å få samme mappestruktur kan jeg slette DIRL1 igjen. Da sletter jeg den. Da er vi tilbake der vi var. Men så må jeg ta DIRR2 og så endre navn til katt, f.eks. Og så prøve å se hva som skjer hvis jeg nå gjør en kopi. Hva skjer nå hvis jeg gjør CP minus R dire n dir 2? Akkurat som sist. Ja, det fungerer iallfall. Og det som jeg ser jeg gjør nå, det er at jeg får en nøyaktig kopi av hele dire 1, som kalles dire 2. Og disse kommandoene med re 1 og cd... Lekeskiv på CP. Og på RM. De er det veldig nyttig å kunne når du skal manipulere på Linux-filsystem.", "source": "lecture"}
