{"lecture_id": "linux6del10", "chunk_id": "linux6del10_0000", "start": 0.0, "end": 204.32, "token_count": 578, "text": "Vi skal nå se på SEP, eller Secure Copy, som er en veldig nyttig kommando for å kopiere filer mellom Linux hosts, eller mellom hosts som har installert SSH. Og SEP, den krypterer alt som sendes, så det er også en trygg måte å kopiere på. Ja, her kan vi se... Her er jeg på en Linux-VM, eller en container, gruppe 100. Og så har jeg her nede en server, Nexus, som jeg har SSO-tilgang til. Det jeg kan gjøre da, er... La oss si jeg ønsker å kopiere over én fil, én fil.tkd, til Nexus, den andre serveren. Da må jeg skrive først brukernavnet at Nexus. Og så må jeg ha med hele domenenavnet. Hioa.no. Og så må det være et kolon. Og da skal det stå hvor på det andre systemet jeg vil legge filen. Hvis jeg ikke skriver noe her, så kommer det øverst i hjemmemappa. Men jeg kan også spesifisere hvor jeg vil ha det. Så den mappa jeg skal ha til, er... Mappe der nede. Så Return. Og så må jeg skrive passord. Og så overføres filen. Da kan vi gå ned hit og se at... Jo, her har enfil.tkst blitt overført. Så kan man også overføre tilbake. Men det vi kanskje kan se på først, er... Hvis jeg står her, så kan jeg... Nå har jeg overført en fil til Nexus. Men jeg kan også ta... Hvis jeg vet om en fil på Nexus... F.eks. dinfil.tk, så kan jeg kopiere den hit. Og da må jeg kopiere til prikk, som er her jeg står. Og spesifisere et nytt navn på filen. Men da ser vi - da har jeg fått over dinfil.tekstet hit. Så kan jeg gå ned hit. Så kan man også kopiere andre veien. Og så kan jeg f.eks. da kopiere over hele mapper. Minus R er recursive. Så hvis jeg skal kopiere Dir1 til da Group 100... Ett os100.svelab.cs.joa.no. Sånn. Så må jeg også si hvor jeg ønsker å legge den. Nå ønsker jeg å legge den i TMP, som jeg står i der oppe. Sånn. Nå ble den kopiert over uten at jeg skrev passord.", "source": "lecture"}
{"lecture_id": "linux6del10", "chunk_id": "linux6del10_0001", "start": 160.06, "end": 244.12, "token_count": 268, "text": "Så kan jeg gå ned hit. Så kan man også kopiere andre veien. Og så kan jeg f.eks. da kopiere over hele mapper. Minus R er recursive. Så hvis jeg skal kopiere Dir1 til da Group 100... Ett os100.svelab.cs.joa.no. Sånn. Så må jeg også si hvor jeg ønsker å legge den. Nå ønsker jeg å legge den i TMP, som jeg står i der oppe. Sånn. Nå ble den kopiert over uten at jeg skrev passord. Det er det fordi jeg allerede har satt opp SSO-nøkler. Så hvis du har det, så kan man... Automatisk kopier over. Og da ser vi her oppe... Vi ser 3 her, så ser jeg at jeg har fått over... Og 3... Ja, nå har jeg ikke 3 her nede, men vi kan se at Dir 1 inneholder filer og tekster. Så da har vi fått over mappe med undermappe. Så dette er en veldig nyttig kommando for å kopiere filer og mapper. Frem og tilbake mellom Hosts.", "source": "lecture"}
