{"lecture_id": "linux6del1", "chunk_id": "linux6del1_0000", "start": 0.0, "end": 194.6, "token_count": 585, "text": "Få de virtuelle Linux-maskinene, som egentlig er Linux-containere, eller Docker-containere. Så har dere alle rettigheter, dvs. dere har sudo-rettigheter. Og det betyr at dere kan bli RUT. Generelt så kan man bli RUT hvis man har RUT-passordet. Men det er enda vanligere å sette opp brukere som såkalte sudobrukere, som da kan Spesielt fordi da kan man se senere i logger osv. om hvem som, som Ruth, gjorde de forskjellige operasjonene. Og så kan man gjøre Ruth-operasjoner med sudo. F.eks. sudo-app-install, også et program, uten å åpne et Ruth-shell. Men vi kan først se hvordan dere logger inn på... Gruppene på VM-ene. Nå har jeg OS 100. Så hvis dere må først bli med i en OS-gruppe... I mitt tilfelle OS 100, og så... Nei, vi skal være at. Så Gruppe 100 at OS 100. Det er da... OS 100 er hovednavnet. Og så må dere bruke.vel. Det er hele domenenavnet til OS100. Da kan du longe inn sånn, akkurat som på Study SSO. Litt på tilsvarende måte med SSH eller med Putty eller med andre måter. Og så... Her ser jeg jeg kommer rett inn uten å taste passord. Og det er fordi jeg har lagt opp en SSH-key. Det kommer vi til senere. Sånn at dere da senere kan logge rett inn fra Study SSO til Linux-femmene. Men vanligvis må man ha et tastepassord. Og da ser dette ganske ut som på Study SSO. Og her har jeg noen filer som jeg har lagd. Det er hjemmemappe i Home Group 100. Og det at dere har sudorettigheter... Det betyr at hvis dere gjør sudo su, denne kommandoen... Og så skriver passordet. Så ser dere at dere får opp en annen prompt enn hashtag-prompt. Så det betyr at dere er Rut. Nå gjør jeg CD, så kommer jeg hjem til Rut. Hjem til Rut, det er ikke i HomeRut, men det er i SlashRut. Og Ruth hører hjemme. I utgangspunktet så er det ikke så mye som ligger der. Jeg har lagd en historiefeil, men i utgangspunktet så er Ruth-mappen tom.", "source": "lecture"}
{"lecture_id": "linux6del1", "chunk_id": "linux6del1_0001", "start": 155.56, "end": 306.34, "token_count": 468, "text": "Og så skriver passordet. Så ser dere at dere får opp en annen prompt enn hashtag-prompt. Så det betyr at dere er Rut. Nå gjør jeg CD, så kommer jeg hjem til Rut. Hjem til Rut, det er ikke i HomeRut, men det er i SlashRut. Og Ruth hører hjemme. I utgangspunktet så er det ikke så mye som ligger der. Jeg har lagd en historiefeil, men i utgangspunktet så er Ruth-mappen tom. Og når du er Ruth, så har dere da alle muligheter både til å ødelegge alt, men også til å f.eks. installere. Så her kunne man si Apt install, og så... F.eks. Ersping 3, som er en nettverkspakke, bare som et eksempel. Og da installerer man det. Og det vil altså være... Da kan alle brukere også bruke Ersping 3. Så kan man bruke sudo direkte. Det er kanskje å anbefale. Sudo app install... Ja, la oss si 3. Den finnes ikke. Så jeg kan ta sudo app install. Og nå trengte jeg ikke å taste passordet. Det er fordi jeg allerede hadde sudo-passordet. Og da varer det en stund sånn at du ikke må taste det med en gang. Neste gang du logger inn, eller litt senere, så må du taste passordet på nytt. Og da kan man bruke kommandoen 3. Vi kan f.eks. ikke se passordfilen. Jo, passordfilen kan man se. Det går fint, som vanlig bruker. Men man kan ikke se shadowfilen med passordherskene. Da får du permission denied. Men så kan man da alltid, hvis man får permission denied som det, ikke ha lov, så kan man bruke sudo, og så får man plutselig lov. Hva er det som er så spesielt med denne filmen?", "source": "lecture"}
