{"lecture_id": "linux11del12", "chunk_id": "linux11del12_0000", "start": 0.0, "end": 231.0, "token_count": 596, "text": "Ja. Hvis jeg gjør en LS, så ser vi... Jeg får ut en masse tekst her. Og jeg kan f.eks. ta LS av fil.kr. Da får jeg ut en hel fil. Så kan jeg, som jeg har gjort tidligere, så kan jeg si OK, jeg vil at fil skal være lik LS-fil. Jeg kan faktisk gjøre det uten parenteser også. Jeg tror det skal tilsvare helt om jeg gjør det på denne måten. Det gir samme resultatet. Så jeg kan også tilordne en kommando på den måten. Men det som er det store klubbet med Powershaw, er at den variabelen fil som jeg får ut nå... Det ser jo ut som bare en tekstterreng, men i virkeligheten så er dette et helt objekt. Og hvordan kan jeg finne ut at dette er et objekt? Hvordan vet jeg det? Jo, jeg kan ta output fra... Jeg kan ta det objektet. Jeg kan sende en pipe til getmember. Getmember er en kommandelett som viser hvilke objekter... Nei, hvilke metoder og hvilke properties et objekt har. Jeg sender nå dollarfee til getmember, og da får jeg en lang liste av properties og metoder som... Dette objektet, dollar-feel, det har en rekke metoder og properties. Det er et stort og omfattende objekt. Det er ikke bare den lille teksten der som det ville vært i Linux. Og dette er veldig nyttig, for da kan jeg straks se at OK, dollar-feel har en metode, nei, en property name. Da kan jeg se... OK, da... Hva skjer hvis jeg skriver ut... dollarfeet.name? Jo, da får jeg ut akkurat den propertyen. Og f.eks. lengd. Det gir størrelsen på filen. Og dette er veldig nyttig, for da kan man veldig enkelt trekke ut all informasjon som har med denne... Hvis vi ser på andre properties her, så kan du ha last access time. Det er da sist noen aksesserte denne filen. Eller last right time. Det er sist noen skrev til denne filen. En annen fin ting er at man kan begynne med å skrive last, så kan man igjen tabbe. Så kan jeg løpe gjennom de forskjellige propertyene. F.eks. last right time. Men så ser vi at last right time det ser også ut som bare en dato. Men det er ikke bare en dato. Det er faktisk et objekt, det også.", "source": "lecture"}
{"lecture_id": "linux11del12", "chunk_id": "linux11del12_0001", "start": 190.24, "end": 337.22, "token_count": 381, "text": "Det er da sist noen aksesserte denne filen. Eller last right time. Det er sist noen skrev til denne filen. En annen fin ting er at man kan begynne med å skrive last, så kan man igjen tabbe. Så kan jeg løpe gjennom de forskjellige propertyene. F.eks. last right time. Men så ser vi at last right time det ser også ut som bare en dato. Men det er ikke bare en dato. Det er faktisk et objekt, det også. Så alt i PowerCell er i utgangspunktet objekter. Så dette er et datetime-objekt. Og det kan vi igjen få ved å sende... Nei. Sorry. Get number. Det kan også forkortes med game. Hvis jeg sender det til get number, så vil jeg se at dette er en type system datetime. Det kan være nyttig hvis du kan ta en daytime og legge til en time. Eller en uke. Og en rekke andre metoder og properties. Sånn som day, day og week, kind, minute, month osv. Så... Da kan du se igjen på get member. Det var bare et eksempel på at GetMember har et alias som GM. Så kan jeg få ut filen sitt bård, f.eks. Hva da? Dette er da en veldig nyttig konstruksjon. At du kan plukke ut properties, og så er det et objekt igjen. Og så kan du plukke ut properties ved det objektet kommer ut. Og så kan du veldig effektivt plukke ut all den informasjonen du trenger, fra filer.", "source": "lecture"}
