{"lecture_id": "linux1del2", "chunk_id": "linux1del2_0000", "start": 0.0, "end": 186.94, "token_count": 600, "text": "Linux er åpen kildekode. Det vil si, Linux-kjernen er GPL, GNU Public License, og det er en lisens som gjør at ikke bare kildekoden skal være åpen, sånn at alle kan lese den og se hva som foregår inni operativstemkjernen. Det gjør også at man ikke kan ta denne koden, endre den og lage noe nytt, og så selge den som sin. Som lukket, kjørbar kode. Det er ikke lov etter GPL. Det betyr at alle endringer vil da komme Linux til nytte senere. For alle som gjør noen fornuftige endringer, må også publisere de endringene. Og dette har vært grunnlaget for Linus, og har gjort at det har blitt så stort som det er. Som jeg sa, lagde Linus Tordalse i 1991, og det var ikke tilfeldig at det var Det var samtidig med World Wide Web og den enorme spredningen av kode og de enorme mulighetene til å samarbeide om kode, som er essensielt for fri-kildekode-prosjekter. Og det finnes en rekke distribusjoner av Linux i alle størrelser. Det fins masse små, i kameraer og mobiltelefoner ikke minst. Eller har en Linux-kjerne. Og så fins det ruter og switcher og en masse forskjellige devices som bruker Linux. Så fins det store distribusjoner, sånn som Ubuntu, som vi bruker. Og Debian, som er relatert... Eller ligger ganske tett opp til Ubuntu. Så har vi Red Hat, Fedora Cento S, som er stor i USA. og en rekke andre distribusjoner. De har samme operativsystemkjerne, men alt det rundt, system software rundt, og hvordan man installerer, osv., det er det som er de forskjellige distribusjonene. Forskjellig vindussystem kan det være osv. Vindussystemer, GUI, har man også på Linux med pek og klikk. For de som trenger det... Etter hvert som vi blir gode på kommandolinjen, så trenger vi ikke nødvendigvis å bruke GUI. En fordel med kommandolinjen i forhold til GUI er at det er mye lettere å automatisere. Ja... Noen fordeler med Linux, som jeg har nevnt... Det er gratis å ha åpen kildekode. Det er ofte en naturlig del av åpen kildekode-prosjekter. Tradisjonelt så er sikkerheten stor rundt Linux.", "source": "lecture"}
{"lecture_id": "linux1del2", "chunk_id": "linux1del2_0001", "start": 150.0, "end": 358.96, "token_count": 598, "text": "For de som trenger det... Etter hvert som vi blir gode på kommandolinjen, så trenger vi ikke nødvendigvis å bruke GUI. En fordel med kommandolinjen i forhold til GUI er at det er mye lettere å automatisere. Ja... Noen fordeler med Linux, som jeg har nevnt... Det er gratis å ha åpen kildekode. Det er ofte en naturlig del av åpen kildekode-prosjekter. Tradisjonelt så er sikkerheten stor rundt Linux. Og alt det samme gjelder også stabilitet. Linux' operativstema er veldig stabilt. Det krasjer sjelden. Hvorfor du bruker Linux? Som jeg nevnte, er det ikke så mange som bruker det på desktopen. Disse tallene er typisk hentet fra... Når man ser folk som broser, går innom webservere, så kan man se hva slags plattform de kommer fra. Om de kommer fra Mac eller Windows eller mobil eller Linux. Så en av hundre, kanskje, bruker Linux på desktop. Men det er veldig anbefalt å prøve. Det går an å ha duold boot også på laptopen, så installer Linux. Det er absolutt verdt et forsøk på egen laptop. Mens det er på servere som Linux blir veldig mye brukt. Webservere i et røft anslag, kanskje 70 % av webservere, kjører Linux. Så blir det nå veldig mye brukt i cloud, i skyen, i public cloud. 70 % Linux. Til og med Microsoft Acer har en god del Linux. Så blir det veldig mye brukt i smartphones og i nettbrett. Hvor Android har 70 % av markedet. IOS har også et stort marked. Om ikke Linux-basert, så er det Unix-basert. I supercomputere så er det bare Linux. De 500 største supercomputerne, de kjører Linux. Linux og konteinere. Som vi har nevnt tidligere, så kommer vi til å bruke konteinere en god del. Da dere-konteinere. Og de var... Opprinnelig også basert på Linux. I dag er det hovedsakelig basert på Linux, men det fins også Viddos-konteinere. Kanskje kom vi litt inn på det også, men dokkekonteinere skal vi bruke mye. Kybernetis er et system for å orkestrere, eller sette opp og organisere drift av konteinere. Så vi kommer nok ikke...", "source": "lecture"}
{"lecture_id": "linux1del2", "chunk_id": "linux1del2_0002", "start": 317.2, "end": 525.08, "token_count": 600, "text": "Som vi har nevnt tidligere, så kommer vi til å bruke konteinere en god del. Da dere-konteinere. Og de var... Opprinnelig også basert på Linux. I dag er det hovedsakelig basert på Linux, men det fins også Viddos-konteinere. Kanskje kom vi litt inn på det også, men dokkekonteinere skal vi bruke mye. Kybernetis er et system for å orkestrere, eller sette opp og organisere drift av konteinere. Så vi kommer nok ikke... Men det er sånn... Når dere begynner å jobbe i næringslivet, vil dere oppdage at kubernettis er veldig hot. Det blir brukt mer og mer. Og konteinere blir brukt mer og mer. I 2018 ble det annonsert at IBM kjøper Red Hat for 34 mrd. dollar. Selv om Linux er fri software, i utgangspunktet gratis, så er det andre forretningsmodeller som gjør at man kan tjene penger på det. Sjefen for RedApp sa at... Det er også litt av grunnen til at vi jobber med dokker. For gjennom dette kurset ønsker vi at dere skal kunne lære teknologi og teknikker som ligger til bunn for veldig mye av det som... Mye av det som skjer i dataverdenen. Ok. Da skal vi se litt mer spesifikt på Linux og Linux-skjellet. Og ikke minst - hva er et skjell? Et skjell er i utgangspunktet et kommandobasert verktøy som tar imot kommandoer fra tastatur. Du taster inn kommandoer, og så snakker de kommandoene med operativstemt kjern. Det er derfor vi kaller det et skjell eller et skall. Som figuren viser her, så er dette et skall rundt... Linux-hjernen som sitter innerst. Og så utfører vi en rekke kommandoer, sånn som LSMV, CAT osv. Det er små programmer som gjennom skjellet snakker med Linux-tjernen. Og innholdet i disse små programmene vil da til syvende og sist være systemkall til Linux-tjernen. Så kan man spørre seg hvorfor trenger man et skjell? Hvorfor kommandolinjer i det hele tatt? Kunne man ikke... Sånn som man gjør på Windows og på Mac... Hvorfor bruker man ikke et GUI og pek og klikk?", "source": "lecture"}
{"lecture_id": "linux1del2", "chunk_id": "linux1del2_0003", "start": 483.92, "end": 665.96, "token_count": 600, "text": "Og så utfører vi en rekke kommandoer, sånn som LSMV, CAT osv. Det er små programmer som gjennom skjellet snakker med Linux-tjernen. Og innholdet i disse små programmene vil da til syvende og sist være systemkall til Linux-tjernen. Så kan man spørre seg hvorfor trenger man et skjell? Hvorfor kommandolinjer i det hele tatt? Kunne man ikke... Sånn som man gjør på Windows og på Mac... Hvorfor bruker man ikke et GUI og pek og klikk? Jo, det er noen viktige grunner til det. Først og fremst har man mye større frihetsgrad når man bruker et shell og kommandolinje. Så kan man automatisere det man gjør. Men man kan løse kompliserte oppgaver veldig effektivt ved å sette sammen alle disse små skjellkommandoene. Og den teknikken skal dere lære veldig godt, sånn at dere raskt kan sette sammen masse små kommandoer for å få utført nøyaktig det du ønsker. Vi skal også lære skjell som et programmeringsspråk. Vi skriver såkalte Shell-skript, som da kombinerer Linux-kommander, og du ender opp med små systemprogrammer som styrer system. Det som er problemet generelt med lange sekvenser av pek og klikk for å utføre noe, er at det er vanskelig å automatisere. Delvis er det vanskelig å forklare også. Man må kanskje se en hel video om hvordan man peker og klikker. Hvis du skal gjøre noe med kommandoer, så kan du bare skrive ned en kommando. Så er det copy og paste. Du kan vise dette kommandoene. Eller du kan lage et lite script som gjør akkurat det du trenger. Ellers er kommandolinje generelt veldig mye brukt i Linux-automatisering. I skyen og mest sånn som i dokker, kubernetisk, git osv.... Alt dette kan du styre og effektivisere ved hjelp av Linux' kommandolinje. Vi kommer også til å se på Bindofs kommandolinje, spesielt PowerShell, som faktisk ligner ganske mye på Linux' shadescript. En del av kommandoene er akkurat det samme. Og PowerShell er veldig inspirert av Linux-shellet. Nå skal vi prøve å logge inn på noen systemer, og da...", "source": "lecture"}
{"lecture_id": "linux1del2", "chunk_id": "linux1del2_0004", "start": 625.24, "end": 788.0, "token_count": 472, "text": "I skyen og mest sånn som i dokker, kubernetisk, git osv.... Alt dette kan du styre og effektivisere ved hjelp av Linux' kommandolinje. Vi kommer også til å se på Bindofs kommandolinje, spesielt PowerShell, som faktisk ligner ganske mye på Linux' shadescript. En del av kommandoene er akkurat det samme. Og PowerShell er veldig inspirert av Linux-shellet. Nå skal vi prøve å logge inn på noen systemer, og da... ... skal vi først si litt generelt om innlogging. På et Linux-system så har hver bruker har ett entydig brukernavn og et passord. Det er akkurat som på de fleste andre systemer. Det som er mer spesielt for Linux, er at alle brukerne på systemet ligger i en spesiell fil. Og alle de krypterte passordene ligger i Etzer Shadow. Det er standard på en Linux-maskin. For noen av de serverne som vi har her, så er det ikke fullt så enkelt. Da har vi en autentisering som går til en sentral database på OsloMet. Installerer du Linux fra scratch på en laptop, så får du dette opplegget, hvor passordene ligger i password, og de krypterte passordene ligger i shadow-filen. Den shadow-filen kan ikke leses av vanlige brukere, kun av Root. Og Root er administrator eller superuser på Linux. På StudieSSO så får man autentiseringen via Oslomet. Så det passordet er det samme som dere bruker i Canadas og andre steder. Så det passordet settes der, sånn som det gjør med det vanlige passordet. Eller det vil si, på Linux-serverne vi bruker, StudieSSO, så er det samme autentisering. Men etter hvert, når dere skal få egne, Da vil dere se at dere kan sette passordet selv og styre deg på egen hånd.", "source": "lecture"}
