{"lecture_id": "linux6del4", "chunk_id": "linux6del4_0000", "start": 0.0, "end": 189.32, "token_count": 592, "text": "Rettighetsprinsippene på et Linux-system er relativt enkle. En vanlig bruker har stort sett bare lov til å gjøre endringer på sitt eget hjemmeområde. Så her, inne på homegroup100, her kan brukeren gjøre omtrent som han eller hun vil. Fjerne filer, lage filer, mapper osv. Men med en gang en vanlig bruker prøver å gå... Ned på ROOT-filsystemet og f.eks. fjerne Etcete Password. Så får man permission denied. ROOT derimot... Administratorbrukeren, den har alle rettigheter. Og kan fjerne alt som er av mapper og filer for alle brukere. Legge til grupper, endre på grupperettigheter, endre på filerettigheter. Nei... Egentlig absolutt alle mulige rettigheter. Så derfor er det ikke... Man bør helst unngå å jobbe for mye i et rutskjell. Man kan få et rutskjell ved å gjøre sudoveisu. Skal vi se... Nå må jeg ta riktig passord. Sånn. Der er jeg i RUT. Og jeg kan da gjøre også alt mulig galt. Så problemet med å jobbe i et rutskjell på denne måten er at det er fortere å glemme at man har allmektig power. Man kan gjøre hva som helst, og da kan man fort også en feil slette ting. Så det beste er å jobbe som vanlig bruker, og så gjøre kommandoer med sudo, sånn som aduser. Men passordet huskes, så det er ikke så vanskelig og så mye ekstra jobb å taste ned passordet noen ganger ved å være sudobruker. Fordelene er at når man gjør vanlige ting, risikerer man ikke å ødelegge systemet. Og i tillegg, hvis det er et system som mange bruker, så kan man da se... Hvilken brukers som gjorde sudo, sånn at man kan se hvem som har gjort hva i ettertid, ut ifra loggfiler. Men det kan legges til at tidligere så var det et veldig strengt skille mellom ruteuser og vanlige brukere. For da opererte man gjerne med servere som sto og gikk i årevis, og som ble drift. Og som hadde den rette tilstanden, og som da aldri skulle endres. Etter hvert som man har begynt med virtuelle maskiner,", "source": "lecture"}
{"lecture_id": "linux6del4", "chunk_id": "linux6del4_0001", "start": 150.0, "end": 214.22, "token_count": 242, "text": "Hvilken brukers som gjorde sudo, sånn at man kan se hvem som har gjort hva i ettertid, ut ifra loggfiler. Men det kan legges til at tidligere så var det et veldig strengt skille mellom ruteuser og vanlige brukere. For da opererte man gjerne med servere som sto og gikk i årevis, og som ble drift. Og som hadde den rette tilstanden, og som da aldri skulle endres. Etter hvert som man har begynt med virtuelle maskiner, som kan bygges med nytt hvis noe går galt, og i enda større grad dokkecontainere, som veldig raskt kan bygges på nytt, så er det ikke så kritisk om man er root user og ødelegger systemet. For da er filosofien mer at jo, hvis noe går galt, så kan man bygge et helt nytt system. Og dermed er det ikke så kritisk. Om man sommer ut gjør en feil.", "source": "lecture"}
