{"lecture_id": "linux3del5", "chunk_id": "linux3del5_0000", "start": 0.0, "end": 198.62, "token_count": 598, "text": "Apostrofer blir mye brukt i Linux-skjell og i Linux-skript. Så vi skal nå se på apostrofer gjennom et eksempel. Så hvis jeg starter med å definere en lokal variabel... Så kan vi se på hva får man hvis jeg bruker enkle apostrofer? De som bare står retta opp. Og tar Ekko LSD-er på den måten... Så ser vi at da får jeg nøyaktig det som jeg skriver. Den type enkle apostrofer gir rett og slett bare den tekststrengen. Da er det ingen tolkning av dollar-dir som en variabel. Derimot, hvis jeg bruker doble apostrofer... Så ser vi at da tolkes innholdet i dollar-dir. Og vi får ut LS-mappe. Verdien av dir byttes ut med mappe, og så skrives det ut. Så er det en tredje type apostrofer. Det er den som står litt sånn tilbakelent. Hvis jeg nå prøver å gjøre akkurat den samme kommandoen med denne... Så vil vi se, da... Det som skjer da, er at da utføres denne kommandoen. Så når vi har små apostrofer som heller litt bakover, så utføres kommandoen. Og da får vi til innholdet, for det er det samme vi får hvis vi utfører LS-mappe. Det kan være litt vanskelig å se forskjell på spesielt de to typer... Spesielt i script så kan det være veldig vanskelig. Vi skal se på en annen måte som vi kan bruke dette på. En sånn liten huskeregel kan være... Den apostrofen som heller bakover, den minner litt om en backslash. Det er det man bruker i Windows, og da vet man som regel ikke hva man får. Det ligner litt mer på en slash, som man bruker i Linux. I Linux bruker man slash den veien. Når man snakker om mapper og patermappe. I Windows bruker man backslash. Så i hvert fall... Denne apostrofen gir nøyaktig det du får ut. Mens denne apostrofen... Der utfører man kommandoen inni apostrofer. Fordi det kan være litt kryptisk å se dette her, og også av litt andre grunner, så fins det én måte som er litt bedre til å gjøre akkurat det samme. Så i stedet for... I stedet for å utføre en kommando sånn som dette her...", "source": "lecture"}
{"lecture_id": "linux3del5", "chunk_id": "linux3del5_0001", "start": 160.6, "end": 394.32, "token_count": 598, "text": "I Windows bruker man backslash. Så i hvert fall... Denne apostrofen gir nøyaktig det du får ut. Mens denne apostrofen... Der utfører man kommandoen inni apostrofer. Fordi det kan være litt kryptisk å se dette her, og også av litt andre grunner, så fins det én måte som er litt bedre til å gjøre akkurat det samme. Så i stedet for... I stedet for å utføre en kommando sånn som dette her... Så kan man sette hele kommandoen inn i karanteser. Også med en dollar foran. Akkurat som det er en variabel. Og dette er en litt mer stødig syntaks. Det er litt lettere å se hva man gjør. Og så vil det i noen tilfeller også gi forskjell. Og da vil denne metoden virke. Jeg kan vise et eksempel på det. Et eksempel er hvis man gjør noe sånt som dette her... La oss si jeg ønsker å... Inni en variable line... Så ønsker jeg å utføre en kommando. Og den kommandoen jeg ønsker å utføre, det er grep. Så ønsker jeg inni her å utføre who am I. Who am I gir meg brukernavnet. Her får jeg en feilmelding. Permission denied - det fungerer ikke som det skal. Anbefalte metoden for å legge inn variabler, nemlig en dollar foran og så parentes, og så med sluttparentes her borte. Så går det fint. Da utføres grep Haugerud-etter-passord, og så legges den verdien inn i variabelen. Så den fungerer. Men du vil ofte kunne se i skript at du ser denne konstruksjonen. Det er greit å vite hvordan man gjør det, men generelt vil jeg anbefale å bruke denne metoden når du da enten skal legge en kommando inn i en streng, eller som her legge verdien av en kommando inn i en variabel. Så vi kan se litt mer på det siste. F.eks. hvis du ønsker å legge verdien av P... Lag en sånn kommando, og så kan du skrive hvilken som helst kommando inni der. Og da vil mappe etterpå inneholde resultatet av p-dobbelen til deg. Et annet eksempel er sånn som... Ja, vi kan bruke denne. Sekseku, det er en kommando som lager en sekvens av tall.", "source": "lecture"}
{"lecture_id": "linux3del5", "chunk_id": "linux3del5_0002", "start": 345.44, "end": 484.4, "token_count": 339, "text": "Så vi kan se litt mer på det siste. F.eks. hvis du ønsker å legge verdien av P... Lag en sånn kommando, og så kan du skrive hvilken som helst kommando inni der. Og da vil mappe etterpå inneholde resultatet av p-dobbelen til deg. Et annet eksempel er sånn som... Ja, vi kan bruke denne. Sekseku, det er en kommando som lager en sekvens av tall. Så hvis en tar sek1-5, sånn som det... Og så skriver du ut verdien. Så ser vi at de har fått en sekvens av tall fra 1 til 5. Det er å bruke sånne krøllparenteser... Fra én til fire... Dette funker ikke helt. Men hvis man legger på en ekko foran her, så får man satt den sekvensen. Begge disse her kan da brukes i forløkker. Man kan lage en forløkker for i... Finn... 1-4. Du... Skal vi se om den virker... Skriv ut valeri nå, og da ser vi at den funker fint. Så det er én måte å lage en forløker på. En annen måte å gjøre det samme på, er å bruke den sekk-kommandoen. Strekk én, ti, fire. Det... Da skjer det samme.", "source": "lecture"}
