{"lecture_id": "linux1del5", "chunk_id": "linux1del5_0000", "start": 0.0, "end": 227.9, "token_count": 583, "text": "Filer er et sentralt Linux-begrep. Alt i Linux er filer, og alle data som strømmes mellom kommandoer, de kan også legges inn i filer. Så det er veldig viktig i Linux å ha oversikt over Linux-filsystemet. Og her ser vi et bilde av et Linux-filsystem. Øverst har vi det som kalles ROT-katalogen, og alle mapper, eller directories, de ligger da under denne ROT-katalogen. Og her ser vi en del sånne typiske mapper, som bind var user, bind, her ligger det kjørbare programmer, var ligger blant analog-filer... USR, det er sånn... En del lokale filer og man pages og... Jussebind ligger nok de aller fleste bindene her. Temperaturfiler, boot, og så er det Sandra Home for hjemmekataloger, hjemmemapper. Det som vi skal se på noen år fremover, er spesielt filene med passive shadow. Så de ligger her. Så f.eks. hvis vi går ned i filteret til dobbelte, dobbelte, dobbelte her, så kan man referere til denne mappen her som slash... Og da er det den rotekatalogen. Slash home, slash per - den rurkeren. Og så ned slash vever. V, v, v... Så dette er da et typisk Linux-filter. Og det vi skal se på nå i starten, er hvordan manøvrerer man seg rundt i et slikt filter? Og her ser vi meg en liste over noen av de viktigste kommandoene man bruker for å manøvrere seg rundt i filteret. Så det vi skal... Gjøre videre er å bruke de kommandene. Det er også oppgaver som går på det. Så alle de beste måtene å lære seg etterpå, er egentlig bare å prøve og feile. Og om og om igjen å bli vant til å orientere seg i linjeskriteret og bevege seg ut. Pade over til det. Det er en kommando så enkel som Print working directory. Men her ser vi at vi ikke har noen slash først. Og det betyr at da beveger jeg meg i forhold til der jeg står. Så hvis det ikke er noen mappe som heter Home i den mappen jeg står i, så vil jeg ikke komme dit. Så alltid når man går inn der selv, så er man i en eller annen mappe.", "source": "lecture"}
{"lecture_id": "linux1del5", "chunk_id": "linux1del5_0001", "start": 168.1, "end": 306.98, "token_count": 417, "text": "og bevege seg ut. Pade over til det. Det er en kommando så enkel som Print working directory. Men her ser vi at vi ikke har noen slash først. Og det betyr at da beveger jeg meg i forhold til der jeg står. Så hvis det ikke er noen mappe som heter Home i den mappen jeg står i, så vil jeg ikke komme dit. Så alltid når man går inn der selv, så er man i en eller annen mappe. Det vanlige når du logger inn, er at du kommer til din hjemmemappe, som typisk er -home og så et brukernavn. Men det kan være annerledes. På Studies ESO så er det litt annerledes. Så vil du se hva hjemmemappen din heter. Så kan man alltid bruke Absolute Path når man flytter seg. Så jeg kan alltid skrives cd.slash.etc. Da vil jeg alltid komme dit, uansett hvor jeg står. Hvis jeg ikke har en slash foran, da beveger jeg meg relativt til der jeg står. Så et annet eksempel er cd.prikk-prikk. Det betyr flytt en katalog opp. En katalog opp nærmere roten av fyllesystemet. Så kan man sette sammen det... Da flytter man seg - to kataloger opp. Så bare skriv.cd, så kommer du faktisk bare hjem til hjemmekatalogen. LS viser filer i den mappen du ligger i. LSMSL legger på ekstra info om disse filene. Så generelt har man en masse små Linux-kommandoer sånn som dette her. Så kan man legge på opsjoner. som... Som gjør at kommandoen virker på andre måter enn default uten opsjoner.", "source": "lecture"}
