{"lecture_id": "linux3del6", "chunk_id": "linux3del6_0000", "start": 0.0, "end": 220.6, "token_count": 591, "text": "Omdirigering er et viktig tema. Det står til og med i notatene at dette er viktig. Så dette er det veldig nyttig å få med seg. Veldig mye av det som man jobber med i Linux, er å dirigere datastrømmer til og fra filer og også til og fra kommandoer. Og akkurat dette gjør at man kan sette sammen mange små kommandoer. Løse oppgaver effektivt og ikke minst fleksibelt. Masse kombinasjonsmuligheter. Det som er utgangspunktet, er at alle Linux-programmer og kommandoer har tre åpne kanaler. Null, én og to. Den første er StandardInn. SDDin. Det er på en måte en input-kanal. Default som kommer fra tastaturet. Så kommer det inn til en Linux-kommando. Jeg illustrerte dette som en kanal som kommer inn i kommandoen. F.eks. hvis vi tar Econotext, altså piper til Cat, så kommer den teksten inn til Linux-kommandoen Cat. Så har man to ut-kanaler. Den ene er standard out, den vanlige output-en. Den går vanligvis til skjermen hvis man ikke omdirigerer den. Så har du kanal to. Den er litt spesiell. Det standard er er standard error. Det er en egen feilmeldingskanal. Vi skal nå se på hvordan vi kan omdirigere på disse her. Man tar standard-ot fra én kommando og sender til standard inn i en annen kommando eller til en fil. Det gjør man da ved en pipe eller med andre... Det er andre tegn som omdirigerer til andre steder. F.eks. en større enn pil som omdirigerer til en fil. Da skal vi se hvordan det ser ut i praksis. Vi har allerede gjort dette en del... For eksempel... En type ting man gjør, er å... Hvis jeg tar 'eats a password', så kommer det masse tekst ut. Så det jeg kan gjøre, er å pipe det til en annen kommando, nemlig'more'. Det var fordi jeg typet den til målet. Hvis vi da går tilbake på sliden og ser, så vil vi se her at... Det som egentlig skjer da, er at jeg omdirigerer. Vi ser her nede et annet eksempel. PSAUX blir omdirigert standardat fra PCAUX ved hjelp av en sånn pipe, så sendes den til More.", "source": "lecture"}
{"lecture_id": "linux3del6", "chunk_id": "linux3del6_0001", "start": 163.52, "end": 261.92, "token_count": 263, "text": "Hvis jeg tar 'eats a password', så kommer det masse tekst ut. Så det jeg kan gjøre, er å pipe det til en annen kommando, nemlig'more'. Det var fordi jeg typet den til målet. Hvis vi da går tilbake på sliden og ser, så vil vi se her at... Det som egentlig skjer da, er at jeg omdirigerer. Vi ser her nede et annet eksempel. PSAUX blir omdirigert standardat fra PCAUX ved hjelp av en sånn pipe, så sendes den til More. Tilsvarende kan man sende et passord til CAT, som så kan sendes til SVART. Det er på denne måten man lager store konstruksjoner av kommandor, som gjør at akkurat et... Så tok jeg første etiske passord, men kan også psox. Outputen sendes nå til standard. Og så sender jeg det til More i stedet for å sende det til Default, som er rett ut på skjermen. Hvis jeg sender det rett ut på skjermen, så går alt rett ut.", "source": "lecture"}
