{"lecture_id": "linux3del11", "chunk_id": "linux3del11_0000", "start": 0.0, "end": 190.2, "token_count": 596, "text": "Vi skal nå se på et eksempel hvor vi bruker Source til å kjøre et skript. Og da fungerer det litt annerledes enn hva som er default når man kjører skript. Først skal jeg lage et lite skript. En måte å gjøre det på, er å catte rett til skriptet. La oss si jeg kaller det skriptet change, for det skal skifte... Jeg skal skifte mappe. Så jeg kan skrive skriftet sånn. Det jeg skal gjøre, er å gå til user bind. Så skal jeg skrive et p-dor til det. Når man skriver et skrift på denne måten her, så kan man taste kontroll-d. Da skrives alt til filen. Sånn. Da har jeg et lite skritt. Så kan jeg endre filmodus på det også. Sånn at det kan kjøres. Ja... Nei, nå kjører Change. Så vil man jo skifte sted man står, til Usebin. Men hvis jeg tar Peder over til det, så ser vi at nei, det er ikke tilfellet. Det er tilsvarende som vi har sett på i oppgaver tidligere. Det som egentlig skjer når man kjører et script sånn som det her, er at det startes opp et nytt skjell, og inni det skjellet så skifter man posisjon. Og så tar man Peder over til det, og da får man ut denne utskriften. Men etter det er ferdig, så skjer det en exit. Man avslutter skjellet og går ut av det. Og alt som er gjort inni det skjellet, er da glemt. Det kan minne litt om hva som skjer hvis man kjører skritter sånn. Da ser man at eksplosivt så starter da bindbæsj. Man kan gjøre veldig eksplosivt sånn. Et nytt skjell som kjører det som står inn i change. Og det som står inn i change, er dette her. CDUCB. Pad over til det, da kommer den ut. Hvis jeg nå gjør PAD over til det, så er jeg fortsatt der jeg var. Og da finnes det en egen kommando, source, som gjør dette på en annen måte. Så hvis jeg bruker kommandoen source til å kjøre change, Det betyr ta alle kommandoene i Script to Change og kjør de rett ut i skjellet her, direkte.", "source": "lecture"}
{"lecture_id": "linux3del11", "chunk_id": "linux3del11_0001", "start": 150.0, "end": 241.24, "token_count": 280, "text": "Et nytt skjell som kjører det som står inn i change. Og det som står inn i change, er dette her. CDUCB. Pad over til det, da kommer den ut. Hvis jeg nå gjør PAD over til det, så er jeg fortsatt der jeg var. Og da finnes det en egen kommando, source, som gjør dette på en annen måte. Så hvis jeg bruker kommandoen source til å kjøre change, Det betyr ta alle kommandoene i Script to Change og kjør de rett ut i skjellet her, direkte. Det blir sånn. Og da ser vi. Da skifter jeg også posisjonen her i dette skjellet. Så det å gjøre Sort Change, det er omtrent det samme som å bare ta copy og paste av alle linjene. Og da ser vi... Da endres mappen, sånn at jeg kommer dit jeg skal. En helt lik måte å gjøre dette på er å sette en prikk foran. Det er den korte versjonen. Hvis jeg tar prikk-change, så skjer det samme. Det betyr også bare 'paste alle kommandoene ut i dette skjellet'. Takk.", "source": "lecture"}
