{"lecture_id": "linux9del5", "chunk_id": "linux9del5_0000", "start": 0.0, "end": 223.52, "token_count": 590, "text": "Da er jeg i ferd med å lage et skript som automatiserer oppgaven med å kompilere kode og teste ut hvor lang tid det tar i en docker container. Det jeg nå gjorde, var å... Teste ut koden her i Linux-VM. Men jeg vil få en del feil her. Jeg tror ikke jeg vil ha plass engang hvis jeg prøvde å installere det i tillegg til containerne. Det samme gjelder piten. Så forhåpentligvis så funker det. Men dette kan vi nå sjekke. Så vi lagrer den zoom.shell. Og så må vi da endre på dokkefeil. At den sum.shell legges inn i... I dokker-imaget. Da kan vi prøve oss å se på hvordan vi gjorde det forrige gang. Jeg hadde en dokk feil der. Og da ser vi... Dette her... Det skulle... Hvis jeg tar en copy litt tilsvarende den... Så burde dokkefeilen min også gjøre det. Det er ofte lurt å ta utgangspunkt i det man hadde tidligere. Så nå har jeg på filen... Eller ved siden av... Dokkefilen. Så har jeg en fil som heter summe.shell. Og så vil jeg at den skal kopieres inn i... slash... sum. For når jeg gjør giktplanen her oppe, så lages en mappe som heter... ... sum øverst i filsystemet på dockercontaineren. Sånn. Så da har jeg en ny dockerfile. Så kan jeg save den. Og så må jeg gå ut av dockercontaineren, for nå skal jeg stoppe den og lage en ny. Og så kan jeg ta en dokker, container... Den stopper generelt alle konteinerne. Så kan jeg bygge på nytt. Sist tok dette åtte minutter, men nå ser vi. Nå tar det to sekunder. For nå er det bare den copperbiten der som jeg gjør på nytt. Alt det andre, det ligger i cash, og leses da fra cash, sånn at man slipper å komplere alt på nytt. Og da kan jeg... Da kan jeg kjøre dere containerøyne igjen, minus IT akkurat samme måte som sist. Så kan vi se om dette har fungert. Da går jeg inn i sum, og så ser jeg... Ja, nå har jeg fått inn... Men jeg ser... Jeg burde gjøre en endring. Jeg burde også sette rettigheter på denne her. Sånn at...", "source": "lecture"}
{"lecture_id": "linux9del5", "chunk_id": "linux9del5_0001", "start": 180.0, "end": 422.08, "token_count": 597, "text": "Alt det andre, det ligger i cash, og leses da fra cash, sånn at man slipper å komplere alt på nytt. Og da kan jeg... Da kan jeg kjøre dere containerøyne igjen, minus IT akkurat samme måte som sist. Så kan vi se om dette har fungert. Da går jeg inn i sum, og så ser jeg... Ja, nå har jeg fått inn... Men jeg ser... Jeg burde gjøre en endring. Jeg burde også sette rettigheter på denne her. Sånn at... Med seomod. Da kan jeg kjøre en kommando. La oss si 7.55 på Sum... Sum.shell. Dette er da for å kunne automatisere i enda større grad. Så gjør jeg det interaktivt også. Så kan jeg prøve å kjøre, da. Da ser vi Shellscripte kjører, men som sagt... Det er ikke sikkert Shellscripte er riktig selv om det kjører. Men vi ser... Ja, vi får noen feil her. Ja, what could man not find? Oi, det var mye fælt. Men noen av dem kjører. Skal vi se. Det var kanskje sånn jeg burde gjort opprinnelig. Utvikle denne... dette her. Den kjører, men... Ja, jeg har startet Java med stor J. Det fungerer ikke. Så... Da kan jeg rette opp den. Der skal det være liten J. I tillegg så var det kanskje... Kanskje Python... Command not fun... Det var... Ja, jeg har kanskje ikke installert Python. Jo. Jeg har installert Python 3. Ja, hvordan kommer jeg ut der? Jeg vet ikke hvordan jeg kommer ut av Python. Men da var det å kjøre kontroll P, kontroll Q. Da kom jeg ut av skjellet. Så kan jeg rette opp. Jeg installerte vel Python 3, sånn at da kjører jeg Python 3 i stedet. Skal vi se her. Ja, der står det Python 3. Men nå så ser vi... Nå kan vi raskt stoppe konteinerne igjen. Og så kan jeg raskt starte den på nytt. Og der er jeg allerede inni konteineren. Så vi ser at hvis man bare gjør små endringer på dockerfile helt mot slutten her, så er det veldig raskt å gå inn og ut og få det til å virke som man skal. Da trenger man ikke åtte minutters kopulering. Det ser ut som den...", "source": "lecture"}
{"lecture_id": "linux9del5", "chunk_id": "linux9del5_0002", "start": 377.8, "end": 681.64, "token_count": 597, "text": "Skal vi se her. Ja, der står det Python 3. Men nå så ser vi... Nå kan vi raskt stoppe konteinerne igjen. Og så kan jeg raskt starte den på nytt. Og der er jeg allerede inni konteineren. Så vi ser at hvis man bare gjør små endringer på dockerfile helt mot slutten her, så er det veldig raskt å gå inn og ut og få det til å virke som man skal. Da trenger man ikke åtte minutters kopulering. Det ser ut som den... I hvert fall ikke den CMOD-kommandoen fungerte. Men vi kan se om selve skriftet fungerer nå. Litt lengre tid der. Det var merkelig. Det ser ikke ut som jeg fikk... Lagt inn endringene. Ja, det er vel et generelt problem. Skal vi se. Da må jeg se. Gjorde jeg endringer her? Jo. Dette er nytt. Og jeg har Python 3. Men det ser ikke ut som dette hadde en effekt. Da prøver jeg å gå ut igjen. Så prøver jeg å stoppe. Skal vi se hva jeg gjør her, egentlig? Ja, for det som kunne være, er at jeg ikke brukte cash. Eller at jeg brukte cash. Den kopieringen her, den ser ut til å bli gjort på nytt. Så da prøver jeg å gå inn igjen. Da er jeg inne i konteineren. Men iallfall nå ser vi at... Nå har Seomod blitt utført. For den kommandoen har tydeligvis blitt utført her. Hvis jeg nå ser på zoom.chell, så ser vi at Java står med liten bokstav og Python 3. Så dermed skulle jeg kunne kjøre zoom.chell her inne. Ja. Vi ser på denne måten, så kan man da utvikle en dokkefeil. Og raskt gjøre endringer og kjøre den på nytt, starte og stoppe konteineren. Neste stepp, i hvert fall i ukens utfordring, blir å gjøre dette her helt automatisk. Og da endre dokkefeilen, legge til det som vi hadde i forrige uke. Med å sette opp en webserver. Og så utvikle dette programmet som regner ut tidene. Og så til slutt kjøre det programmet sånn at output kommer til indeks.8ml i webserveren. Så da kan man bare sette i gang en container.", "source": "lecture"}
{"lecture_id": "linux9del5", "chunk_id": "linux9del5_0003", "start": 639.16, "end": 774.0, "token_count": 422, "text": "Og raskt gjøre endringer og kjøre den på nytt, starte og stoppe konteineren. Neste stepp, i hvert fall i ukens utfordring, blir å gjøre dette her helt automatisk. Og da endre dokkefeilen, legge til det som vi hadde i forrige uke. Med å sette opp en webserver. Og så utvikle dette programmet som regner ut tidene. Og så til slutt kjøre det programmet sånn at output kommer til indeks.8ml i webserveren. Så da kan man bare sette i gang en container. Og så etter ti minutter har man da ferdig resultater. Uten at man løfter en finger. Så kan man enkelt teste ut hvordan dette fungerer i Ubuntu 1604 eller i RedHat. Men hvis du begynner med RedHat, så vil det straks være... Man måtte gjøre noen forskjeller. For da har RedHat ikke effektivitet. Men iallfall Debian og andre Ubuntu-varianter kan man med samme script teste ut. Uten å gjøre noe særlig arbeid selv. Eller manuelt arbeid. Men av resultatene så ser vi at det er litt forskjell, fordi f.eks. Python bruker dobbelt så lang... Eller de fleste bruker lengre tid. Men bortsett fra Shell-skriptet. Så i Dockery-konteineren så kommer Shell-skriptet litt bedre ut. Antall ganger i skriptene, sånn at alle gir 5,5 sekunder. Så typisk her, bare halverer du antall sepp, og så får du alle til å ta like lang tid. Og da får man et tall på hvor mye raskere de forskjellige programmene er enn selvskripte.", "source": "lecture"}
