{"lecture_id": "linux1del7", "chunk_id": "linux1del7_0000", "start": 0.0, "end": 166.58, "token_count": 582, "text": "Nå skal vi se på hvordan vi lager Shellscript. Å lage Shellscript er veldig enkelt. Det er bare å åpne en editor og skrive inn tekst linje for linje med kommandoer. Og så save den og kjøre den. Så vi skal se helt konkret på hvordan vi gjør det. For det første så trenger vi en editor. Eller jeg kan først si - jeg er jo nå i en mappe mappe, og den mappen er tom. Så ser vi at det ikke ligger noen ting der. Så dermed må jeg lage et skript fra scratch. Jeg kan bruke en enkel editor som heter Nano, som kanskje er den enkleste å starte med. I mange av eksemplene bruker jeg gjedd. Vi kan se på det etterpå. Men jeg starter med Nano, og så kaller jeg skriptet mitt... Det kan hete hva som helst. Og så tar jeg på extension.sh, Så åpner jeg editoren, og da er det bare å starte å skrive her. Det er standard å bruke noen besvergelser i starten av et versskript. Og det dette her betyr, det er herstein utropstein. Det betyr at dette skriptet skal tolkes av... Dette er da selve skjellet. Det er et binært program som ligger i mappen bind. Og dette programmet heter bæsj. Og det er da det programmet som tolker alle kommandoene som kommer nedover her. Så her kan jeg begynne å skrive skjellkommandoer som pd2d, ls kanskje, ls-l osv. Og dermed har jeg allerede et skript. Så det jeg trenger å gjøre nå, er å save det og gå ut. Så det kan jeg gjøre ved å bruke noen av de kommandoene som er her nede. Kontroll O... Den hakken der betyr kontroll. Hvis jeg tasser nå kontroll O, så skriver jeg, lagrer... dette skriptet. Fine line to write, script and chell, det er greit. Nå har jeg savet skriptet. Hvis jeg er ferdig og har lyst til å gå ut og kjøre det, taster jeg Ctrl-X, som er Exit. Og dermed er jeg ute. Da kan jeg aller først liste opp og så se... Ja, nå har jeg lagd dette skriptet. Jeg kan se på innholdet i skriptet med CAT.", "source": "lecture"}
{"lecture_id": "linux1del7", "chunk_id": "linux1del7_0001", "start": 135.68, "end": 296.52, "token_count": 595, "text": "Hvis jeg tasser nå kontroll O, så skriver jeg, lagrer... dette skriptet. Fine line to write, script and chell, det er greit. Nå har jeg savet skriptet. Hvis jeg er ferdig og har lyst til å gå ut og kjøre det, taster jeg Ctrl-X, som er Exit. Og dermed er jeg ute. Da kan jeg aller først liste opp og så se... Ja, nå har jeg lagd dette skriptet. Jeg kan se på innholdet i skriptet med CAT. Det ser sånn ut. Det ser bra ut. Og så kan jeg prøve å kjøre det. Det jeg typisk prøver på da, det er å bare skrive navnet. Men da ser vi... Nei. Da får jeg en command not found. Og det er av sikkerhetshensyn. Man må spesifisere hvor skriptet som jeg skal kjøre, ligger. Det går an å sette opp systemet sånn at man kan kjøre skripts fra hvor som helst. Da ville det bare ha startet. Men her må jeg eksplisitt si hvor dette skriptet ligger. Og da kan jeg skrive full path til mappen det ligger i. Så jeg kunne kjørt det ved å skrive hele denne... Hele denne strengen her, og så script.shell. Da sier man hvor det ligger. Men noe som er enklere, er å si... Prikk, det er den mappen jeg står i. Så jeg kan si at det skriptet jeg skal kjøre, det ligger i prikk-slæsj. Her ligger dette skriftet. Og så kan jeg kjøre det. Men da ser vi... Jeg får på Mission United, og det er fordi Vi skal se på dette i detalj senere, men... Rettighetene er de som står her. Rw dash. Eller rw-strek. Dette er rettighetene for programmet. Og det betyr read and write. Men så burde det stått en x der. For den x-en må man ha for å kunne kjøre det. Og det kan vi få til ved å bruke en annen kommando. Vi skal se mer på dette seinere, men den kommanden heter comod. Change-modus. Og så bruker jeg en kode for å endre den. Jeg bruker 700. Vi skal se hva det betyr også. Og så navnet på skriptet. Jeg skriver comod 700 skrift.dachel. Hvis jeg nå lister, så vil jeg se at nå står det rwx.", "source": "lecture"}
{"lecture_id": "linux1del7", "chunk_id": "linux1del7_0002", "start": 261.78, "end": 425.24, "token_count": 593, "text": "Men så burde det stått en x der. For den x-en må man ha for å kunne kjøre det. Og det kan vi få til ved å bruke en annen kommando. Vi skal se mer på dette seinere, men den kommanden heter comod. Change-modus. Og så bruker jeg en kode for å endre den. Jeg bruker 700. Vi skal se hva det betyr også. Og så navnet på skriptet. Jeg skriver comod 700 skrift.dachel. Hvis jeg nå lister, så vil jeg se at nå står det rwx. Og det betyr at jeg som bruker, har rettighet til... Til å lese, skrive og kjøre dette skriptet. Så nå kan jeg på nytt prøve å kjøre det. Nå kan jeg altså taste tab. Det jeg gjorde nå, var at jeg skrev.slash essay, og så tastet jeg tab. Og da ser du at skjellet fullfører den kommandoen, så lenge den er entydig. Og dermed kan jeg taste return og kjøre skriptet. Det som skjedde nå, var at scriptet kjørte, og det utførte kommandoene én for én. Først pwd, som ga denne linjen her, så ls, som ga linjen med script og skjell, og så ls minus l, som ga hele denne utscripten. Og dermed har vi laget og kjørt et script, og den prosessen er egentlig så enkel. Det eneste man må passe på, er at scriptet må være Og rettigheter til å kjøre for at man skal få kjørt det. Jeg nevnte at jeg ofte bruker Jed, og det er også en veldig enkel editor. Men den er litt mer kryptisk på den måten at kommandoene står ikke som om man lærer seg noen få kommandoer for å lagre, blant annet. Så jeg kan vise kjapt hvordan den virker også. Jed... JDD... Da ser det ganske likt ut som ellers. Kan skrive inn nye kommandoer her. Det jeg trenger å vite da, er hvordan saver jeg, og hvordan går jeg ut. Save er en tastekombinasjon kontroll-x-s. Nå taster jeg kontroll-x og så s, og da saver man den. Kontroll-x og C, da går man ut. Fortsatt er det de to mannene trenger. Så er jeg ute, og så kan jeg kjøre det på nytt.", "source": "lecture"}
{"lecture_id": "linux1del7", "chunk_id": "linux1del7_0003", "start": 390.0, "end": 442.16, "token_count": 168, "text": "Da ser det ganske likt ut som ellers. Kan skrive inn nye kommandoer her. Det jeg trenger å vite da, er hvordan saver jeg, og hvordan går jeg ut. Save er en tastekombinasjon kontroll-x-s. Nå taster jeg kontroll-x og så s, og da saver man den. Kontroll-x og C, da går man ut. Fortsatt er det de to mannene trenger. Så er jeg ute, og så kan jeg kjøre det på nytt. Og da ser vi skriptet kjørte som før. Eneste tillegget var at jeg fikk denne linjen her, som viser output fra uname minus a. Uname ber meg si hva slags OS jeg kjører.", "source": "lecture"}
