{"lecture_id": "linux2del2", "chunk_id": "linux2del2_0000", "start": 0.0, "end": 166.84, "token_count": 579, "text": "Når man jobber med et Linux-skjell, så kan det ofte ta litt lang tid å fullføre kommandoene, spesielt hvis det er lange kommander og lange pilnavn osv. Og da fins det noen smarte triks som er veldig nyttige å lære seg. Én ting er hvis man har gjort en kommando tidligere, og så ønsker man å gjøre den på nytt.  Og så vet man at en eller annen gang tidligere har man gjort det. Den sakte måten er å skrive history. History sånn som det er. Og den gir da alle kommandoer du har hatt tidligere. Men da kan man jo bla seg tilbake i den. Men det tar mye tid. Eventuelt så kan man gjøre history, og så pipe den til more. Og så bla seg gjennom alle for å finne den kommandoen man ønsker. Men da er det et fint tips, og det er å bruke kontroll-r for å lete seg rekkerskift bakover i kommandoene. Så hvis jeg nå taster kontroll-r her... Og så husker jeg kanskje at jeg hadde en for-kommando en gang, som jeg gjorde. Så taster jeg inn for, eller begynner å taste inn for, men da kommer det forslaget opp. Så kan jeg taste kontroll her en gang til og bla meg bakover i tidligere kommandoer. Når jeg har funnet en riktig, så kan jeg taste return med en gang og gjøre kommandoen, eller så kan jeg gå inn og editere den, kanskje endre den til seks, og så taste return og utføre den kommandoen som jeg har gjort tidligere. Så det er en veldig nyttig måte for å lete seg tilbake i tidligere kommandoer. En annen ting som er nyttig, er hvis man har veldig lange navn. F.eks. når man skal flytte seg i kataloger. La oss si jeg skal flytte meg til en katalog som begynner på KJ og har et kjempelangt navn. Så kan jeg skrive KJ, og så kan jeg trykke på Tab. Hvis det er entydig, så kommer kjempelangt navn opp. Hvis det ikke er entydig, så må jeg trykke Tab to ganger. Da ser vi at det er to alternativer her. Kjempelangt navn eller kjipt, som er en annen mappe.", "source": "lecture"}
{"lecture_id": "linux2del2", "chunk_id": "linux2del2_0001", "start": 130.02, "end": 239.78, "token_count": 403, "text": "F.eks. når man skal flytte seg i kataloger. La oss si jeg skal flytte meg til en katalog som begynner på KJ og har et kjempelangt navn. Så kan jeg skrive KJ, og så kan jeg trykke på Tab. Hvis det er entydig, så kommer kjempelangt navn opp. Hvis det ikke er entydig, så må jeg trykke Tab to ganger. Da ser vi at det er to alternativer her. Kjempelangt navn eller kjipt, som er en annen mappe. Hvis jeg da skriver en E, så blir kjempelangt navn entydig. Da kan jeg taste Tab igjen, og så kan jeg bare gå ned ved å taste 3... Så det gjør det mye raskere å fylle ut navn. Så bare tast TAB én eller to ganger, så får du det du trenger. Eller du får de alternativene du trenger. Tilsvarende hvis jeg har en vedtatt kommando som begynner på NETT, så... La oss si jeg skal kjøre Nettstat, som er en nettverkskommando. Så kan jeg taste NETT og så TAB. Hvis det ikke kommer noe da, så betyr det at den ikke er entydig. Da får jeg se alle kommandoer som begynner på netstat. Så er det netstat. Da fortsetter jeg å ta sånn, taster S og så tabb en gang til. Da får jeg netstat, så kan jeg taste return, så får jeg kjørt den kommandoen. Så hvis du kan de to triksene, så går ting veldig mye raskere enn når du jobber på kommando. Og flere.", "source": "lecture"}
