{"lecture_id": "linux6del14", "chunk_id": "linux6del14_0000", "start": 0.0, "end": 222.28, "token_count": 594, "text": "Det er nyttig å kunne komprimere fra kommandolinja. Vi skal se på noen vanlige kommandoer for å komprimere. Først skal vi bare hente hit passordfilen, sånn at du kan ha noe å komprimere. Legger vi på en h på ls minus l h, så skriver vi den ut i kilobytes. Så kan vi prøve å komprimere den med GZip. GZip er kanskje den vanligste kommandoen for å komprimere på Linux. Hvis jeg noe lister på nytt, så ser vi at jeg har fått en password.gz, som er på 86K. Så det er kanskje mindre enn en tredjedel av den opprinnelige sulten. Dette er da eksakt komprimering, så man får nøyaktig det samme ut igjen når man pakker ut. Og for å pakke ut så bruker man G unzip. Og da er jeg tilbake med den samme filen. Det er en annen kommando som heter bzip2, som også kan brukes til å komprimere. Og den komprimerer litt bedre. Hvis jeg setter på smslh igjen, så ser vi det er 64k, mens... GSIP, lagd 86K, så den komprimerer faktisk en god del bedre. En annen måte å... En annen måte å komprimere på som er nyttig, som også brukes til å pakke sammen hele mapper, det er tar. Og også tar i sammenheng med komprimering. Da kan vi gå opp og se på mappen vi hadde, som heter TMP, med noen piler og mapper. Og da kan man lage en såkalt TAR-fil... La oss kalle den TMP.tar av mappen TMP. M4TMP.tar, som ikke er... Den er ikke komprimert, men bare pakket sammen. Så kan vi f.eks. flytte den til... Til der vi var, Zipp. Og så kan vi gå dit. Og så kan vi pakke den ut. Da legger jeg på opsjon X for X. Vi kan fjerne den igjen, for man ønsker noe lignende. Det er ikke så ofte man bare bruker tar på den måten. Det vanligste er å komme med noe lignende. Det er ikke så ofte man bare bruker tar på den måten. Det vanligste er å komme med noe lignende. Man kan kombinere og pakke sammen i en tarefil og sippe med Gsip. Og det man gjør da, det er i en createf-feil...", "source": "lecture"}
{"lecture_id": "linux6del14", "chunk_id": "linux6del14_0001", "start": 174.72, "end": 295.0, "token_count": 322, "text": "Da legger jeg på opsjon X for X. Vi kan fjerne den igjen, for man ønsker noe lignende. Det er ikke så ofte man bare bruker tar på den måten. Det vanligste er å komme med noe lignende. Det er ikke så ofte man bare bruker tar på den måten. Det vanligste er å komme med noe lignende. Man kan kombinere og pakke sammen i en tarefil og sippe med Gsip. Og det man gjør da, det er i en createf-feil... Men også legge på en Z for sipping. Og da er standardnavnet... Er T... Eller standard extension er TGZ. Så hvis du finner en TGZ-fil, så er det en fil som er både taret og Gsip-et. Da lages det da en fil... tmp.z. Da kan vi gjøre det samme med den. Ta med den inn til Zipp. Og så kan vi pakke den ut. Og da bruker man i en XFZ. X for extract, file Zipped. Igjen så ser vi at vi har fått ut den mappen TMP, som inneholder da alle pilene. Men i dette tilfellet så ser vi at TMP.tg.z er veldig mye mindre. Den er også da zippet. Så dette er en sånn effektiv måte å pakke ned store filsystemer på og sende dem av gårde.", "source": "lecture"}
