{"lecture_id": "linux4del3", "chunk_id": "linux4del3_0000", "start": 0.0, "end": 208.92, "token_count": 591, "text": "Det er en typisk feil som oppstår i script når man har filtester, og det skal vi se på nå. Vi tar utgangspunkt i dette scriptet som tester da om input... Eller første argument til programmet er en fil eller en mappe. Og da kan man spørre seg hva skjer hvis man... Ikke sende med noe argument i det hele tatt til henne. Til dette skriptet. Da burde hun skrive ut verken fil eller mappe. Men vi kan prøve. Så da kjører jeg skriptet sånn, uten argument. Hvis jeg har med et argument, fyll og tekst det, så oppfører det seg fint. Men hva skjer nå? Jo, da skriver det ut:\" Er en fil\". Det virker som testen slår til. Uten et argument. Da må vi gå inn og se på... Se på programmet igjen og se. Hva kan det komme av? Jo, da vil det jo stå her:\" if -f dollar fil\". Så det er litt merkelig at det slår til. Men det som det viser seg, er at en test hvor det bare står -f... Den returnerte tru, den er sann. Det blir sant når variabelen fil er to. Det som generelt er fornuftig å gjøre, er å sette inn en sånn variabel i anfølgelsestegn. For da vil den teste på også en tom fil, eller et tomt argument. Det vil da gi falsk. Det som da skjer, er at den hopper videre til neste. Altså viser den den i stedet. Så vi kan teste at det er riktig. Da hopper den over er en fil, for den testen slo til. Og så velger den her en mappe. Så vi må også rette opp den hvis vi skal få et skript som funker i alle tilfeller. Så... Der. Hvis jeg klarer å... Sånn. Nå ser skriptet riktig ut. Så kan vi teste på nytt, og da får vi opp... Et fornuftig resultat. Så det er viktig å alltid ta to time. Et lignende tilfelle får man hvis man først prøver å teste ut hva innholdet av argumentet er. Så f.eks. så kan jeg prøve å sjekke... Dollar fil er lik... og så kanskje lik... ja, ordet... Ordet fil, på den måten. Den... ekko... Dollar fil er fil. Altså fil. Syns jeg.", "source": "lecture"}
{"lecture_id": "linux4del3", "chunk_id": "linux4del3_0001", "start": 140.56, "end": 276.8, "token_count": 392, "text": "Nå ser skriptet riktig ut. Så kan vi teste på nytt, og da får vi opp... Et fornuftig resultat. Så det er viktig å alltid ta to time. Et lignende tilfelle får man hvis man først prøver å teste ut hva innholdet av argumentet er. Så f.eks. så kan jeg prøve å sjekke... Dollar fil er lik... og så kanskje lik... ja, ordet... Ordet fil, på den måten. Den... ekko... Dollar fil er fil. Altså fil. Syns jeg. Hvis jeg bare har lyst til å teste den biten av en skript, så kan jeg legge på en exit, og da avslutter skriptet her. Og så får jeg ikke med resten. Så nå tester jeg bare den første delen her. Så ser vi og kjører på nytt. Hvis jeg nå tar test med fil, så ser vi... Ja, det slår til. Hvis jeg tar noe annet, så slår det ikke til, for da slo ikke den testen til. Så ser vi... Oi, da får jeg en feilmelding. Da klarer ikke Shell å forstå hva som skjer, for da kommer det bare en er-lik-fil her. Og igjen så er det viktig å sette det argumentet i fil-testen i avslutningstegn, hvis det er en variabel som du skal teste på. Hvis jeg gjør det på denne måten, så vil man ikke få feilmeldinger. Hvis jeg kjører på nytt nå, så ser vi at det fungerer rimelig, og jeg får ingen feilmelding.", "source": "lecture"}
