{"lecture_id": "linux2del7", "chunk_id": "linux2del7_0000", "start": 0.0, "end": 218.88, "token_count": 583, "text": "Vi skal se litt på filnavn. Det meste er lov når det gjelder filnavn. Men det kan være litt vanskelig fra kommandolinjen å behandle filnavn som har mellomrom. F.eks. hvis jeg vil lage en fil som heter... ... min fil, i to ord, og prøver å gjøre det sånn, så vil du se at jeg lager én fil som heter fil, og en som heter min. Hvis man skal få til noe sånt, så må man gjøre sånn. Da får man en fil. Min fil. Men hvis jeg nå prøver å skrive R min fil, så... Skal vi se hva som skjer da? Jo, da slettes min og fil, og ikke min fil. Så man kan prøve R min fil... Og vi ser at denne måten er mulig. Så får man til å slette den. Hvis man gjør sånn, så finner den verken min eller fil. Men en backslash foran space, så får man slette den. OK. En annen ting som jeg er litt kjent til, er prosesser. Hvis man bruker PS, så lister man prosessene man har i dette lokale... PSA med noen opsjoner. AUX er en sånn opsjon... Et sett av opsjoner som gjør at man lister alle prosesser på systemet. Og det ser vi er ganske mange. Vi kan telle de ved å bruke pipe til WCM-en selv. Det er 209 prosesser. Hvis man får for lange lissinger, kan man pipe det til. Det kan være enda bedre å pipe til en kommando som heter less, for da kan man altså bla oppover igjen. Og alle disse avsluttes med q. Vi hadde noen oppgaver som bruker topp. Det er en annen måte å vise alle prosessene på. Dynamisk. Ok... Litt om Linux-host. Det er ganske vanlig å kalle alle Linux-maskiner for host, eller vertsmaskiner, men en Linux-host har da typisk et host-navn. Det er en kommando som heter host-navn, som gir da host-navn på den maskinen du... Som jeg har sett med Studies SO, kan man logge seg på alle maskiner hvis man kjenner HOS-navnet. F.eks. kan jeg logge meg på en house som heter Nexus, som er på Hioa. Da holder det ikke med bare navnet Nexus. Men jeg må også ha domenenavnet. Men når jeg har hele... Når jeg har navn og domenenavn,", "source": "lecture"}
{"lecture_id": "linux2del7", "chunk_id": "linux2del7_0001", "start": 165.96, "end": 357.92, "token_count": 592, "text": "eller vertsmaskiner, men en Linux-host har da typisk et host-navn. Det er en kommando som heter host-navn, som gir da host-navn på den maskinen du... Som jeg har sett med Studies SO, kan man logge seg på alle maskiner hvis man kjenner HOS-navnet. F.eks. kan jeg logge meg på en house som heter Nexus, som er på Hioa. Da holder det ikke med bare navnet Nexus. Men jeg må også ha domenenavnet. Men når jeg har hele... Når jeg har navn og domenenavn, så kan jeg logge meg på den fra hvor som helst i verden. Og jeg kan også slå opp i DNS og se hvilken IP-adresse den har, med command and host. Da ser vi at denne maskinen har denne IP-adressen. Så hvis man først har IP-adressen, så kan man også logge seg på med SSO. Så direkte til en app-adresse. Da kommer man til den samme maskinen. Litt mer orientering og hvordan man orienterer seg. En nyttig kommando er 'Who am I?' Det høres litt rart ut. Vet man ikke hvem man er? Litt sånn schizofren kommando. Men f.eks. script kan være nyttig å bruke. Og også hvis du har gjort sudo av Route. Og da kan man også bli andre brukere. Så da kan det være nyttig å kunne... Who am I? Hostname har vi sett på. Uname er en annen nyttig kommando som gir operativsystemet. Som alltid er det masse opsjoner. Uname minus A gir operativsystemet, Linux, og litt mer hvilken kjerne det er, osv. når den ble bygd. SV, dette er... Gnu-linux. Ja... Who kan vi bruke? Den viser hvem som er logget på. Her ser vi en del studentkontor. Generelt så er det også nyttig å kunne bruke type. Typemann, f.eks., viser... Hvis jeg skriver kommando mann, hvilken kommando er det jeg bruker da? Hvilken kommando er det som egentlig utføres da? Og type-touch... Det betyr at når jeg bruker kommandoen touch, så er det egentlig dette programmet som ligger her, som er et binært eksekverbart program, som utføres. Og så kan jeg f.eks. ta touch co-mod. Nei... Type co-mod. Det viser hvor co-mod er. Så kan jeg prøve...", "source": "lecture"}
{"lecture_id": "linux2del7", "chunk_id": "linux2del7_0002", "start": 323.92, "end": 423.7, "token_count": 322, "text": "hvilken kommando er det jeg bruker da? Hvilken kommando er det som egentlig utføres da? Og type-touch... Det betyr at når jeg bruker kommandoen touch, så er det egentlig dette programmet som ligger her, som er et binært eksekverbart program, som utføres. Og så kan jeg f.eks. ta touch co-mod. Nei... Type co-mod. Det viser hvor co-mod er. Så kan jeg prøve... Type PWD. Og da får jeg opp at PWD, Print Working Directory, det er et skjell built in. Så PWD er da en del av skjellet. Og det er ikke da et eksternt program som man kjører som ligger et eller annet sted. PWD, den funksjonaliteten, er bygd inn i selve skjellet. Altså, det er en type... Hvis den som bruker skjellet, Så print ut hvor... Hvor i filsystemet brukeren står. Og så sett tidligere... History kan være nyttig å bruke. Men da kommer det en svært lang liste, så da kan man pipe den til More. Så får man alle tidligere kommandoer. Og som sagt, enda nyttigere med History er å bruke kontroll-r for å... Lete tilbake i historien.", "source": "lecture"}
