{"lecture_id": "linux11del8", "chunk_id": "linux11del8_0000", "start": 0.0, "end": 217.96, "token_count": 588, "text": "Vi så før pausen at for å kunne... For å kunne kjøre påskjellscript, så måtte man sette execution policy til remote side. Og det måtte man gjøre som administrator. Når man først har gjort det, så kan man lage egen script og kjøre alt man ønsker å kjøre. Først skal vi se på et par command lets som er veldig nyttige. Vi ser... man kan bruke tabbe på samme måte som i et linjeskjelv. Hvis jeg skriver get co, f.eks., og så tabbe, så ser vi at den fullutfører med get-kommand. Så kan jeg fortsette å tabbe, og da vil jeg tabbe meg med... Gjennom alle mulige... command-lets som begynner på get-dash-c. Så get-kommand gir en oversikt over alle kommandoer. Og det vil da være fryktelig mange, men vi kan som et Linux-styrk pipe det til mål. Da ser vi at vi får en lang liste over ikke bare command-lets, men også alle som er definert. Og alle funksjoner. Og det er en rekke funksjoner, og så er det en mengde command-lets. Stop computer stop-prosess, for eksempel, tilsvarer kill. Og en rekke andre. Så kan man... Jeg bruker get-kommand til å finne ut hva som skjer hvis jeg kjører LS. Da vil jeg se at LS egentlig er et alias. Det er sånn man har lagd alle Linux-kommandoene, sånn at man kan bruke LSIMV osv. Da har man lagd et alias som er til get-shild-iter. Så kan man ønske å vite hva er get. Der kom jeg innom Shighlight Am. Litt for rask. Get command, get shighlight am. Da får jeg vite hva er egentlig get shighlight am. Da får jeg ikke så veldig mye informasjon. Det jeg får vite da, er at dette er en command-let. Typen står her, command-let. Og så får jeg versjonen og hvor den kommer fra. Hvis jeg skal vite mer om en kommando, så kan jeg bruke get help. Da kan jeg ta get help, og da får jeg en manualside som ligner på Linux-mann. Det går også an å bare... Istedenfor get help, så kan jeg bare bruke help. Men den gir da automatisk en war også, så den hjelper kanskje enda bedre å bruke.", "source": "lecture"}
{"lecture_id": "linux11del8", "chunk_id": "linux11del8_0001", "start": 169.28, "end": 229.2, "token_count": 155, "text": "Det jeg får vite da, er at dette er en command-let. Typen står her, command-let. Og så får jeg versjonen og hvor den kommer fra. Hvis jeg skal vite mer om en kommando, så kan jeg bruke get help. Da kan jeg ta get help, og da får jeg en manualside som ligner på Linux-mann. Det går også an å bare... Istedenfor get help, så kan jeg bare bruke help. Men den gir da automatisk en war også, så den hjelper kanskje enda bedre å bruke. De to kommandoene er nyttige, for de kan da gi deg informasjon... De kan gi deg informasjon om kommander.", "source": "lecture"}
