{"lecture_id": "linux2del9", "chunk_id": "linux2del9_0000", "start": 0.0, "end": 189.12, "token_count": 595, "text": "Da skal vi se på i litt mer detalj all informasjonen man får ut når man bruker kommandoen ls-l. Spesielt skal vi se på filrettigheter. Så hvis jeg taster ls-l, så ser vi at det kommer ut en masse informasjon her. Og den første informasjonen er det første tegnet. Hvis det er en fil, som filen som heter cmod her, en tom fil, så står det en strek. så står det en mappe. Og hvis det er en L, så er det en link. Deretter så kommer informasjon om rettigheter. Og da er det viktig å vite at dette er tre bolker. Tre grupper av tre tegn som gir rettigheter. De første tre tegnene, det gir rettighetene... Og eieren av filen, det er det brukernavnet som står her etter rettighetene. Hvis i dette tilfellet så er det brukeren Haugerud, som er meg, som eier filen. Og jeg har da disse rettighetene. Og R står for read, det er lov å lese. W står for write, skrive. Er en rettighet du trenger for å kunne kjøre et program. Det har vi sett tidligere. Når vi skal lage skript, så må vi ha på denne X-en. Så de tre første tegnene, eller tegn fra to til to, tre og fire, de sier noe om rettighetene som jeg som bruker har. Og så kommer det tre tegn til, og det er en ny bolka av rettigheter. Read, write, execute. I dette tilfellet så er det da read. Og det disse rettighetene gjelder, det er drift. Og i dette tilfellet er det den gruppen som eier denne filen, eller som har rettigheter til denne filen. Og dette betyr at... Ja, f.eks. den her, den første filen, betyr at jeg som eier kan lese og skrive, men ikke 2000. Denne filen. Mens de som er med i gruppen Drift... En gruppe er definert ved et sett av brukere som er med i gruppen. De som er med i gruppen Drift, de kan lese filen, men de kan ikke skrive til den og ikke kjøre den. Og så kommer de neste tre tegnene. De siste tre tegnene er rettigheter til alle andre. De som ikke er eier og ikke er med i drift. Rettigheten til alle andre brukere på systemet.", "source": "lecture"}
{"lecture_id": "linux2del9", "chunk_id": "linux2del9_0001", "start": 150.0, "end": 328.06, "token_count": 595, "text": "Denne filen. Mens de som er med i gruppen Drift... En gruppe er definert ved et sett av brukere som er med i gruppen. De som er med i gruppen Drift, de kan lese filen, men de kan ikke skrive til den og ikke kjøre den. Og så kommer de neste tre tegnene. De siste tre tegnene er rettigheter til alle andre. De som ikke er eier og ikke er med i drift. Rettigheten til alle andre brukere på systemet. Så kommer et tall som er antall hardlinks. Som har med hvor mange i filsystemet, hvor mange linker som går til det. Så hvis du har mapper, så kan du ha mange sånne linker. Det brukes ikke så mye. Så kommer brukernavnet eller eieren av dette gruppe. Neste tall er størrelsen. 4096 er en sånn standard størrelse for mappen. Men hvis jeg putter noen tegn inn i den filen, se og måt... Kan gjøre sånn. Ekko, hei. Bare skriver ut hei, og så sender jeg det til se og måt. Hvis jeg nå tar LS-min selv, så ser vi at der står det fire. Og det er fordi det er fire tegn. Så dette er da størrelsen på filen. Og så kommer datoen hvor denne er... Dette er tidspunktet for sist den ble endret. Så når jeg endret den her, så fikk den et annet tidspunkt enn det den hadde der. Og helt og slett så kommer navnet. Så det vi skal se på nå, er hvordan vi... Vi skal se i detalj på rettighetene og hvordan vi endrer rettigheter. En vanlig måte å endre rettigheter på er å bruke tallkoder for å endre rettighetene. Det kan jeg vise ved å endre rettigheter. Som vi har sett sider av tida at de trenger CMOD, change modes, for å endre rettigheter. Da kan jeg spesifisere tre tall. De tre tallene vil da være... La oss si jeg bruker 754. De vil være da rettighetene for... Først for brukeren, så for gruppen. Fem. Og så for alle andre. Og så... Ja, nå var det kanskje litt forvirrende at den... Jeg kan gjøre det på DIR2. Sånn. Nå endrer jeg da på mappen DIR2. Hvis jeg nå gjør LS-L, så ser vi at jeg har fått en liten endring her.", "source": "lecture"}
{"lecture_id": "linux2del9", "chunk_id": "linux2del9_0002", "start": 295.82, "end": 476.72, "token_count": 593, "text": "Da kan jeg spesifisere tre tall. De tre tallene vil da være... La oss si jeg bruker 754. De vil være da rettighetene for... Først for brukeren, så for gruppen. Fem. Og så for alle andre. Og så... Ja, nå var det kanskje litt forvirrende at den... Jeg kan gjøre det på DIR2. Sånn. Nå endrer jeg da på mappen DIR2. Hvis jeg nå gjør LS-L, så ser vi at jeg har fått en liten endring her. Den der var fortsatt den samme. Hadde den koden... Denne ble også den samme, men den siste ble litt endret. Så når jeg gjør det på denne måten, så setter jeg koden. Så f.eks. hvis jeg setter 111 som kode, og så gjør Ellis min selv, så ser vi at der er bare X satt for alle. Og systemet dette gjøres på, er sånn at... Hvis vi konsentrerer oss om de tre siste... Så hvis det står en X der, så tilsvarer dette det binære tallet 1. Hvis jeg nå i stedet endrer modus til 222 på alt sammen... Og så ser... Så ser vi at det er dobbeltvedsatt. Og hvis vi ser på dette binært, så ser vi... Så tilsvarer dette her 010, og tallet 2. Og hva blir det da hvis jeg setter 3? Jo, da bør det være dobbelt ved x. For da... 3 tilsvarer 011. Så hvis jeg setter alt til 3, så ser vi at rettighetene blir dobbelt ved x. Og da er det klart at hvis jeg setter det til 4, så... Da bør rettigheten bli R strekk strekk. Det tilsvarer da tallet fire. Og så kan jeg fortsette sånn. Hvis jeg først er i gang, så kan jeg ta fem, fem, fem også. Og da ser vi... Da er det en firer, ingen toere og en ener. Så dette blir fem. R strek x. En kode som seks er også vanlig å bruke, for det gir da rw. Det er de to satt. Fire og to er seks. Og syv vil da være å sette alle rettigheter. For det vil da være syv tilsvarer én, én, én i rettigheter. Så på den måten så kan man sette hva man måtte ønske.", "source": "lecture"}
{"lecture_id": "linux2del9", "chunk_id": "linux2del9_0003", "start": 438.44, "end": 626.7, "token_count": 548, "text": "Og da ser vi... Da er det en firer, ingen toere og en ener. Så dette blir fem. R strek x. En kode som seks er også vanlig å bruke, for det gir da rw. Det er de to satt. Fire og to er seks. Og syv vil da være å sette alle rettigheter. For det vil da være syv tilsvarer én, én, én i rettigheter. Så på den måten så kan man sette hva man måtte ønske. La oss si jeg ønsker syv for... Eller syv for meg selv, fire for gruppen og ingenting for alle andre. Da ser vi at jeg har alle rettigheter. Mens de som er med i gruppen drift, de kan bare lese. Og alle andre har ingen rettigheter til denne filmen. Så dette er generelt sånn... Jeg anbefaler å sette rettigheter, for da setter du absolutt alle rettigheter. Du definerer med én kommando, ett tall, nøyaktig hvilke rettigheter filen eller mappen har. Så vi kan se litt på effekten av hvis jeg setter... Hvis jeg ikke gir eksekverbare rettigheter til en mappe... La oss si jeg setter... 4.00 får jeg mappen Deal 2. Sånn som det. Da kan jeg lese denne mappen, men hvis jeg prøver å gå dit, så får jeg permission denied fordi jeg må ha en X hvis jeg skal gå ned til... Hvis jeg skal få tilgang til mappen. Jeg får ikke tilgang til å lese det som er inni der. Derimot, hvis jeg endrer... Så kjører vi da til... Skal vi se... XD er den siste, så 1. Så jeg setter 1.00 for mappen. Og så prøver du å gå dit. Så ser vi at jeg kommer inn. Men jeg får permission tonight. Og det er for å lese, for å lese. For jeg har ikke leserettigheter. Du ser jeg bare har X. Så det minste jeg trenger, er å ha X og R. Og det vil da være fire pluss én. Det blir da fem. Hvis jeg setter 5.00 på de to, så kan jeg gå til de to, og jeg kan se på det som er inne.", "source": "lecture"}
