{"lecture_id": "linux6del9", "chunk_id": "linux6del9_0000", "start": 0.0, "end": 177.96, "token_count": 598, "text": "Vi har sett hvordan screen kan brukes til å sette i gang prosesser i bakgrunnen, slik at de står og kjører etter at man har logget ut. Det er mulig å gjøre det ved å legge det eksplisitt i bakgrunnen og logge ut også, men det man kan få problemer med da, er hvis man har standard R og standard out, og ikke tar seg av det på en ordentlig måte. Det samme gjelder når man prøver å starte tjenester remotely, altså starte en... Jobb på en annen server med SSH. Så vi skal se kortere på det. Nå er jeg på StudySSH, og så logger jeg inn på Linux-VM-en. Og her tenker jeg at jeg har et lite skript som skriver både til standardoppdrett hver runde, og så skriver det en feilmelding også til standard error. I tillegg kan man tenke seg at denne... Dette skriptet får input. Så det jeg ønsker å gjøre nå, er å prøve å starte det remotely fra Studio SSO. Så det jeg kan starte med da, er å se bare at det funker. Ja, jeg kan kjøre én enkel kommando. Men så ønsker jeg å prøve å kjøre en litt mer komplisert kommando, nemlig loop.shell. Og så ønsker jeg å legge... dataen fra loop.shell i loop.log, f.eks. På den måten. Kanskje jeg ønsker å overskrive dataene, sånn at denne bare øker loggfilen etter hvert. Så... Til slutt så ønsker jeg typisk å legge den i bakgrunnen. Og så prøver jeg å starte skriptet på denne måten. Det første problemet som dukker opp, er en fin seer command not found, og det er fordi da må jeg angi full path. Fordi det sendes ikke med SSH. Og det jeg følger med path, og så må jeg ha tilsvarende full path her. Group 100... Sånn. Så kan jeg prøve å kjøre da. Da ser jeg at det blir litt feil, for da kommer standard R ut her. Så dette fungerer ikke helt som jeg skulle ønske. Så da stopper jeg den. Så det jeg kan gjøre da, er altså... Enten kan jeg legge standard-eier til samme sted som standard-out. Eller så kan jeg si eksplisitt at jeg vil ha standard-eier til home...group100, f.eks. r.txt. På denne måten.", "source": "lecture"}
{"lecture_id": "linux6del9", "chunk_id": "linux6del9_0001", "start": 132.24, "end": 261.8, "token_count": 330, "text": "Group 100... Sånn. Så kan jeg prøve å kjøre da. Da ser jeg at det blir litt feil, for da kommer standard R ut her. Så dette fungerer ikke helt som jeg skulle ønske. Så da stopper jeg den. Så det jeg kan gjøre da, er altså... Enten kan jeg legge standard-eier til samme sted som standard-out. Eller så kan jeg si eksplisitt at jeg vil ha standard-eier til home...group100, f.eks. r.txt. På denne måten. Alt fungerer som det skal. Jeg får prompt tilbake. Så kan jeg gå inn på hosten og se hva som foregår her. Det jeg kan se da, er på loop.log. Den står og går fint der. Og så på loop... er r.taxd. Der ser vi at vi for hver runde får feilmeldinger. Sånn... Og hvis vi går ut og inn igjen, så ser vi at... Det skriptet som vi startet, det står fortsatt og kjøler. For en liten ting til som man kan gjøre for helt sikkert, det er hvis det skulle komme noe input. Da kan man gjøre følgende. Man kan si... Del 0, sende det inn til input. Da må man helt skuddsikker måtte og starte script eller program på en annen server... Fra en server og starte det på en annen server.", "source": "lecture"}
