{"lecture_id": "linux6del12", "chunk_id": "linux6del12_0000", "start": 0.0, "end": 194.56, "token_count": 580, "text": "Det kan være at man ønsker å få skriptkjørt regelmessig. For eksempel så kan jeg lage et scriptsync.shell hvor jeg bruker en rsync-kommando. Rsync minus a, og ikke minus r, som det er på SEP. Denne rsync-kommandoen tar kopi av min mappe på OS100. Og legger den på lokalt på dette systemet. I tillegg ser vi at jeg legger til en liten linje, backup tatt og hvilken dato tidspunktet ble tatt på, til en loggfil. Og da kunne jeg ønske at du kunne kjøre den med emnet mellomrom, f.eks. hver natt. Og til dette så kan man bruke kron. Kron er en egen bakgrunn. En bakgrunnsprosess, en demon som står og går, og som styrer såkalte kronjobber, som kjøres i kronologisk orden med jevne mellomrom. For å legge inn en sånn jobb i kron, så bruker man en kommando som heter krontab. Krontab minus e for edit, da får man opp en fil som man kan editere. Og nederst i den så ser vi at jeg allerede har lagt inn... Sync.shell. Her i Krontab så kan man ikke bruke Tilde, så man må bruke full path til skript man kjører. Disse stjernene i starten, det er en kode for hvor ofte et skript skal kjøres. Hvis jeg f.eks. setter inn 5 her på den første, så er det... Det er minutt. Så denne vil... Dette vil si at denne jobben vil kjøres hver gang antall minutter er fem. Altså det vil da bli fem år tolv, fem år vett, fem år to osv. Hvis jeg setter på én for time her, så vil det da kjøre på tidspunktet 01.00. Hvis jeg bare har stjerner, så ville default kjøre hvert eneste minutt hele døgnet. Så kan man også sette på day of month, altså hvilken dag, osv. Det som kanskje er enklest er måten å finne ut det på hvis man har en spesiell tidspunkt eller antall ganger om dagen osv. I notatene står det en link til en webside som man lett kan få til hvilken som helst frekvens på å kjøre dette skriptet.", "source": "lecture"}
{"lecture_id": "linux6del12", "chunk_id": "linux6del12_0001", "start": 141.66, "end": 316.04, "token_count": 470, "text": "Hvis jeg setter på én for time her, så vil det da kjøre på tidspunktet 01.00. Hvis jeg bare har stjerner, så ville default kjøre hvert eneste minutt hele døgnet. Så kan man også sette på day of month, altså hvilken dag, osv. Det som kanskje er enklest er måten å finne ut det på hvis man har en spesiell tidspunkt eller antall ganger om dagen osv. I notatene står det en link til en webside som man lett kan få til hvilken som helst frekvens på å kjøre dette skriptet. Vi kan teste dette skriptet nå. Nå har jeg satt opp frekvens hvert minutt. Når man saver den filen, så ser man at man kommer opp krontab. Og da kan jeg ta en tale minus F på... Kanskje se på klokkeslettet først. Nå er det 3.3.13. Da tror jeg det snart skal skrives en ny. Den loggen het sync.log. Nå har jeg en tale på den, og der så vi at 33.32... Så ble en ny backup tatt. Og da kan vi også prøve å se... Hvis jeg nå lager en ny fil her... På OS100, så skal kronjobben gå, og så skal den snart legge til ny fyll. Den går da hvert minutt. Så den har ennå ikke gått. 34,11. Da betyr det at om ja, 15 sekunder omtrent, så vil kronejobben gå enda en gang. Dette er jo kanskje litt høy frekvens, så... Men man kunne godt sette opp en gang hver time. Der så vi. Og så kan vi se om den har gjort det den skulle, nemlig å oppdatere. Ja, det ser vi at jeg har fått til. Da har jeg fått over ny fil. Og på denne måten kan man sette opp et backup-system.", "source": "lecture"}
