{"lecture_id": "linux4del5", "chunk_id": "linux4del5_0000", "start": 0.0, "end": 222.04, "token_count": 584, "text": "Vi skal nå se på diverse andre filtester og teste ut hvordan de virker. Så da starter jeg en tom mappe. Og så lager jeg en fil. Og så lager jeg en mappe. Så kan jeg også lage en link, f.eks. en link til passordfilen. Hvis jeg lister den nå, så ser vi at alle de finnes. Og da kan vi starte med den testen vi så på... If minus fphi... Ikke dollar, men bare fil.txt. Det er navnet på den fyren. Så kan vi, hvis den finnes, hvis dette blir true, så kan vi skrive ut... Kanskje bare true og fi... sånn. Og da ser vi at vi fikk ut en tru. Hvis vi kjører den kommandoen, så får vi ut tru. Så kan vi gjøre det tilsvarende med mappe. Men det har vi også sett tidligere. Hvis vi tester på en mappe sånn, så får vi også ut tru. Men siste testen er minus L for link. Hvis jeg tester det på mappe, så får jeg ingenting. Hvis jeg tester det på den linken, så ser vi. Jo, da får vi tru. Dette er da en link. Så har vi også noen andre tester, f.eks. hvordan å teste om en fil er skrivbar. Så kan vi se på denne filen her. Er den skrivbar? Ja, den er skrivbar, så det skulle gå an å få det til. Og det tester man med minus W. Da får jeg tro, for jeg kan skrive til. Hvis jeg nå endrer den til... La oss si 4.00. Det vil nå gi at film bare kan leses. Så ser vi da hvorfor jeg ikke tror lenger. Og tilsvarende hvis jeg setter den, la oss si, til... 3.00. Hva vil det si? Jo, det er bare å skrive og kjøre rett etter. Hvis jeg nå tester på å skrive her, så får jeg ikke tro. Men selvsagt så er den fortsatt en fil. Og nå kan jeg også teste på kjørbar. Og den er da også kjørbar. Så på den måten kan man teste masse egenskaper for filer. Det fins en del andre filtester også, men det er det de oftest trenger. Av andre tester så kan det være nyttig å sammenligne strenger. Sammenligne to strenger på denne måten... La oss si if A er lik A. Det ser vi her, tror jeg.", "source": "lecture"}
{"lecture_id": "linux4del5", "chunk_id": "linux4del5_0001", "start": 175.32, "end": 382.48, "token_count": 595, "text": "Men selvsagt så er den fortsatt en fil. Og nå kan jeg også teste på kjørbar. Og den er da også kjørbar. Så på den måten kan man teste masse egenskaper for filer. Det fins en del andre filtester også, men det er det de oftest trenger. Av andre tester så kan det være nyttig å sammenligne strenger. Sammenligne to strenger på denne måten... La oss si if A er lik A. Det ser vi her, tror jeg. Mens A er derimot ikke lik B. Da får vi ingenting. Så kan vi... Men utropstegn gir ikke. Så vi kan også teste sånn. A er ikke lik B. Igjen så ser vi at vi må være forsiktige med syntaks. Hvis vi har utropstegner for langt fra... Eller om vi har et mellomrom imellom, så fungerer det ikke. Ja... Så kan man også sammenligne tall. Man kan f.eks. si... To er lik... To. Den slår til. Ja, det ville også fungert med streng sammenheng. Men det som ikke ville ha fungert, er mindre enn. Så dette er en test på om to er mindre enn to. Og den har da ikke tro. Men hvis vi tester om to er mindre enn fire, så får vi tro. Hvis det motsatte er greitere enn, Den er false. Men hvis vi gjør det tallet større, så får vi tro. Så det er en måte å sammenligne tall på. Vi skal se senere at... Det å jobbe med tall og nummerikk er... litt tungvint. Så en annen måte å få en mer moderne syntakse på, det er å bruke to parenteser på denne måten her. Da kan man teste på denne måten, som er mer naturlig. Med større enn og mindre enn. Denne vil da ikke slå til. Da funker det ikke å sette lik. Dette er mer sånn Java CS-intaks. Da må man ha to like stein hvis du skal teste om de er like. Og hvis jeg setter 7 lik 7, så får jeg tro. Så på den måten så kan man... Når man tester tall... Generelt når vi bruker tall og aritmetikk, så er syntaksen enklere å ligne på javo-syntaks hvis man setter to parenteser rundt. Dette er typisk sånn som er lagt til skjellet i ettertid at det ble laget. Da bruker man den dobbel-parentes-syntaksen", "source": "lecture"}
{"lecture_id": "linux4del5", "chunk_id": "linux4del5_0002", "start": 349.02, "end": 442.98, "token_count": 291, "text": "Da må man ha to like stein hvis du skal teste om de er like. Og hvis jeg setter 7 lik 7, så får jeg tro. Så på den måten så kan man... Når man tester tall... Generelt når vi bruker tall og aritmetikk, så er syntaksen enklere å ligne på javo-syntaks hvis man setter to parenteser rundt. Dette er typisk sånn som er lagt til skjellet i ettertid at det ble laget. Da bruker man den dobbel-parentes-syntaksen for å kunne legge til noe nytt. I tillegg så har vi logiske operatorer. Hvis vi da går tilbake til denne typen, så kan vi f.eks. si if 7 er greater enn 4. Da er det true. Men så kan vi legge til noe mer. Minus a er da en add. Vi kan f.eks. legge til strengen true. Da skal det fortsatt være riktig. Men hvis vi har en tom streng med ant, så ser vi... Da får vi false fordi den tomme strengen... ... jeg ikke tror. Or... Det er minus O, den gir or. Så denne vil da likevel slå til fordi syv er større enn fire.", "source": "lecture"}
