{"lecture_id": "linux5del2", "chunk_id": "linux5del2_0000", "start": 0.0, "end": 194.0, "token_count": 583, "text": "Passordkrakking. Hvis man har tilgang til Shadow Film på Linux, som vi har sett, og dermed tilgang til hashtringene, så kan man ved en Brute Force-metode finne ut hvilke passord som passer til hvilken konto. Og man har tilsvarende passordhasher på Windows. Der også har man fått bedre og bedre algoritmer. På Minus lagres hersteringen i en såkalt SAM-datapasse. Og den er opplagt også. Det er veldig viktig at den ikke blir kjent, for da kan alle som kjenner disse hersene, prøve å gjette på passord. Og da bruker man programmer som kjører gjennom f.eks. ordbøker. Eller eventuelt alle mulige kombinasjoner. Men her på OsloMet, på Studio SSO, så ser det ut som du logger inn på en Linux-server. Og for fem-seks år siden så lå også passordhersen i shadowfilen. Men det gjør det ikke lenger. Når du logger på nå, så sendes denne forespørselen til en... En database sentralt og en AD Active Directory-database. Og så er det der autentiseringen foregår. Men på samme måte. På den måten sikrer man seg at man bare har herser ett sted på Oslomet. Tidligere var det to, men det var da en ulempe sånn sikkerhetsmessig. Jo færre steder de hersene er, jo bedre er det. Vi skal se litt på hvordan man kan cracke sånne passord med brute force. Ved virkelig brute force kan man gå gjennom alle mulige kombinasjoner. Da kan man tenke seg hvis det f.eks. er 52 tegn, små og store bokstaver, og titall, så har du 62 kombinasjoner. Hvis du da har 8 tegn i passorden... Så vil det bli åtte opphøyd i 62, som er to ganger ti fjortende. Eller 218 billioner mulige kombinasjoner. Og hvis man har en veldig kraftig GPU-server, så vil det ta noe sånt som sju år å regne én million hash i sekundet.  Og brute-force et sånt passord. Så når du har så mange som 62 tegn og en lengde på 8 bit... Nei, på 8 tegn. Så... så tar det uforholdsmessig lang tid", "source": "lecture"}
{"lecture_id": "linux5del2", "chunk_id": "linux5del2_0001", "start": 150.0, "end": 336.88, "token_count": 589, "text": "Så vil det bli åtte opphøyd i 62, som er to ganger ti fjortende. Eller 218 billioner mulige kombinasjoner. Og hvis man har en veldig kraftig GPU-server, så vil det ta noe sånt som sju år å regne én million hash i sekundet.  Og brute-force et sånt passord. Så når du har så mange som 62 tegn og en lengde på 8 bit... Nei, på 8 tegn. Så... så tar det uforholdsmessig lang tid å knekke et passord av den type. Men det er derfor man da må velge enda lengre passord. Så... og... Man blir oppfordret til å bruke spesialtegn. Og hvis du gjør det, så ser du... Hvis du har en lengde på ti passordtegn, og så bruker du 94 tegn til å skrive passord med, alle sånne spesialtegn, så er det oppe i 1,7 millioner år før du kan cracke et sånt passord ved Web Route Force. Og dermed blir det... med lange passord. Så blir det i praksis umulig å bruke et brute force-angrep. Men det er også derfor det er så veldig farlig å bruke ord fra ordbok i et passord. For når man gjør det, så kan man kjøre brute force bare gjennom ordboken. Og f.eks. det å teste ut én million ord, det kan man gjøre på et sekund. Har du et ord som står ordrett i en ordbok, så er sjansen stor for at passordet ditt kan bli avslørt av en passordknekke-algoritme som dette her. Men det er klart... For i det hele tatt å få det til, så må man først ha... En hash. Altså, man må ha din hash. Men noen ganger så blir den type hasher avslørt, og da kan man så kverne passordkrakk i algoritmen på dette til man finner passord. Noe helt annet som vi skal se på senere, er SSO-skanning. Da prøver man også å gjette passord for å komme seg inn på SSO-servere, men da gjetter man bare ett av gangen, hvert tredje sekund maks. Men det må dere være obs på på VM-ene dere har med Public IP. Med en gang dere f.eks. lager et nytt brukernavn med passord der,", "source": "lecture"}
{"lecture_id": "linux5del2", "chunk_id": "linux5del2_0002", "start": 309.72, "end": 374.68, "token_count": 220, "text": "til man finner passord. Noe helt annet som vi skal se på senere, er SSO-skanning. Da prøver man også å gjette passord for å komme seg inn på SSO-servere, men da gjetter man bare ett av gangen, hvert tredje sekund maks. Men det må dere være obs på på VM-ene dere har med Public IP. Med en gang dere f.eks. lager et nytt brukernavn med passord der, så... Hvis dere har lagret dårlig passord, så blir man hacket med en gang fordi en mengde brutt force-angrep på public IP-er. Sånn ca. hvert tredje sekund tikker det inn et nytt forslag til passord. Hvis du bruker test-test, så blir du typisk hacka i løpet av få minutter. Det er veldig viktig å sette gode passord på brukerne dere etter hvert skal lage.", "source": "lecture"}
