{"lecture_id": "linux5del14", "chunk_id": "linux5del14_0000", "start": 0.0, "end": 188.76, "token_count": 583, "text": "Det kan være nyttig å deklarere funksjoner eller metoder i skjellskript. Vi skal først se på hvordan vi kan definere en funksjon direkte i skjellet. Og en funksjon må defineres med parenteser på denne måten. Og videre er syntaksen at det skal komme en krøllparentes, og så skal det i kommandoen. La oss si jeg bare skriver ut hosename, og så kommandoen who. Så avslutter jeg funksjonen. Da har jeg definert en funksjon, og da kan jeg utføre funksjonen ved å taste users på den måten. Da ser vi at da utføres først hosename, og så who. Hvor det bare er jeg som er innlogget. Så kan vi se... Sånn kan man definere en funksjon på én linje. La oss si jeg prøver å legge med én... ... en kommando til. Sånn. Så kan jeg igjen kjøre users. Og da ser vi at jeg har utvidet den funksjonsdefinisjonen. Sånn kan man lage små funksjoner i skjellet og kjøre dem. Men så kan man da også bruke dem i skript. Bare se kort på et eksempelskript fra forelesningsnotatene. Og det starter da med å deklarere en funksjon find user.  Først her skriver vi ut hvilke argumenter vi sender med til hovedprogrammet. Hovedprogrammet kommer lenger nede. Men man deklarerer funksjonene først. Og så deklarerer vi en lokal funksjon vi bruker her. Den vil ikke kunne ses av hovedprogrammet. Og så setter jeg bruker lik dollar én. I hovedprogrammet skal vi sende med én variabel til finduser. Og den variabelen kommer da som dollar 1, akkurat som til hovedskriptet. Men dette er da ikke dollar 1 i hovedskriptet. Og så gjør jeg funksjonaliteten til finduser. Jeg greper på å bruke rettspassord. Og hvis dette blir noe, hvis det er et funn, så returnerer jeg null. Alt OK. Returneres 1. Så det er funksjonen. Så kan vi se på hovedprogrammet. Vi bruker da den funksjonen. Det løper først igjennom alle argumentene i...", "source": "lecture"}
{"lecture_id": "linux5del14", "chunk_id": "linux5del14_0001", "start": 147.12, "end": 337.52, "token_count": 600, "text": "Og den variabelen kommer da som dollar 1, akkurat som til hovedskriptet. Men dette er da ikke dollar 1 i hovedskriptet. Og så gjør jeg funksjonaliteten til finduser. Jeg greper på å bruke rettspassord. Og hvis dette blir noe, hvis det er et funn, så returnerer jeg null. Alt OK. Returneres 1. Så det er funksjonen. Så kan vi se på hovedprogrammet. Vi bruker da den funksjonen. Det løper først igjennom alle argumentene i... Som sendes med når programmet kjøres, altså hovedprogrammet. For hvert av de argumentene så kaller det fine user, dollar user. Det blir da dollar én i funksjonen, som vi definerte oppe. Og så ser vi at det er funksjonen returnere null eller én. Og returverdien finnes som vanlig i dollarspørsmålstegn. Hvis den er null, så betyr det at da finnes user, og hovedprogrammet leverer dollarfunn, skriver ut at den er funnet. Vi ser dollar-funn. Den er definert her. Og den er global, siden den ikke er definert som lokal. Så dermed kan vi skrive ut funn her i hovedprogrammet. Hvis ikke, så skriver man ut at Yzer ikke finnes. Så da kan vi se hvordan det ser ut når vi kjører dette. Hvis vi starter Yzer.shell, og la oss si jeg ønsker å finne route og... Rut og... la oss si Bind, som er to brukere. Da ser vi... Først skrives ut argumentene til skriftet. Det er Rute og Bind. Men det som skjer i hoveddelen, det er at man løper gjennom de to argumentene. Så først så leter man etter Rute, og da sendes argumentet Rute med til funksjonen. Så da får vi den funksjonen her. Får da argumentet Ruth, som i dag blir bruker. Og så gjør man den funn på brukeren. Og siden den finnes, returneres null. Og Ruth finnes, og så skriver hovedprogrammet... Det skriver ut det funnet. Så går man videre til neste argument, som er bind, og så sendes det til funksjonen. Returnerer funksjonverdien. Hvis man prøver noe som ikke finnes, ruter, så returneres verdien at ruter ikke finnes.", "source": "lecture"}
{"lecture_id": "linux5del14", "chunk_id": "linux5del14_0002", "start": 292.24, "end": 355.84, "token_count": 178, "text": "Så da får vi den funksjonen her. Får da argumentet Ruth, som i dag blir bruker. Og så gjør man den funn på brukeren. Og siden den finnes, returneres null. Og Ruth finnes, og så skriver hovedprogrammet... Det skriver ut det funnet. Så går man videre til neste argument, som er bind, og så sendes det til funksjonen. Returnerer funksjonverdien. Hvis man prøver noe som ikke finnes, ruter, så returneres verdien at ruter ikke finnes. For da returneres 1. Så dette er da et eksempel på hvordan man kan bruke en funksjon i et hovedprogram. Det er programmet eneste bøk.", "source": "lecture"}
