{"lecture_id": "linux3del4", "chunk_id": "linux3del4_0000", "start": 0.0, "end": 168.0, "token_count": 590, "text": "Prosesser... Vi skal se litt nærmere på prosesser. Det som er viktig når det gjelder prosesser, først og fremst, er å kunne liste dem. Generelt så lister man prosesser med PS. Men PS uten argumenter vil bare liste prosesser i det lokale skjellet. Så her listes bare det bæsjcellet som jeg står og kjører i. Hvis man føyer på AUX... Mange andre argumenter man også kan bruke, men AOX vil vise alle prosesser som kjører på systemet. Da legger jeg på en mål, for det er veldig mange. Med PSAOX kan du bla deg gjennom absolutt alle prosesser. Typisk så vil det da kanskje grepe på PS. Så ser vi at da får vi ut alle som har noe med PS å gjøre,inkludert... Den som selv kjørte. Så nå skriver jeg PS, og så ser jeg at jeg har to jobber som kjører. Men det kan være nyttig å se på prosesser som kjører. Jeg skal bruke et eksempel, og jeg har et script som heter run.shell. Og det scriptet gjør, er... Her er det en foreløkke som går fra 1 til 600. Så sover scriptet i ett sekund. Så dette scriptet her vil da stå i ti minutter og kjøre før det avslutter. Så dette er typisk et skjell som vi kan starte opp i bakgrunnen. Aller først, hvis jeg bare kjører script sånn som dette her, så ser vi at da får jeg ikke tilbake terminalpromptet. Og det er fordi da starter scriptet å kjøre, og så vil det kjøre helt til det avslutter. Så da kan jeg stoppe det med Controll-C, og så kan jeg i stedet starte det med et AND-tegn til slutt, en alfakrøll. Og da... Ikke en alfakrøll, en AND. Og da, hvis jeg legger den bak, så vil skriptet kjøre i bakgrunnen. Nå ser vi jeg fikk opp 10.58, og det betyr... 10.518. Og det betyr at det er en prosess... Med denne paydayen som kjører i bakgrunnen. Det ser vi også tydelig her. 10518 står og kjører her. Vi får med også den slip-funksjonen, for den kjøres gang på gang. Så hvis jeg ønsker å stoppe den prosessen for den", "source": "lecture"}
{"lecture_id": "linux3del4", "chunk_id": "linux3del4_0001", "start": 133.6, "end": 305.92, "token_count": 593, "text": "Og da, hvis jeg legger den bak, så vil skriptet kjøre i bakgrunnen. Nå ser vi jeg fikk opp 10.58, og det betyr... 10.518. Og det betyr at det er en prosess... Med denne paydayen som kjører i bakgrunnen. Det ser vi også tydelig her. 10518 står og kjører her. Vi får med også den slip-funksjonen, for den kjøres gang på gang. Så hvis jeg ønsker å stoppe den prosessen for den når den kjører i ti minutter, så kan jeg bruke kill til å stoppe den. Da tar jeg kill, og så må jeg si prosess-idéen. Så har jeg stoppet den jobben, og den er borte. Så kan det være noen tilfeller hvor du f.eks. er inne på study SSO, og så kanskje du editerer, eller et eller annet... Og så av en eller annen grunn så henger den editeringsjobben. Den fryser, og du må drepe jobben. Og det man kan gjøre da, er... Hvis alt henger, så kan man gå inn og logge seg inn på nytt. På en Linux-maskin så er det enkelt. Er jeg nå inne på samme maskin i et annet skjell? Men PCR vil jo naturlig nok ikke vise annet enn det som er det lokale skjellet. Så for å finne den jobben som som så gikk, den gjedd-jobben, så kan jeg ta PSAUX, liste alle prosesser, og så kan jeg greppe på gjedd. er denne gjedd-jobben. Så fra dette vinduet kan jeg drepe den jobben. Og så kan jeg gå tilbake til mitt skjell, og da ser vi... Her kommer det opp.... Nå har vi sendt et signal til den prosessen og fått den drept. Så hvis jeg nå gjør PS, så ser vi at prosessen er borte. En annen ting som kan være nyttig, det er... Og ta tiden på prosesser. Her ser vi den tilsvarende prosessen som bare går i en løkke tre ganger. Rundt tre... Og den vil da vare ca. tre sekunder. Men det jeg kan gjøre da, er at jeg kan ta tiden på denne prosessen. Eller hvilke som helst andre. Og da får jeg nøyaktig tid på hvor lang tid den tok. Tok de tre sekundene den skulle, så brukte den litt tid til på å starte opp.", "source": "lecture"}
{"lecture_id": "linux3del4", "chunk_id": "linux3del4_0002", "start": 270.0, "end": 310.2, "token_count": 132, "text": "Og ta tiden på prosesser. Her ser vi den tilsvarende prosessen som bare går i en løkke tre ganger. Rundt tre... Og den vil da vare ca. tre sekunder. Men det jeg kan gjøre da, er at jeg kan ta tiden på denne prosessen. Eller hvilke som helst andre. Og da får jeg nøyaktig tid på hvor lang tid den tok. Tok de tre sekundene den skulle, så brukte den litt tid til på å starte opp. Så dermed ble det 3,003 sekunder som den brukte.", "source": "lecture"}
