{"lecture_id": "linux9del1", "chunk_id": "linux9del1_0000", "start": 0.0, "end": 232.04, "token_count": 589, "text": "Da skal vi begynne å jobbe med oppgave tolv. Og den går ut på å sammenligne hastigheten til programmeringsspråk. I den oppgaven så skal vi sette opp en dockercontainer som installerer alle programmeringsmiljøene som er nødvendig for å kjøre alle disse programmene. Kompilere og kjøre det. Det man først og fremst trenger, er disse verktøyene. Så kan man etterpå gå inn og kompilere og kjøre. I første omgang skal vi bare bygge en container som installerer alt som er nødvendig. Så skal vi gå inn interaktivt og kjøre koden. Det som er tanken, og som dere kan gjøre, inkludert i neste oppgave, det er å prøve å automatisere dette i enda større grad. Sånn at til slutt, i ukens største utfordring, så blir dere bedt om å gjøre alt dette her og automatisere det, sånn at til slutt alt går automatisk. Og man setter opp en webserver som legger ut resultatene av kjøringene. Da vil det være lett å gjenta det samme for andre versjoner. F.eks. se hvordan forskjellen blir med Ubuntu 1604. Men vi tar ett steg av gangen. I første omgang skal vi lage en docker container. Dette er for å komplisere C-kode. JDK er for Java. Og i tillegg installerer vi Python. Programmene som skal brukes, ligger på Github. Jeg har et reportasje der som heter Zoom.git. I første omgang kan man laste ned det med Gith-clow. Veldig enkelt å bruke fra kommandolinjen. Det er veldig nyttig å kunne bruke det fra kommandolinjen, for da kan man automatisere alt som har med å pushe og pulle kode osv. I første omgang så vil jeg da gå til en OS-gruppe på... Går til OS70. Så da skal jeg dele et annet vindu med dere. Sånn. Og da er vi i deres land. Som dere ser her, så har jeg nettopp kjørt et script stop and remove som sletter... Alt som er av dokker. Imager, konteinere osv. Stopper alt og sletter alt. Det kan være lurt å gjøre en gang iblant, når dere tester ut dette på Linings VM. For det er relativt lite plass. Som dere ser, så har jeg 1,5 gigabyte nå. Så...", "source": "lecture"}
{"lecture_id": "linux9del1", "chunk_id": "linux9del1_0001", "start": 180.0, "end": 406.54, "token_count": 598, "text": "Går til OS70. Så da skal jeg dele et annet vindu med dere. Sånn. Og da er vi i deres land. Som dere ser her, så har jeg nettopp kjørt et script stop and remove som sletter... Alt som er av dokker. Imager, konteinere osv. Stopper alt og sletter alt. Det kan være lurt å gjøre en gang iblant, når dere tester ut dette på Linings VM. For det er relativt lite plass. Som dere ser, så har jeg 1,5 gigabyte nå. Så... Så nå som jeg har slettet alt, må jeg også bygge alt fra scratch. Jeg tenkte jeg kunne ta... Ja, vi kunne kanskje først... Aller først så kunne jeg vise hvordan... Skal vi se om jeg har en mappe som heter Sum. Nei. Så skal jeg vise hvordan... Oi. Da må jeg ha den kopien som jeg hadde. Det jeg skal gjøre nå, er at jeg skal klone fra Gits. Og da lages det en mappesum. Hvis jeg går inn den mappen og ser, så ligger det en rekke... en rekke skript- og programmeringsprodukter her. Og utgangspunktet er da bæsj-skriptet. Som vi ser. Som regner ut en løkke 50 000 ganger. Og de andre programmene regner da ut disse... Dette programmet, eller denne arbeidsoppgaven, X ganger. Så det vi skal finne ut, er hvem klarer flest sånne oppgaver på like lang tid.  Dette må vi da få til å gjøre inni dokkercontaineren. Det jeg tenkte å gjøre da, er å ta utgangspunkt i det vi gjorde forrige gang. Skal vi se om jeg har... Da hadde jeg en mappe som het Webserver. Så det jeg tenkte, var rett og slett bare å kopiere Webserver. Til en mappe som heter Sum. Så går jeg inn i summappa, og så starter jeg... Oi. Nei, det ble feil. Da hadde jeg lagd en mappesum allerede. Så hvor endte den opp, da? Jo, da ble den vel kopiert inn der. For å rydde opp litt. Så tar jeg bort sum. Og så kopiere. Sånn. Nå har jeg en mappesum. Og så vil jeg i den mappa lage en dockyfile som gjør akkurat det jeg ønsker. Vi kan starte på samme måte som tidligere.", "source": "lecture"}
{"lecture_id": "linux9del1", "chunk_id": "linux9del1_0002", "start": 359.26, "end": 591.54, "token_count": 591, "text": "Så går jeg inn i summappa, og så starter jeg... Oi. Nei, det ble feil. Da hadde jeg lagd en mappesum allerede. Så hvor endte den opp, da? Jo, da ble den vel kopiert inn der. For å rydde opp litt. Så tar jeg bort sum. Og så kopiere. Sånn. Nå har jeg en mappesum. Og så vil jeg i den mappa lage en dockyfile som gjør akkurat det jeg ønsker. Vi kan starte på samme måte som tidligere. I forrige uke. Vi kan laste inn fra Ubuntu. Så kan vi kjøre Apt-get-after. Det er viktig å ha med minus Y, for dette må skje automatisk. Men da skal vi ikke installere Apasje denne gangen. Og vi trenger heller ikke dette her. Men det vi trenger å installere, det er det som ble oppgitt på oppgaveteksten. Så da kopierer jeg litt derfra. De linjene under står det i oppgaveteksten at vi trenger. Da kan jeg tilpasse de til dokkefilen. Ved å passe på å legge til en Y på de linjene, så skulle det bli det samme. Men vi hopper over Apasje. Sånn. Og til slutt så installerer vi python. Som vi husker fra forrige gang, så vil dette gjøres linje for linje. Så... Hvis jeg først har fått den første delen til å virke, og lagt inn de, så vil det gå raskt å legge på neste. Ingenting er gitt. Ingenting ligger i konteineren i utgangspunktet. Den er så tom som bare mulig. Så vi må installere gits. Og så etterpå... Nei, jo, så må vi også... Etter at vi har installert gits, så må vi gjøre en git clone. Da må jeg gå ut i oppgaveteksten igjen og finne repositoriet. Det ligger da på GitHub. Og det er linjen til repositoriet. Så dette ser da ut som en OK dokkefeil. Så går jeg ned i vinduet under, hvor jeg fortsatt er på samme sted. Det vil si, jeg må gå inn i sum. Og så må jeg da bygge Dockify. Hvis man ikke husker helt hvordan syntaksen var på Bilt, så kan det være, hvis du har bygget før, så kan det være greit å bla.", "source": "lecture"}
{"lecture_id": "linux9del1", "chunk_id": "linux9del1_0003", "start": 534.2, "end": 670.96, "token_count": 390, "text": "Da må jeg gå ut i oppgaveteksten igjen og finne repositoriet. Det ligger da på GitHub. Og det er linjen til repositoriet. Så dette ser da ut som en OK dokkefeil. Så går jeg ned i vinduet under, hvor jeg fortsatt er på samme sted. Det vil si, jeg må gå inn i sum. Og så må jeg da bygge Dockify. Hvis man ikke husker helt hvordan syntaksen var på Bilt, så kan det være, hvis du har bygget før, så kan det være greit å bla. Da bruker jeg kontroll R, og da ser vi dokkebilde. Her har jeg satt på en time også. Det er fordi at det tar ganske lang tid å bygge dette her. Med dokkebilde minus til sum, det gir jeg da et navn til imaget. Prikk betyr at jeg bygger den dokkefilen som jeg ser over, som er i samme mappe. Da begynner dere å jobbe og henter første image. Det er syv stepp her. Det tilsvarer de syv steppene her oppe. Hvert av disse steppene vil legge på et nytt lag. Hvis noe går galt underveis, så kan man gå tilbake og gjøre det på nytt. Da slipper man å gjøre steppet på nytt. Eller hvis det er noe feil med git clone. Og alt det andre er riktig, så kan man bare rette opp Git Klovn. Og så få det til å kjøre. Men som sagt, dette tar ganske lang tid. For det er mye kode å hente. Det tar omtrent åtte minutter.", "source": "lecture"}
