{"lecture_id": "linux1del8", "chunk_id": "linux1del8_0000", "start": 0.0, "end": 196.9, "token_count": 598, "text": "Filbehandling er spesielt viktig i Linux, fordi så å si alt i Linux av konfigurasjon og andre data er lagret som filer, og veldig mye av det er lagret som tekstfiler. Så det å kunne manipulere på tekstfiler, det er veldig viktig i Linus. Vi har allerede sett på noen kommandoer, sånn som ls, som listede filer. Se her. Den lager en lang listing. Jeg har fått en fil som heter ScriptShell med en liten trille til slutt. Det er fordi jeg brukte Jed. Det er en liten forskjell på de to filene. Og Jed sparer alltid en sikkerhetskopi med en annen trille når man gjør endringer. Hvis man bruker nano, så lages det ikke en sånn sikkerhetskopi, hvis man blir irritert over alle de tidligere filmene. Man kan også legge på andre opsjoner på LS. F.eks. kan man legge på LS minus A. Og da er det to mapper til som vises. Det er prikk. Og de mappene er mappene man står i, og i tillegg er det mappen et hakk opp. Hvis jeg ønsker å gi flere opsjoner samtidig, så kan jeg legge på begge to, så jeg kan skrive L-L og A samtidig. Og da ser vi tydeligere hva prikk og prikk-prikk er, eller at de er mapper.  Det er at prikk er en mappe. Den starter med det her. Og det er altså den mappen man står i. Så rettighetene for denne mappen, det er rettighetene for mappen jeg står i nå. Mens den mappen som vises under, det er mappen ett hakk opp. Som i dette tilfellet har den samme rettigheten. Og i tillegg har vi de to versjonene av Skript av Sjel som er listet. Man kan også liste hvilken som helst mappe. F.eks. kan jeg prøve å liste.slash rtc, som er en rekke mapper. Da har jeg listet alle mappene i slash rtc. Ved å taste kontrollet L, så får jeg clear screen. Da får jeg bort alle kommandoer og åpnet fra terminalen. Jeg kan lage mapper og filer. Og da kan jeg f.eks. lage en mappe som heter Dir. Og da bruker jeg MKDir. Eller jeg kan gjøre det eksplisitt. Jeg kan kalle det en ny mappe.", "source": "lecture"}
{"lecture_id": "linux1del8", "chunk_id": "linux1del8_0001", "start": 152.88, "end": 337.48, "token_count": 600, "text": "Man kan også liste hvilken som helst mappe. F.eks. kan jeg prøve å liste.slash rtc, som er en rekke mapper. Da har jeg listet alle mappene i slash rtc. Ved å taste kontrollet L, så får jeg clear screen. Da får jeg bort alle kommandoer og åpnet fra terminalen. Jeg kan lage mapper og filer. Og da kan jeg f.eks. lage en mappe som heter Dir. Og da bruker jeg MKDir. Eller jeg kan gjøre det eksplisitt. Jeg kan kalle det en ny mappe. Da får jeg en ny mappe som heter Ny mappe. Så er det også en kommando som heter Touch, som jeg kan bruke Hvis jeg gjør det, så får jeg nå en tom fil som heter Tom fil. Det ligger ingenting i den, og så har jeg en mappe som heter Ny mappe. Hvis jeg vil se på og inneholde filer, så kan jeg bruke command-cat. Da får jeg ut innholdet av den filen. Så må jeg kunne endre på filer. Jeg har sett tidligere... At vi har brukt Nano. Jed kan også brukes. Endre her... Lagre med kontroll S og gå ut med kontroll X, kontroll C. Det fins også andre editorier. Emax er en stor og omfattende editori hvor du kan gjøre veldig mye. Jed er på en måte en billig utgave, eller en light white utgave av Amax. Så kommandoen som gjelder i Jed, gjelder også Amax. Og hvis du skal gå ut av Amax, så bruker jeg kontroll X, kontroll C. Det enkleste i starten kan kanskje være å bruke Nano, som vi så på tidligere, fordi her kan man se nederst hvilke shortcut man kan bruke. Man har ikke pek og klikk her. I utgangspunktet så skal man kunne gå inn på en server og editere filer. Og dermed skal man jo ikke klikke for å save. Så på en eller annen måte må man da vite hvilke kommandoer man kan bruke for å gå ut. Og det er spesielt egentlig på Nano, for de står nederst. Kontroll-X, det er da exit. Så kan det være nyttig å... Kopierer. Og da er kommandoen for å kopiere CP... Hvis jeg nå ønsker f.eks. å kopiere det skriptet, script.selv... Det jeg gjorde som gjorde at jeg raskt fikk ut skript,", "source": "lecture"}
{"lecture_id": "linux1del8", "chunk_id": "linux1del8_0002", "start": 307.6, "end": 479.56, "token_count": 589, "text": "Så på en eller annen måte må man da vite hvilke kommandoer man kan bruke for å gå ut. Og det er spesielt egentlig på Nano, for de står nederst. Kontroll-X, det er da exit. Så kan det være nyttig å... Kopierer. Og da er kommandoen for å kopiere CP... Hvis jeg nå ønsker f.eks. å kopiere det skriptet, script.selv... Det jeg gjorde som gjorde at jeg raskt fikk ut skript, det var å trykke på tab. Så jeg skrev cp.sc, og så trykker jeg tab. Så får jeg script.selv, og så vil jeg kanskje la det bli starten på et nytt skript. Sånn. Da kopierer jeg filen... Hvis jeg nå taster LS-minuscell, så ser vi at da har jeg her oppe fått en ny fil som heter nyttskript.shell. Som med alle kommandoer, så kan man legge på opsjoner. Og det jeg gjorde nå, var at jeg bladde meg tilbake. Det kan man gjøre med pil opp. Nå taster jeg pil opp. Hvis jeg taster pilen ned, så kommer jeg frem igjen. Så la oss si jeg ønsker å gjøre denne kommandoen her om igjen, men med minus... Da vil jeg bruke opsjonen minus i. Minus i er så fint og aktiv, og hvis jeg prøver å skrive over en fil som finnes fra før, så blir jeg da spurt om det. Så da kan jeg få sjansen til å svare nei her. Det ønsker jeg ikke. Da blir den ikke kopiert. Allmennlig nyttet kommando er å flytte. Så la oss si jeg ønsker å få et nytt navn på nytt script selv. Jeg likte ikke det navnet, så da kan jeg bruke kommandoen mv for move. Og så kan jeg flytte nytt script... Det kan kanskje hete moved. Det denne kommandoen gjør, er at den tar nytt skript... Og flytter til move.chell. Og det vil i praksis si her at man renamer, altså at man får et nytt navn på nytt skript. Så hvis jeg nå gjør LSM-en selv, så ser vi at jeg har moved.chell. Jeg har fått nytt navn på dette nytt skript. Fra en mappe til en annen, så er det en annen måte å bruke MV på.", "source": "lecture"}
{"lecture_id": "linux1del8", "chunk_id": "linux1del8_0003", "start": 444.0, "end": 629.8, "token_count": 584, "text": "Det denne kommandoen gjør, er at den tar nytt skript... Og flytter til move.chell. Og det vil i praksis si her at man renamer, altså at man får et nytt navn på nytt skript. Så hvis jeg nå gjør LSM-en selv, så ser vi at jeg har moved.chell. Jeg har fått nytt navn på dette nytt skript. Fra en mappe til en annen, så er det en annen måte å bruke MV på. Er å ta Moved, og så ønsker jeg å flytte den ned til ny mappe. Da tar jeg MV Moved til ny mappe. Return. Og hvis jeg rister filen nå, så ser vi at Moved, den er borte. Hvis jeg går ned i ny mappe, så ser vi... Der ligger denne filen. På den måten vil det være sånn at hvis jeg bruker move inne i samme mappe, så vil den endre navn. Men hvis jeg flytter noe til en annen mappe, så... Så flyttes filen fra mappen jeg er i, til mappen jeg skal til. På den måten kan jeg også flytte hele mapper. La oss si jeg lager en mappe som heter Dirr. Så har jeg denne... dette filteret. Nå har jeg en mappe som heter DIR, som er tom. Og så har jeg en ny mappe her. Da kan jeg flytte hele min nymappe. Og sånn. Jeg flytter ny mappe til DIR. Hvis jeg lisser nå, så ser vi nymappen der borte. Og den har blitt lagt ned i DIR. Og det er noen mapper som er spesielle. Vi har vel kanskje sett på de fleste. Hvis man lister med LA, så ser man for det første at det er mappen du står i. Det kan man bruke for å kopiere noe til mappen jeg står i. Skal vi se... La oss si hvis jeg lister nå det som er i mappen over. Så sier jeg at der ligger script.shell. Mens her ligger ingen til. Ok, nå ønsker jeg å kopiere script.shell, som ligger i mappen over. Da gjør jeg det sånn. cp... script.shell... og så hit. Prikk betyr da denne mappen som jeg står i nå. Og dermed, utover den kommandoen, har jeg fått en kopi av script.shell i mappen jeg står i. Mens i mappen over så ligger fortsatt originalen.", "source": "lecture"}
{"lecture_id": "linux1del8", "chunk_id": "linux1del8_0004", "start": 586.68, "end": 719.16, "token_count": 425, "text": "Skal vi se... La oss si hvis jeg lister nå det som er i mappen over. Så sier jeg at der ligger script.shell. Mens her ligger ingen til. Ok, nå ønsker jeg å kopiere script.shell, som ligger i mappen over. Da gjør jeg det sånn. cp... script.shell... og så hit. Prikk betyr da denne mappen som jeg står i nå. Og dermed, utover den kommandoen, har jeg fått en kopi av script.shell i mappen jeg står i. Mens i mappen over så ligger fortsatt originalen. Så kopien har da blitt flyttet hit. Og det er et eksempel på bruk av mappen. Vi ser vi har brukt prikk-prikk tidligere. Hvis jeg sier change directly til prikk-prikk, så går jeg ett hakk opp. Et annet tegn på en mappe er Tilde. Skriver Ekko Tilde, så vil de se at Tilde, det er faktisk hjemmemappen. Så det kan man bruke til å flytte seg til hjemmemappen. CD Tilde. Da kommer jeg øverst i hjemmemappen. Så kan jeg også... La oss si jeg kan gå ned mappe igjen. Så kan jeg også bruke det f.eks. ved å si... At jeg ønsker å kopiere det som ligger øverst i hjemmemappen. Der er det en fil på hei.tk. Den ønsker jeg å kopiere hit. Tilde betyr da hjemmemappen, og der ligger hei.tk, som vi kan se her oppe. Prikk. Det er mappen jeg står i, og dermed så gjør den kommandoen at jeg kopierer hei.tk øverst i hjemmemappen ned hit jeg står. Så nå har jeg fått en kopi av Heidot-tekstet her.", "source": "lecture"}
