{"lecture_id": "linux4del1", "chunk_id": "linux4del1_0000", "start": 0.0, "end": 168.64, "token_count": 598, "text": "Vi skal se noe litt mer systematisk på vertsskripting, eller skjellprogrammering. Og vi kan lage mange forskjellige typer skript. Sånn som vi allerede har gjort, så kan ny skript lage nye kommandoer. Så er det vanlig å lage oppstartsprogrammer, programmer som gjør systemarbeid, og som setter opp ting og får systemet til å... Og virke som det skal. Så kan vi lage installasjonsprogrammer som installerer andre programmer. Så er det også vanlig å lage demons. Såkalte demons. Så det er prosesser som alltid står og går i bakgrunnen og utfører en eller annen tjeneste. Hvis vi setter inn et program... Mitt prog. Et script. Men sånn og bak her, så vil det stå og kjøre i bakgrunnen. Stort sett vil den faktisk også fortsette å kjøre etter at den har logget ut, sånn som andre systemprosesser. Men det er ikke helt riktig, spesielt hvis det skriver noe til output, til fil eller til skjerm, så kan man risikere at det stopper. Det skal vi se på senere, bl.a. så kan man bruke screen for å beholde en prosess. Når du skriver et skript, så er det viktig å ikke skrive hele skriptet med en gang. Prøv å begynne med et lite skjelett, og så test typisk ut i kommandoen først. Få de kommandoene du skal kjøre til, og virke. Og så putter du det inn i skriptet bit for bit. Og så utvider du med en detalj i gangen og tester for hver gang. Det kan også være smart å bare ta copy og paste ut i kommandovinduet når du skal teste. Dette er litt forskjellig fra andre programmer, nettopp fordi syntaksen i et chellscript er litt kryptisk. Og det er veldig mange småfeil som kan oppstå, så test hele veien. Ellers så er det et par tips til debugging. Hvis man kjører mitt script med på denne måten, Med bæsj minus X så vil det vises hvert step i skriptet når det kjøres. Altså det vil vise hva som skjer. Og det kan være veldig nyttig hvis det er en feil, for da kan du se... Oi, her. Denne variabelen ble ikke tatt inn, så derfor ble det feil.", "source": "lecture"}
{"lecture_id": "linux4del1", "chunk_id": "linux4del1_0001", "start": 136.98, "end": 194.98, "token_count": 221, "text": "Og det er veldig mange småfeil som kan oppstå, så test hele veien. Ellers så er det et par tips til debugging. Hvis man kjører mitt script med på denne måten, Med bæsj minus X så vil det vises hvert step i skriptet når det kjøres. Altså det vil vise hva som skjer. Og det kan være veldig nyttig hvis det er en feil, for da kan du se... Oi, her. Denne variabelen ble ikke tatt inn, så derfor ble det feil. Eller så er den gamle, gode måten å legge inn noen ekkord, har nå kommet hit. Det går an å legge inn når du skal finne feil. Så igjen, ta én bit av gangen og fullfør det, og så legger du på neste bit. Ikke skriv masse kode og så begynne å kjøre. Da blir det mye feilsøkel.", "source": "lecture"}
