{"lecture_id": "linux7del9", "chunk_id": "linux7del9_0000", "start": 0.0, "end": 249.96, "token_count": 595, "text": "Sånn. Jeg startet med å kjøre Docker Container and Hello World. Men da kan jeg prøve å kjøre et helt OS. Hvis jeg skriver minus IT, i er for interaktivt. T er for at den skal sette opp en TTI eller en terminal. Noen av oppgavene senere kjører de alpine, som er en sånn mini... Liten Linux-installasjon. Jeg kan starte Ubuntu her, så vi er litt mer vant til det. Så må jeg starte et bæsjvindu også, for å kunne få kontakt med... Da er den ute på Lockerup og henter ned et Ubuntu-image. Uansett hva slags Linux-OS jeg har eller hvilken distribusjon jeg har lokalt, så vil det imaget sørge for at dette ser helt ut som Ubuntu på alle måter. Så har jeg fått opp et... Her har jeg fått opp et prompt som... Som Ruth. Jeg er Ruth. Det pleier man å være i de imagene. Nå ser vi at vi har et fullt filsystem her. Og dette ser ut som en... Eller, det er en... I praksis så er dette en Ubuntu-installasjon. Jeg prøver en liste prosesser, så ser vi at det er veldig lite prosesser som kjører. Det er en av de tingene som er gjort med dokkecontainere, at man skiller det helt fra resten av apparativsystemet. Så det eneste vi ser i dokkecontaineren, er de prosessene som vi kjører selv. Så kan vi som med andre... Som med andre containere... Nei, med andre servere. Så kan man logge ut. Enten med kontroll D eller med exit. Den store forskjellen nå, hvis jeg kjører exit her, så er faktisk hele den containeren som jeg startet opp og kjørte, lukket ned. Sånn generelt så kan jeg kjøre dokkecontainer-PS. Da viser jeg alle konteinere som kjører. Nå er det ingen konteinere som kjører. Men hvis jeg legger på AS... Ja, jeg ser det blir... Jeg har et veldig stort vindu for å få med alt, så da er det kanskje vanskelig for dere. Vanskelig for dere å se. Klarer du å se dette? Det er helt på grensen om det går. Poenget er at dette er en listing av alle de tre konteinerne som jeg har startet. Ingen av de kjører. Status er... exited. Hovedpoenget er når du starter og kjører en konteiner...", "source": "lecture"}
{"lecture_id": "linux7del9", "chunk_id": "linux7del9_0001", "start": 195.58, "end": 305.0, "token_count": 264, "text": "Men hvis jeg legger på AS... Ja, jeg ser det blir... Jeg har et veldig stort vindu for å få med alt, så da er det kanskje vanskelig for dere. Vanskelig for dere å se. Klarer du å se dette? Det er helt på grensen om det går. Poenget er at dette er en listing av alle de tre konteinerne som jeg har startet. Ingen av de kjører. Status er... exited. Hovedpoenget er når du starter og kjører en konteiner... Da stopper den igjen etterpå. Så fjerner du hele konteineren. Jeg kan prøve å starte på nytt. Nå gikk det mye fortere. Den kommandoen her startet og stoppet... en hel server, kan du si. Med fysisk server tar det mange minutter. Med en VM tar det fort iallfall et halvt minutt. Men med... ja, jeg ser... jeg ikke timer. Jeg tenkte å prøve å ta tiden på denne her. Med dere så går det veldig fort. Jeg ser det... Det startes opp på under fem sekunder.", "source": "lecture"}
