{"lecture_id": "linux6del7", "chunk_id": "linux6del7_0000", "start": 0.0, "end": 192.28, "token_count": 590, "text": "Skal nå se på screen, som er veldig nyttig å bruke når man jobber i et Linux-skjell. Screen er en kommando som setter i gang et skjell som vil stå i bakgrunnen og kjøre, selv etter at man har logget ut. Sånn at man kan logge ut og komme tilbake og gå inn og se på det man har gjort, og fortsette arbeidet der. Det er ikke screen installert på Linux-øvende, men da kan man installere det med apt-get... App-install kan man gjøre. Og så screen. Så... Ut passordet, så får man installert screen. Man kan starte screen ved å bare taste ordet screen på denne måten her. Da kommer det opp en gnuscreen, og så står det 'press space'... ... eller'return to end'. Da ser det ikke ut som det har skjedd så veldig mye her. Men egentlig så har vi nå startet opp et nytt skjell akkurat der vi var tidligere. Hvis jeg tar PS, så ser jeg heller ikke noe. Men jeg kan gjøre en screen minus LS. Den viser at det er en screen her nå, og den er attached. Og jeg er faktisk inni den screenen. For å vise at jeg er i screenen, så har jeg lagd et lite skript, loop.shell. Og det eneste dette skriptet gjør, er å stå og loope wild true. Så får den en løkke, øker en arabermenn og skriver ut. Og så sover den i to sekunder. Så hvis jeg nå starter loop her inni denne screenen, så vil du se at den står og teller. Og for å gå ut av en screen så må man da gjøre en spesiell tastekombinasjon, og det er kontroll AD. Man holder da kontroll inne og taster så A. Først A. Og så det. Og da ser vi... Nå står det... Det er den forrige kommandoen jeg gjorde her ute. Og så står det nå melding... Og det er den screenen som jeg nå har. Så hvis jeg nå gjør screen minus LS, så vil jeg se... Jo, her er det en screen som står og kjører. Og hvis jeg skal koble meg til den screenen, så bruker jeg minus R og så navnet på screenen. Her holder det med OUS 100. Dette er liksom det hele navnet. Nei, det holder ikke. Vi må starte med starten.", "source": "lecture"}
{"lecture_id": "linux6del7", "chunk_id": "linux6del7_0001", "start": 155.68, "end": 335.08, "token_count": 588, "text": "Det er den forrige kommandoen jeg gjorde her ute. Og så står det nå melding... Og det er den screenen som jeg nå har. Så hvis jeg nå gjør screen minus LS, så vil jeg se... Jo, her er det en screen som står og kjører. Og hvis jeg skal koble meg til den screenen, så bruker jeg minus R og så navnet på screenen. Her holder det med OUS 100. Dette er liksom det hele navnet. Nei, det holder ikke. Vi må starte med starten. Jeg kan koble fra til og med den starten på navnet. Nå kommer jeg inn i screenen igjen, og her ser vi at loopen har fortsatt å gå etter at jeg kom inn. Så kan jeg gå ut igjen med ctrl-al-a og d. Så kan jeg f.eks. prøve å lage en ny screen. Så denne kan jeg kalle noe med opsjon minus s. F.eks. kan jeg kalle denne screen loop. Og det jeg har gjort nå, er at nå har jeg startet enda en ny screen. Og screen minus LS vil si at den har en id, men den har også navnet loop. Og så kan jeg velge mellom etterpå hvilken screen jeg vil inn i. Inni loop her kan jeg starte en ny loop, og så kan jeg gå ut. Kontroll AD. Og så kan vi se... OK, nå har jeg to screens her. Men den jeg ønsker å koble meg til, det er loop. Og på den måten så kommer jeg inn i loopet, og da ser vi at den har gått relativt kort. andre jeg kan gå inn, Det er den her, som jeg ikke eksplisitt ga noe navn, men jeg kan bruke hele det navnet. Og den ser vi har kommet mye lenger. Og på den måten så kan jeg gå inn og ut av screen. Noe som også er veldig nyttig, er at hvis jeg nå logger helt ut, så når jeg er tilbake på Studio SOS og så går inn igjen, så vil begge disse screenene... Den vil fortsatt stå der. Og hvis jeg nå logger inn på loop igjen, så ser vi at den står der fortsatt og går. Så kan jeg gå ut med kontroll A, kontroll D. Ellers kan du se på hvordan du kan stoppe en screen. Hvis jeg nå går inn i screen loop igjen, og den står og går... Så hvis jeg i stedet taster kontroll A, kontroll D...", "source": "lecture"}
{"lecture_id": "linux6del7", "chunk_id": "linux6del7_0002", "start": 289.2, "end": 466.6, "token_count": 547, "text": "Noe som også er veldig nyttig, er at hvis jeg nå logger helt ut, så når jeg er tilbake på Studio SOS og så går inn igjen, så vil begge disse screenene... Den vil fortsatt stå der. Og hvis jeg nå logger inn på loop igjen, så ser vi at den står der fortsatt og går. Så kan jeg gå ut med kontroll A, kontroll D. Ellers kan du se på hvordan du kan stoppe en screen. Hvis jeg nå går inn i screen loop igjen, og den står og går... Så hvis jeg i stedet taster kontroll A, kontroll D... Bare taster kontroll D, så tilsvarer det exit. Og da vil hele screen bli stoppet. Så når screenen minus 100, så ser vi at den loop-screenen er borte. Fortsatt så har vi den 29-screenen. Hvis det bare er én screen, den er entydig, så ser vi nå. Det har gått kjempelenge og godt. En annen ting som ikke er så lett, det er å scrolle opp og ned. Da er det igjen en spesiell tastekombinasjon, Control A, Escape. Da får man en modus hvor man kan gå med piltassene opp og se hva som har skjedd tidligere. Opp og ned igjen. Hvis man da taster Escape igjen... Så ser vi den copy mode abortet, og da... Da er det som vanlig å gjenta forrige kommandoer når man bruker pilltaster. Men altså... Kontroll A. Kontroll A og Escape. Den gjør at du kan scrolle opp og ned på den måten. Så Escape igjen. Da kommer man tilbake. Det hender man ikke husker om man er i en screen eller ikke. Det kan man sjekke ved en spesiell arabel, SDI. Hvis den gir en verdi, sånn som her, så betyr det at da er man i en screen. Hvis jeg nå går ut med kontroll og kontroll D, og så lister screens, så ser vi... OK, det var den jeg var i. Og her ute så vil ekkoet... Dollar SY vil da ikke gi noen ting. Men hvis jeg går inn i screenen, så ser vi at jeg da gir... Echo SY gir da en verdi. Mens ute gir det ingenting.", "source": "lecture"}
