{"lecture_id": "linux8", "chunk_id": "linux8_0000", "start": 0.0, "end": 289.82, "token_count": 589, "text": "Ja, hallo, alle sammen. Da skal jeg først teste om dere hører meg i dag. Så da får dere forhåpentligvis opp en liten pollen òg. Ja, jeg ser det er fire stykker som ikke hører meg. I chatten hører dere ingen lyd. Dere som ikke hører... Sånt generelt så kan jeg foreslå å prøve å gå ut og inn igjen. Det kan man generelt prøve. Men da ser det ut som de fleste hører meg. Ja... Jeg bare tester. Nå deler jeg poler over 17. Kanskje vi kan få til noen flere poller med spørsmål underveis. OK. Ja, som dere ser, bruker Zoom i dag. Så det er nok et verktøy for meg også. Jeg bruker Zoom fordi det var litt problemer med konferanser sist. Lyden fattet blant annet. Men... ja. Vi kan starte med... Skal jeg bare teste at dere får opp... vinduet mitt her? Ja. Så er det fint generelt om dere skriver i chatten og spør underveis. Som dere ser, det vi skal holde på med i dag, er dok... Vi skal fortsette med dokker, og vi skal spesielt se på dokkefiles. Forrige gang så vi på hvordan vi kunne bruke dokker til å sette opp systemer. Vi satte opp webservere, blant annet. Og så på hvordan vi kunne kjøre dem. Det vi gjorde da, var at vi til en stor grad startet opp et image. Altså et blankt image, sånn som en ubuntu-installasjon. Da får man opp et helt ubuntu operativsystem. Men så gikk vi inn på det operativsystemet, sånn som vi er vant til fra VM-er og fysiske maskiner. Og konfigurerte det, installerte Apache osv. Det går an å sette opp ting på den måten, men det som er mer effektivt, eller iallfall er lettere å automatisere, det er å sette opp systemet ved hjelp av en fil, en såkalt dokkerfil. Og når man gjør det, så kan man sette opp all konfigurasjonen og alt man trenger. Og så bygger man et image ut fra det. Da kan denne dokkefilen definere hele systemet og kan lett deles med andre. Som da kan bygge det for å få sitt eget image. Det er da et alternativ til å dele et helt image. Det kan man også gjøre.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0001", "start": 253.1, "end": 473.78, "token_count": 599, "text": "eller iallfall er lettere å automatisere, det er å sette opp systemet ved hjelp av en fil, en såkalt dokkerfil. Og når man gjør det, så kan man sette opp all konfigurasjonen og alt man trenger. Og så bygger man et image ut fra det. Da kan denne dokkefilen definere hele systemet og kan lett deles med andre. Som da kan bygge det for å få sitt eget image. Det er da et alternativ til å dele et helt image. Det kan man også gjøre. Man kan gå inn på dokkecontaineren, konfigurere akkurat som man ønsker. Så kan man dele et image med andre. Vi skal se på det også. Hvis vi får tidligere i dag, kan vi prøve å legge inn et image på Dokkerhub. Men det kommer vi tilbake til. Så det er også noen oppgaver denne uken. Vi kan ta en rask kikk. De fleste av oppgavene går på scheduling og det vi holdt på med på... En del av disse spørsmålene blir forhåpentligvis lettere hvis dere har sett simuleringen hvor jeg lager vaffelrøre og foreleser samtidig. Hovedideen med det var at dere skulle få helt konkrete begreper av hvordan schedulering foregår. Så det er en del spørsmål rundt dette. Oppgaver rundt dokker og dokkefeil. Men det er én oppgave. Så hvis dere får til den, så bør dere være fornøyd med dagen. Hvis dere har høyere ambisjoner, så bør dere få med dere ukens utfordring. Som igjen går ut på å sette opp ni containere, men denne gangen med dokkerfeil.  OK. Da er planen at vi går gjennom flere slides fra Mike Long. Som vi fortsetter med de slidene vi hadde forrige gang. Jeg skal vise et par slider om hvorfor vi bruker dokker. Det var et veldig godt spørsmål sist om eksempler på dokkebruk. Og egentlig hvorfor man trenger å vite om dette. Da skal jeg prøve å dele en annen... et annet vindu. Skal vi se. Sånn. Da ser dere forhåpentligvis... Et par slider. Hvorfor dere? Jo, for det første så gjør det det enkelt å sette opp og kopiere et helt driftsmiljø. Man kan da, hvis man har en applikasjon som man skal utvikle, så...", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0002", "start": 419.84, "end": 615.98, "token_count": 587, "text": "Jeg skal vise et par slider om hvorfor vi bruker dokker. Det var et veldig godt spørsmål sist om eksempler på dokkebruk. Og egentlig hvorfor man trenger å vite om dette. Da skal jeg prøve å dele en annen... et annet vindu. Skal vi se. Sånn. Da ser dere forhåpentligvis... Et par slider. Hvorfor dere? Jo, for det første så gjør det det enkelt å sette opp og kopiere et helt driftsmiljø. Man kan da, hvis man har en applikasjon som man skal utvikle, så... Så kan man sette opp hele det miljøet med nøyaktig riktige versjoner av kompulator, bibliotek osv. Og så kan man sikre... Altså, den som skriver koden, kan da enkelt teste ut koden, at den virker som den skal, i en kopi av det miljøet som faktisk skal kjøre koden. Man kan ikke teste i produksjon direkte. For da kan du risikere å stoppe hele produksjonsmiljøet. Men samtidig er det veldig ofte problemer med at når en utvikler testekoden sin, så kjøres den i et miljø som ikke er helt lik driftsmiljøet. Og da blir det mye vanskeligere å teste, og det blir en mye større prosess å komme inn til kode. Vi har ikke sett så mye på dem, men vi skal se litt mer på det kanskje allerede neste uke. Virtuelle maskiner og VM-er. Men dere har jo fått virtuelle maskiner som dere kjører, Linux-VM-er. Og mange av dere har også installert Windows-VM-er med version-boks. Det er på en måte... En annen måte å sette opp et helt stort miljø, som kan være nøyaktig likt driftsmiljø. Men dette krever mye ressurser, for da må du ha for hver maskin så må du ha hele operativsystemet. Og det er veldig omfattende. Det er digert i forhold til containere. Containere er små og raske å starte og stoppe. At hvis du kjører ti Ubuntu-konteinere på én maskin, sånn som oppgaven denne og forrige uke går ut på, så bruker alle de ti konteinerne det samme underliggende operativsystemet.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0003", "start": 571.5, "end": 779.72, "token_count": 587, "text": "driftsmiljø. Men dette krever mye ressurser, for da må du ha for hver maskin så må du ha hele operativsystemet. Og det er veldig omfattende. Det er digert i forhold til containere. Containere er små og raske å starte og stoppe. At hvis du kjører ti Ubuntu-konteinere på én maskin, sånn som oppgaven denne og forrige uke går ut på, så bruker alle de ti konteinerne det samme underliggende operativsystemet. Da sparer man masse ressurser i forhold til om man skulle kjøre ti virtuelle maskiner. Det krever veldig mye mer ressurser i form av både minne og... spesielt minne. En av de viktigste grunnene til at dokker har blitt så populært og så mye brukt, er at det er en viktig del av continuous delivery og continuous development. Historisk så var det sånn at for ca. 20 år siden, rundt år 2000, så ble alt driftet på fysiske servere. Da hadde man serverrom hvor fysiske servere hadde applikasjoner som så kjørte. Da kunne det være både webservere og databaser på samme fysiske server. Men felles for alle var at det var veldig... Hvis man skulle oppgradere eller vedlikeholde, så var det en stor prosess. Typisk så kom man med oppdateringer en gang i halvåret, maks en gang i måneden. Kanskje noen kom en gang i året med oppdateringer av applikasjoner. Fordi det var en stor prosess å sette det opp og teste osv. Og gjøre reelle tester av programmene. Men så kom... Så har det på en måte kommet en revolusjon med DevOps, som er et tettere samarbeid mellom Development Operations. Altså mellom de som utvikler og de som drifter programmene våre. For 20 år siden var det sånn at de var to helt atskilte... Programmererne var fornøyd når de hadde fått ferdig koden, og så sendte den til drift som så skulle drifte. Men det førte med seg en enorm rekke med problemer når man deployer, setter i gang nye systemer og skal kjøre det. Og dermed så kom det et nytt mantra, som var på at man skulle kunne committe kode. Ti ganger om dagen var liksom det første målet som man hadde.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0004", "start": 738.78, "end": 953.58, "token_count": 594, "text": "For 20 år siden var det sånn at de var to helt atskilte... Programmererne var fornøyd når de hadde fått ferdig koden, og så sendte den til drift som så skulle drifte. Men det førte med seg en enorm rekke med problemer når man deployer, setter i gang nye systemer og skal kjøre det. Og dermed så kom det et nytt mantra, som var på at man skulle kunne committe kode. Ti ganger om dagen var liksom det første målet som man hadde. For 20 år siden var det nærmest utenkelig, men i dag så er dette hverdagen i veldig mange bedrifter, og spesielt store, moderne bedrifter som Google, Facebook osv. De bruker dette hele tiden. At hver gang en utvikler, lager noe nytt, Så blir det automatisk testet i driftsmiljø. Men da er det en kopi av driftsmiljøet. Så er det en lang kjede. KUA er også en del av det, Quality Assurance. Alt foregår automatisk. Og da er dokker, eller containere, en veldig viktig del av det. Hele det løpet med å levere kode kontinuerlig. Noe annet som er vanlig, eller som også er en del av dette, det er å sette opp store, komplekse systemer med Kubernetis. Og Kubernetis er en måte å orkestrere, eller da sette opp komplekse systemer ved hjelp av dokker og containere. I en cubernetis kalles det pods. Det er et system av én eller flere dokkecontainere som kjører innen samme miljø. Og dette ble også mye brukt, eller nærmest eksplodert, i bruk av containere, og spesielt cubernetis. Et eksempel på dette, som jeg nevnte sist, er finn.no. Og neste slide er hentet fra en bloggpost fra en som jobber i Finn. Og vi ser at det er et ganske komplekst system som de har i Finn. De bruker en rekke forskjellige verktøy. Og vi ser nederst her infrastrukturen, hvor de bruker både Cloud, men også... Men det som er kjernen i det hele, som vi ser her, er container runtime. Så utviklerne som sitter her oppe og bruker alle disse verktøyene. Den typiske strømmen er at de committer til GitHub, og så både testes og kjøres konen deres i dockercontainere.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0005", "start": 903.1, "end": 1153.3, "token_count": 600, "text": "Og vi ser at det er et ganske komplekst system som de har i Finn. De bruker en rekke forskjellige verktøy. Og vi ser nederst her infrastrukturen, hvor de bruker både Cloud, men også... Men det som er kjernen i det hele, som vi ser her, er container runtime. Så utviklerne som sitter her oppe og bruker alle disse verktøyene. Den typiske strømmen er at de committer til GitHub, og så både testes og kjøres konen deres i dockercontainere. Alt dette her er da typisk orkestrert med Kybernetis. Så... Allerede i dag så er det ganske vanlig å komme ut i bedrifter som bruker dere, og det kommer helt sikkert til å øke kontinuerlig. Så det var den lange forklaringen på hvorfor vi snakker om dere. Men der... Det er generelt fornuftig å stille den type spørsmål. Hvorfor holder vi på med akkurat det vi gjør? OK. Da skal vi bli mer konkrete og gå inn og se på dokker. Og da vil jeg... Ja, jeg vil gå inn i et dokkervindu. Og så fortsette litt der vi slapp forrige gang. Skal vi se... Da skal jeg i stedet dele... dette vinduet. Oi. Sorry. Det var litt... litt trøbbel der. Jeg prøver en gang til. Sånn. Da ser dere forhåpentligvis... Et vindu med... i OS70 Linux-V. Det er fint hvis dere har problemer med å se vinduet eller et eller annet faller ut, at dere sier det ifra i chatten. Så har jeg et øye på chatten, så kan dere si fra der. Det går også an å... Det er helt OK hvis dere har spørsmål, å bare koble på lyd. Så kan dere stille spørsmål direkte. Det er bare hyggelig hvis dere gjør det. Jeg tror til og med det er et opplegg hvor man kan rekke opp hånden. Jeg er ikke helt sikker på om jeg får til å se det, men jeg prøver. Uansett, still veldig gjerne spørsmål i poden... Nei, i poden. I chatten. OK! Som dere ser her, så startet jeg med å liste konteinerne som står og kjører. Og i dag så skal vi jobbe litt med å sette opp den type konteinere. Men da ved hjelp av en dockerfile.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0006", "start": 1115.52, "end": 1307.78, "token_count": 587, "text": "Jeg tror til og med det er et opplegg hvor man kan rekke opp hånden. Jeg er ikke helt sikker på om jeg får til å se det, men jeg prøver. Uansett, still veldig gjerne spørsmål i poden... Nei, i poden. I chatten. OK! Som dere ser her, så startet jeg med å liste konteinerne som står og kjører. Og i dag så skal vi jobbe litt med å sette opp den type konteinere. Men da ved hjelp av en dockerfile. I stedet for å konfigurere dockercontaineren direkte. Men jeg tenkte vi skulle... Starter med å repetere litt fra forrige gang. For dere som er godt inn i det, så må dere gjerne fortsette med å gjøre oppgaver i den github-dokker-repositorien som vi holdt på med sist, hvor vi... Oppgavene i forrige uke var hentet derfra. Så planen er å fortsette med... Og fortsette å gjøre oppgaver i dockergithub-oppgavene. Så de som har kommet litt lenger, kan gjerne bare fortsette med det. Eventuelt starte med den obligatoriske oppgaven. Jeg kommer til å ta det ganske rolig, og så kommer jeg til å mer eller mindre prøve å løse i hvert fall noen av de oppgavene som er gitt. OK. Som dere ser så er det... her har jeg mange containere som faktisk er oppe og kjører. Jeg har seks containere som står og kjører. Men det viser seg at det tar ikke så veldig mye ressurser. Hvis jeg kjører topp her nå, så... Jeg har riktignok brukt alt av det, men CPU, f.eks., er ikke så mye i bruk. Vi kan også se på... Vi ser det er en del overlay som er i dokkerinstansene. Men hvis vi ser på den minnebruken, så tar imagene litt plass. Men ikke så voldsomt. Men det som er fint, er at... Når jeg har seks konteinere som kjører her, så er det seks fullverdige operativsystemer. I det tilfellet så kjører de webservere. Så det er fullverdige systemer, men de bruker veldig lite diskplass. Og relativt lite minne også. Det hadde ikke vært mulig å kjøre seks sånne VM-er på denne VM-en her.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0007", "start": 1268.38, "end": 1492.26, "token_count": 600, "text": "Men hvis vi ser på den minnebruken, så tar imagene litt plass. Men ikke så voldsomt. Men det som er fint, er at... Når jeg har seks konteinere som kjører her, så er det seks fullverdige operativsystemer. I det tilfellet så kjører de webservere. Så det er fullverdige systemer, men de bruker veldig lite diskplass. Og relativt lite minne også. Det hadde ikke vært mulig å kjøre seks sånne VM-er på denne VM-en her. Og vi sier også kjøre VM på VM, men det går faktisk an. Man kan også kjøre VM-er inne i VM-er. Det er klart, det går med en gang litt saktere. Men det er generelt hardway-støtte for å gjøre akkurat det. Ja. Det jeg tenkte å gjøre først, var å se på hvordan man kan rydde opp i alt dette. Men hvis jeg tar PC-A, så ser vi at da har jeg enda flere... Det er også da konteinere som er stoppet. Så generelt så så vi sist på noen metoder for å stoppe... Ikke for å stoppe, men for å fjerne konteinere som ikke kjører. Blant annet Docker Prune kan man bruke. Denne uken er det en oppgave som går ut på å lage et script som sletter alt som er av containere som kjører og som ikke kjører. Jeg kan vise en teknikk som vi bruker for å få til det. Hvis jeg tar tokke container... Hvis jeg tar minus Q for quiet, så ser vi at jeg får ut bare ID-en. Dette kan jeg bruke i et skript eller fra kommandolinje til å stoppe enkeltkonteinere. Hvis jeg eksplisitt skal stoppe en konteiner, la oss si jeg stopper den øverste her. Og så... sånn. Så stoppes containeren. Hvis vi ser lister nå, så ser vi at vi har fått én container mindre. Hvis vi har masse containere, så kan det være greit å skripte dette. En måte man kan gjøre det på, er da rett og slett å skrive forløket. Inn... for konteiner i... Og så kan jeg ta... Og så faktisk gjøre den kommandoen der, for den gir oss da hver idé. Så nå kan jeg for hver konteiner... Så kan jeg du... Og så kan jeg stoppe. Dere konteiner, stopp. Og da dollar del.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0008", "start": 1442.92, "end": 1680.78, "token_count": 589, "text": "Hvis vi ser lister nå, så ser vi at vi har fått én container mindre. Hvis vi har masse containere, så kan det være greit å skripte dette. En måte man kan gjøre det på, er da rett og slett å skrive forløket. Inn... for konteiner i... Og så kan jeg ta... Og så faktisk gjøre den kommandoen der, for den gir oss da hver idé. Så nå kan jeg for hver konteiner... Så kan jeg du... Og så kan jeg stoppe. Dere konteiner, stopp. Og da dollar del. Ops. Her gjorde jeg tydeligvis en feil. Ja, jeg tipper den feilen jeg gjorde, var... Nei. Noen gode forslag i chatten på... Ja, hva gjorde jeg feil? Jeg skal jeg få se. Og så skrev jeg dollar d her. Så da var det ikke så klart det ikke gikk. Så da kan man gjøre et nytt forsøk. Stopp container. Får se inn dokkekonteineren. Stopp konteiner. Da ser det litt bedre ut, men det tar litt tid til å stoppe. Her ser vi den første av de stopper. Så stopper etter hvert de andre. Så dette er første del av skriptet. Så kan man stoppe alle containere og sånn. Og når alle er stoppet, da er det enklere å slette alle. Da kan man... Ja, jeg tror en dokker system prune. Den vil stoppe alle containere som ikke kjører. Så vi kan teste ut det. Det tok litt lengre tid enn jeg hadde trodd å stoppe alle. Men da skulle det i hvert fall ikke være noen som kjører.  Men hvis det er LS minus A, så vil fortsatt de som er exited, de vil fortsatt være der. Men det kan man... Da kan man bruke en dokker system. Prune, legger på en minus A, F... Der får alle og force. Da får man ikke noe spørsmål engang. Da ble det slettet en masse. Det kan vi også se... Det var ikke så mye space som ble spart, men en god del. En halv gigabyte hjelper jo. Så hvis jeg lister nå, så vil jeg se jeg har ingen containere. Men det er fortsatt her. Det er... Nei. Det fjerner faktisk også alle image. Ja... OK. Da fikk jeg faktisk... Ja, jeg tror det var den som gjorde at alt ble slettet, var...", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0009", "start": 1632.08, "end": 1861.14, "token_count": 599, "text": "Da får man ikke noe spørsmål engang. Da ble det slettet en masse. Det kan vi også se... Det var ikke så mye space som ble spart, men en god del. En halv gigabyte hjelper jo. Så hvis jeg lister nå, så vil jeg se jeg har ingen containere. Men det er fortsatt her. Det er... Nei. Det fjerner faktisk også alle image. Ja... OK. Da fikk jeg faktisk... Ja, jeg tror det var den som gjorde at alt ble slettet, var... Minus A der... Eller så kan man gjøre tilsvarende hvis man eksplisitt bare vil... fjerne image. Så... så kan man kjøre den kommandoen. Men nå ser vi alt er rensket opp. Hvis jeg nå ser på disk, DF viser diskbruk. Så ser vi at... ja. Det er ikke enormt mye jeg har fått til, men nå har jeg 1,6 giga. Det var noe sånn 0,7 giga eller noe sånt som ble brukt. OK. Det var litt om å renske opp. Bak dokker og dokkerfiler. Ja, nå så jeg at jeg fikk... Et spørsmål her. Jeg var like nederst i kjøtten, men nå ser jeg det. Ja, det er et godt spørsmål. Hva er forskjellen på image og container? Ja... Ett image er selve det imaget som... Som konteineren bygges fra. Eller som den starter fra. Så det er på en måte litt sånn som... Med en virtuell maskin så har du et disk-image som er den virtuelle maskinen.  Men når du starter opp dette imaget, så har du en instanse av imaget som kjører. Og det er en virtuell maskin. Det kaller du en VM. Tilsvarende er det for containere. Du har et image som du starter opp. Og da, med en gang du har startet det imaget, har et image som kjører, så er det en container. Det er kanskje ikke helt presist svar. Du kan jo liste konteinere. Og da... og da er på en måte det en konteiner... Når den er stoppet, så er den fortsatt en konteiner. Når du starter opp den igjen, så har du en konteiner. Men det er en instanse som er frosset ned på den. Så... jeg vet ikke om det var et fullgodt svar. Men jeg kan prøve å svare på det litt når vi gjør et nytt eksempel.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0010", "start": 1807.34, "end": 2069.72, "token_count": 593, "text": "så er det en container. Det er kanskje ikke helt presist svar. Du kan jo liste konteinere. Og da... og da er på en måte det en konteiner... Når den er stoppet, så er den fortsatt en konteiner. Når du starter opp den igjen, så har du en konteiner. Men det er en instanse som er frosset ned på den. Så... jeg vet ikke om det var et fullgodt svar. Men jeg kan prøve å svare på det litt når vi gjør et nytt eksempel. Spørsmålet er om det legges ut på Kanvas. Ja, det gjør det. Jo. Jeg tar opp sånn at... det går ikke an med Zoom å ta opp i skyen, men jeg har sett at jeg kan ta opp lokalt. Så jeg tar nå opp og lagrer. Jeg kan dobbeltsjekke om jeg har fått det til.  Ja... Vi ser... Her er det en mappe. Og her lagres da fortløpende... en video som jeg skal legge ut. Vi kan se... Et annet Linux-triks. Det eneste er å bruke watch. Hvis man tar watch på... Oi. Var kanskje ikke så godt triks. Skal vi bare se om den øker. Må kanskje gjøre sånn. Sånn, ja. Jo, da kan vi se fortløpende at den filen her... Den øker. Så kan jeg konvertere den til en videofil. Og så kommer jeg til å legge ut en iCam. OK. Tilbake til image... Så jeg finner riktig vindu. Image og hva forskjell på image og container. Generelt, container er da den kjørende enheten. Image er filen som inneholder... Vi kan starte en konteiner. Det er for å interaktive og tette y. Det er for å starte en terminal. Ønsker jeg å kjøre et bæsjvindu når den starter opp. Og da ser vi... Nå hentes det et image... Ikke fra github, men fra Dokker. Da ble det lastet ned, og så ser vi at nå fikk vi opp et prompt der. Det betyr at nå er jeg inne i dokker-imaget. Nå er dette en konteiner, for det er et image som er startet opp. En instanse har jeg nå fått opp. Jeg kan starte flere instanser av det samme imaget. Så hvis jeg tar PVD her, så vil du se at jeg er inni et Linux fyllesystem.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0011", "start": 2029.02, "end": 2315.66, "token_count": 594, "text": "Ikke fra github, men fra Dokker. Da ble det lastet ned, og så ser vi at nå fikk vi opp et prompt der. Det betyr at nå er jeg inne i dokker-imaget. Nå er dette en konteiner, for det er et image som er startet opp. En instanse har jeg nå fått opp. Jeg kan starte flere instanser av det samme imaget. Så hvis jeg tar PVD her, så vil du se at jeg er inni et Linux fyllesystem. Og se hva slags distribusjon det er. Og vi ser at dette er 1804. Og så så vi sist at... Hvordan er det hvis jeg tar Exit nå? Så vil... Vi kan prøve det. Sier vi Exit. Så vil konteineren stoppe. Hvis jeg nå tar dokkekonteiner PS... Så ser vi at vi har en... ingen container som kjører. Men PS-A, der vil jeg se at jeg har en container som det ble gjort exit på. For tolv sekunder siden. Men da er det mulig å starte den på nytt. Så da kan jeg si dokker container start. Så container ID. Så ser vi at da starter konteineren. Og der har vi en konteiner som kjører i syv sekunder. Eller som har kjørt i syv sekunder. Så vi ser... Konteineren er liksom selve instansen. Og imaget er det imaget som instansen er startet fra. Men nå er vi på en måte ute av konteineren igjen. Vi så også sist på hvordan vi kan koble oss til. Og det kan vi gjøre med... Det er et par måter å gjøre det på. Den beste måten er kanskje å bruke execute. For da kan man si at man ønsker å eksekutere på... I denne konteineren så ønsker jeg å kjøre bæsj. Så... Ops. Mulig det var en litt feil syntaks. Kanskje jeg ikke trenger IT her. Prøve å gi det her, da. Nei, da må jeg sjekke ut hvordan det var i brukt eksekutt. Skal jeg se om jeg har gjort det her før. Skal vi se... Dette her burde virke. Ja. Jeg lurer på hva jeg gjorde feil sist, men... skal vi se. Det var bare rekkefølgen på IT. Jeg måtte ha IT... må komme etter execut. Sånn, så da har jeg koblet meg inn i containeren igjen. Da kan jeg se.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0012", "start": 2225.98, "end": 2482.22, "token_count": 592, "text": "Prøve å gi det her, da. Nei, da må jeg sjekke ut hvordan det var i brukt eksekutt. Skal jeg se om jeg har gjort det her før. Skal vi se... Dette her burde virke. Ja. Jeg lurer på hva jeg gjorde feil sist, men... skal vi se. Det var bare rekkefølgen på IT. Jeg måtte ha IT... må komme etter execut. Sånn, så da har jeg koblet meg inn i containeren igjen. Da kan jeg se. Jeg ser til og med at jeg har historie, så jeg kan bla tilbake her. Så er det en annen måte å gå ut av containere på. Det er kontroll P, kontroll Q. Da kommer jeg ut. Og da vil jeg se at det fortsatt er siste termin PS. Så står den fortsatt der og kjører. OK. Da skal vi prøve. Vi skal begynne å se litt på det vi skal gjøre i dag. Først og fremst skal vi se på dokkefiles. Men før det så skal vi prøve å se litt på volumes. Og generelt hvordan man får dokkefilene... Nei, får konteinerne til å få volumes. Og koble seg opp mot det lokale filsystemet. For da kan man, hvis man kobler en dockerfil til det lokale filsystemet, så kan man da på en måte koble løs containeren. Sånn at den er en uavhengig enhet som raskt kan startes og stoppes. For hele tiden så ønsker man å ha containere uavhengige. De skal gjerne gjøre så lite som mulig. Typisk så kjører en container én prosess. F.eks. én webserver. Eller én applikasjon som skal testes og kjøres. Men vi vil gjerne kunne stoppe og starte den, og gjerne kaste den også. Bygge den på nytt uten at innholdet blir kastet. Så derfor skal vi nå begynne å se litt på volumer, og hvordan man kobler til eksterne filer til en dokkerinstans. Dokkerinstans er da det samme som en container. Så det er en annen måte å si container på. Da skal jeg... I stedet dele slidene til Mike Long, som vi så på sist. Vi ser vi har en ca. 20 slider til. Da skal vi se på volumer. Ja. Dukkevolum, det er da som jeg sa, det er en mappe eller en fil", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0013", "start": 2421.62, "end": 2638.96, "token_count": 583, "text": "Så derfor skal vi nå begynne å se litt på volumer, og hvordan man kobler til eksterne filer til en dokkerinstans. Dokkerinstans er da det samme som en container. Så det er en annen måte å si container på. Da skal jeg... I stedet dele slidene til Mike Long, som vi så på sist. Vi ser vi har en ca. 20 slider til. Da skal vi se på volumer. Ja. Dukkevolum, det er da som jeg sa, det er en mappe eller en fil som man bruker for å koble opp hva man vil. ... varige filer til en dokkerinstans, sånn at man kan... Sånn at den... Selv om man da dreper og til og med avslutter og fjerner en container, så kan man bruke de samme filene senere. Ved å bygge en ny container fra et nytt image og koble opp mot de samme filene. Så kan de også deles mellom containere. Det er et par-tre måter å gjøre dette på. Bind-mode kobler direkte... Det er som en link. Du kan ha en fil eller mappe i containeren som peker direkte på en mappe på filsystemet på hosen du kjører container. Da kan du endre på filene på hosen, og så endres det i containeren. Og foretrukket metode er volum. Og da... Et volum, det defineres av docker-demon. Så da er det på en måte dokker som står og styrer dette her. Og dette kan i større grad gjøre at containere kan dele data med hverandre også. Så dette er en litt mer abstrakt måte å styre filer på, som også da er styrt av docker-demon. At det er dokker som styrer dette. Så kan man altså montere direkte minne, og det kommer ikke vi til å se på. Da er det to måter... De to måtene vi skal se på, er bind-mounts. Det er da direkte å binde posen. Da har man... Når man starter en container... Så legger man på den opsjonen, minus V. Og slash house dir er da filsystemet her på hosen. I vårt tilfelle så er det på Linux V. Og så slash app. Det er da filsystemet i konteineren. Så det vi skal gjøre etterpå, er altså koble det til vår WWW hotml på konteineren.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0014", "start": 2594.04, "end": 2949.78, "token_count": 581, "text": "Da er det to måter... De to måtene vi skal se på, er bind-mounts. Det er da direkte å binde posen. Da har man... Når man starter en container... Så legger man på den opsjonen, minus V. Og slash house dir er da filsystemet her på hosen. I vårt tilfelle så er det på Linux V. Og så slash app. Det er da filsystemet i konteineren. Så det vi skal gjøre etterpå, er altså koble det til vår WWW hotml på konteineren. Koble det til et filsystem her, sånn at vi kan endre innholdet på. Webserveren mens den kjører. Dette gjør det samme med et volum, men da må vi først i docker kreere et volum med docker volume crates, og så navnet på volumet. Men det er fortsatt litt tilsvarende. Den vil da i praksis ligge på i fyllsystemet her, men den kan da styres av. Vi skal straks ta en pause, men vi ser her... Hvis dere har lyst til å prøve på dette i pausen, så kan dere gå til disse slidene. Og starte å gjøre oppgaver. Før vi tar pause... Unngå direktører fra verten i produksjonen. Dette er hvordan det er brukt i Kates. K8S er da en forkortelse for Kubernetes. Men det vi skal se på i dag, er hvordan vi faktisk monterer pilsystemer fra Hosen inn i containeren. Så vil man se at man får en error. Man må da legge på en null foran, så kommer man til riktig sted. Ja, sorry. Nå så ikke dere hva jeg holdt på med. Men hvis du klikker her, så kommer du til for using volumes. Så må du legge på en null foran sekstallet for å komme til pilen. Ellers kan det gå dit fra oppgavetekst. Men da tar vi et kvarters pause. 15 min pause. Tenk gjerne ut spørsmål, og still spørsmål i pausen. ... og det er veldig vanskelig å forstå hva som skjer. Og det er veldig fint å se hvordan folk oppfører seg på skolen. Det er veldig vanskelig å forstå hva som er sant og hva som er sant. Det er veldig vanskelig å forstå hva som skjer under en slik situasjon. Ja, da er jeg tilbake igjen, så nå starter vi.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0015", "start": 2800.98, "end": 3180.84, "token_count": 581, "text": "15 min pause. Tenk gjerne ut spørsmål, og still spørsmål i pausen. ... og det er veldig vanskelig å forstå hva som skjer. Og det er veldig fint å se hvordan folk oppfører seg på skolen. Det er veldig vanskelig å forstå hva som er sant og hva som er sant. Det er veldig vanskelig å forstå hva som skjer under en slik situasjon. Ja, da er jeg tilbake igjen, så nå starter vi. Kom gjerne med spørsmål i chatten hvis det er noen som har spørsmål hos Stopp også. Det går også an å koble opp med lyd og stille spørsmål. OK. Da... Hvor var vi? Jo, vi skulle begynne å se på volumer. Eller det vil si, vi skulle prøve å koble til volumer. Jeg tror jeg kan begynne å teste... gjøre noen eksempler. Ikke nødvendigvis gjøre akkurat som i den gjennomgangen som ligger på Github. Men vi kan prøve å lage en webserver. Ja. Det er spørsmål om det blir noen endring på eksamen i år med tanke på koronautbruddet. Det blir det. Og vi har ikke helt... Jeg vet ikke hvordan det blir til slutt. Men det blir nok vanskelig å gjennomføre en tradisjonell eksamen selv i Inspera. Men jeg vet foreløpig ikke. En mulighet som jeg kunne tenke meg, var rett og slett å ha en Inspera. Men som er helt åpent. Hvor det da i praksis kan ha med bøker og... Men... Jeg vet som sagt ikke. Men det kommer jeg tilbake til. OK. Dere kan tegne PS. Da kan vi se... Jo, der har vi en konteiner som står og kjører. Jeg lurer på om vi kanskje skal... Hoppe litt frem og tilbake. Kanskje vi skal prøve å... Først bygge en konteiner med dokkefarts. Og så etterpå gå tilbake til volumer og se på det. For det med volumer er ikke like viktig. Det viktigste vi skal se på. Så jeg tror vi starter med å gjøre det. En dokkefil er da i prinsippet en fil som inneholder alt det en dokkecontainer trenger. Det vi gjorde forrige gang, var at... Nå før pause så gikk jeg inn på denne...", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0016", "start": 3131.9, "end": 3343.36, "token_count": 588, "text": "Hoppe litt frem og tilbake. Kanskje vi skal prøve å... Først bygge en konteiner med dokkefarts. Og så etterpå gå tilbake til volumer og se på det. For det med volumer er ikke like viktig. Det viktigste vi skal se på. Så jeg tror vi starter med å gjøre det. En dokkefil er da i prinsippet en fil som inneholder alt det en dokkecontainer trenger. Det vi gjorde forrige gang, var at... Nå før pause så gikk jeg inn på denne... Det vi gjorde forrige gang, var at nå er jeg inne på konteineren, og da kan jeg kjøre apps. App install osv. Og så installere den programvaren jeg trenger, f.eks. en webserver. Men det vi skal se på nå, på vei ut med Exit... Da ser jeg for øvrig at den, når jeg går inn med Execute og kobler meg opp, Så vil den fortsatt stå og gå etterpå. Men det vi skal gjøre nå, er å bygge en container som allerede har Apasje installert før vi starter. Og det er da Dockefiles kommer inn i bildet. Og det man gjør da, er at man lager en mappe. Jeg vil lage en webserver her. Så jeg lager en mappe som heter Webserver. Så går jeg til den mappen. Og så lager jeg inni den mappen en fil som rett og slett skal hete dokkerfile. Den kan ha andre navn, men hvis man bruker navnet dokkerfile, sånn som det, så kan man bygge den... Og da vil default dokker forvente at filen heter dokkerfile. Så jeg kaller den dokkerfile. Og da... I gjennomgangen i Github vil dere se at det er en rekke kommandoer eller instruksjoner som gjør at man definerer hvordan konteineren skal se ut. Det første og viktigste er from. Det sier hvilket image man skal velge. For eksempel så velger jeg her... Siste bunteversjon, som jeg default får da. Etterpå saver jeg denne filen, så skal jeg kjøre meg en dokkebilde. Og da vil man starte med å laste ned bunte-imaget. Så kan man etterpå kjøre kommandoer inne inne i bildet. Inni det imaget. Når man bygger imaget, så vil disse kommandoene kjøres", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0017", "start": 3294.44, "end": 3577.58, "token_count": 598, "text": "Det første og viktigste er from. Det sier hvilket image man skal velge. For eksempel så velger jeg her... Siste bunteversjon, som jeg default får da. Etterpå saver jeg denne filen, så skal jeg kjøre meg en dokkebilde. Og da vil man starte med å laste ned bunte-imaget. Så kan man etterpå kjøre kommandoer inne inne i bildet. Inni det imaget. Når man bygger imaget, så vil disse kommandoene kjøres før man starter. På denne måten kan jeg starte med å si run app update, og så kan jeg ta istedenfor update, så kan jeg ta install. Og da kan jeg installere webserveren. Ja, vi kan jo kanskje gjøre dette i første omgang. Vi kan ta én ting til. Vi kan ta... Det jeg gjør nå, er altså å kopierer en fil som heter index.8ml. Da må jeg lage den inne i den mappen som jeg har her. Og så vet jeg at i en Apache-sølver... Så ligger indeksfilen i VAR og BWWHTMF. Da kopierer jeg den filen din, sånn at når dette imaget starter, så vil jeg få en container som inneholder en webserver. Da kunne jeg selvsagt lagt opp et svært filsystem der med masse statiske sider som kunne serves. Ok, vi kan stoppe der i første omgang. Og så kan vi prøve å bygge en container ut fra den dokkefilen. Og da bruker man dokkebild. Dokkebild... Ja, altså... Det er noen... Det er noen opsjoner man kan bruke på bild. Skal vi se... Ja... Minus T kan man i hvert fall ha med. Generelt, hvis man har en kommando som man lurer på, så kan man alltid legge på minus hell, sånn som her. Og da får man hjelp til akkurat den kommandoen dere vil. Minus T er greit. Det kan være nyttig, for da kan man legge på en... Eller gi konteineren et navn. Så vi kan bruke det. La oss si jeg kaller den Web, Apache, hva det er sånt. Blir et tydelig navn. Og så, nå ligger det en dokkefil her i mappa, så da bare legger jeg på en prikk som betyr... Og da ser vi at den begynner å bygge. Jeg hadde allerede hentet inn et ubundet image.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0018", "start": 3513.36, "end": 3737.2, "token_count": 585, "text": "Det kan være nyttig, for da kan man legge på en... Eller gi konteineren et navn. Så vi kan bruke det. La oss si jeg kaller den Web, Apache, hva det er sånt. Blir et tydelig navn. Og så, nå ligger det en dokkefil her i mappa, så da bare legger jeg på en prikk som betyr... Og da ser vi at den begynner å bygge. Jeg hadde allerede hentet inn et ubundet image. Men så begynner den som step to og fire å legge inn apt-get-update. Dette blir da en rekke steg nedover. Og nå begynner den å isolere Apache. Men det fine med denne lagdelingen er at det faktisk er en lagdeling også i imager. Sånn at hver del kan lages til en egen image. Øyeblikket før jeg begynte å installere Apache, det kan bli et image. Da vil det være Appget-update, men ikke Apache-innstilt. Så man får den type lagdeling. Og hvis man da endrer på noe, f.eks. endrer litt på hva som kopieres inn, så er det bare en liten endring. Når jeg da bygger et nytt image, så brukes alle de. De er akkurat som før. Installasjon av Apache og Hentu, Buntu osv. alt er det samme. Så må man legge på en endring, så kommer den på toppen av det nye. Så trenger man ikke å gå gjennom hele den byggeprosessen fra start til slutt. Det holder med den siste biten. Nå fikk jeg en feil her. Copy. Det er ikke så rart jeg fikk en feil på det. Fordi copy, den indeks.dot.hemmelen, den hadde jeg ikke laget. Så det er et godt eksempel på at da kan jeg rette opp det og bygge på nytt. Men vi kan før vi gjør det, så kan vi se om vi har fått et nytt image her. Ja. Det ser ut som det ikke har blitt ferdig siden den... Siden den feilet. Så jeg kan prøve å rette opp det her først. Her inne så trenger jeg da en inex-fil. Da kan jeg bare... Skrive inn noen her. Sånn. Da har jeg en fil her. Så kan jeg prøve å bygge på nytt. Da ser vi. Da... vil de tre første steppene...", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0019", "start": 3682.04, "end": 3908.82, "token_count": 585, "text": "Men vi kan før vi gjør det, så kan vi se om vi har fått et nytt image her. Ja. Det ser ut som det ikke har blitt ferdig siden den... Siden den feilet. Så jeg kan prøve å rette opp det her først. Her inne så trenger jeg da en inex-fil. Da kan jeg bare... Skrive inn noen her. Sånn. Da har jeg en fil her. Så kan jeg prøve å bygge på nytt. Da ser vi. Da... vil de tre første steppene... Der har man allerede et image som er ferdig. Så det går veldig fort. Da ser vi... Da... vil de tre første steppene... Der har man allerede et image. Så det er bare det siste steppet der. Det gjør en liten endring på imaget, og så bygger man imaget. Så nå... Nå ser vi at vi har et ferdig image her. Web Apartheid. Og da er det klart. Da kan jeg starte The Image som tidligere, Og da heter det Apasje. Så kan jeg kanskje kjøre bæsj der også. Sånn. Da er jeg inne i containeren. Og her er nå Apasje installert. Det er flere måter å starte Apasje på. Men jeg ser at den er installert. Ved at nå er det lagt inn muligheter for å starte Apasje-tjenesten. Et problem med dette er at den Apasje-tjenesten ikke har startet opp. Det kunne vært nyttig at den startet automatisk. Men... Så det går alltid an å gå inn sånn som jeg gjør nå. Og så gå ut igjen. Når jeg går ut, så bruker jeg kontroll-p, kontroll-q. Hvis ikke, så stopper hele serveren. Sånn. Så kan jeg liste igjen med PS. Og da ser vi at jo, jeg har en Veb-aparse nå som er oppe og kjører. Og den kjører da en Aparse. Men vi ser vi har et annet problem her. Og det er at vi har ikke tilordnet noen port. Og dermed så vil ikke... vil den neppe gi noe. Vi kan prøve... Den vil nok gi noe, men det er fra den lokale serveren som står her og kjører. Så vi fikk ikke den hei fra dere-fil. Hvordan kan vi endre det? Jo, det er... Da kan vi rett og slett stoppe konteineren.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0020", "start": 3870.12, "end": 4123.28, "token_count": 598, "text": "Og den kjører da en Aparse. Men vi ser vi har et annet problem her. Og det er at vi har ikke tilordnet noen port. Og dermed så vil ikke... vil den neppe gi noe. Vi kan prøve... Den vil nok gi noe, men det er fra den lokale serveren som står her og kjører. Så vi fikk ikke den hei fra dere-fil. Hvordan kan vi endre det? Jo, det er... Da kan vi rett og slett stoppe konteineren. Dokumentstopp. Og så ser vi den starter på 6A. Så det holder faktisk bare å skrive 6A. Så lenge det er entydig hvilken idé den er, så vil den stoppe. Så nå stoppet jeg WebApache. Så kan jeg prøve å starte den igjen med... Og så kan jeg ta minus P... La oss si vi tar 8081 til 80. Det betyr nå at... Innkomne forespørsler til Local Host på port 8081, skal forwardes sendes videre til port 80 på containeren. Så da... Jeg prøver å kjøre den sånn i stedet. Så kan jeg se her... Nei, det ser ikke ut som den webserveren kjører her. For vi stoppet jo hele containeren. Men da kan jeg prøve å starte webserveren. Da starter den. Så går jeg ut med kontroll P, kontroll Q. Så lister jeg konteineren igjen. Og nå ser jeg at... Nå ser vi port 8081. Blir nå sendt til port 80 på konteineren. Så hvis jeg nå kjører curl local host på 8081... Så ser vi at jeg får opp hilsenen fra Dockyfile. Så nå fungerer det sånn som det skal. Og da vil jeg også kunne se, hvis jeg nå går i en broser, så vil jeg også kunne se at den vil synes utenifra. Hvis jeg går til 8081 på OS71. Skal vi se. Gjøre et eksperiment der. Så skal jeg prøve å dele hele skjermen i stedet. Altså hele min bestoff. Sånn. Nå ser dere forhåpentligvis hele min desktop. Men da er det et spørsmål om... Ser dere bra nok det jeg skriver? Skal vi se... Ja. Det er en som sier ja her i hvert fall. Hvis det er noen som... Hvis denne skjermen er for liten, så si gjerne fra.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0021", "start": 4053.36, "end": 4350.16, "token_count": 591, "text": "Skal vi se. Gjøre et eksperiment der. Så skal jeg prøve å dele hele skjermen i stedet. Altså hele min bestoff. Sånn. Nå ser dere forhåpentligvis hele min desktop. Men da er det et spørsmål om... Ser dere bra nok det jeg skriver? Skal vi se... Ja. Det er en som sier ja her i hvert fall. Hvis det er noen som... Hvis denne skjermen er for liten, så si gjerne fra. Så kan jeg heller prøve å... Så kan jeg prøve å gå tilbake til å dele bare ett vindu. Ser et svart vindu til høyre for terminalen, bare. Det var rart. Vi kan se om vi får løst det på en annen måte. Men i hvert fall i første gang, så vil jeg bare demonstrere. Hvis jeg nå går inn på OUS70. Her er øredelen til den. Ja, så var det fort 80, 80, 81. Da ser vi, da kommer... Nei. Da kom det en annen... Da må du ha full screen. Da er spørsmålet hvorfor får jeg... Hvorfor får jeg nå en annen hilsen? Da må jeg gå tilbake hit, og så må jeg se dokker, container, PS... Nei, jeg har bare én... Én container. PS... Mulig at dette her er... At det er cash. Vi kan prøve å gjøre et eksperiment. Så kan vi da ta dokker container og så stoppe den her. Dokker container, stopp. 2F. Kan stoppe den andre der også. Da har jeg bare én container som kjører. Ja, og da, når jeg går her nede og prøver å... ... starte den på nytt, så ser vi at jeg ikke har noen kontakt. Så jeg tror kanskje at det bare var noe som lå i cash. Men det kan vi finne ut ved å kjøre ringen, så kan jeg starte på nytt. Du har den jeg kjørte. Og så må jeg... Starte Apache 2 igjen. Start. Sånn. Og da får jeg den riktige. Som jeg hadde her oppe da jeg kjørte curl lock-closed. Da fikk jeg hilsen fra dockerfile og hilsen fra dockerfile-containere. Så det som vi skal prøve å få til nå, som er problemstillingen, det er... Hvordan kan vi lage eller endre dockerfile sånn at Apache 2 starter direkte?", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0022", "start": 4293.36, "end": 4542.98, "token_count": 598, "text": "Du har den jeg kjørte. Og så må jeg... Starte Apache 2 igjen. Start. Sånn. Og da får jeg den riktige. Som jeg hadde her oppe da jeg kjørte curl lock-closed. Da fikk jeg hilsen fra dockerfile og hilsen fra dockerfile-containere. Så det som vi skal prøve å få til nå, som er problemstillingen, det er... Hvordan kan vi lage eller endre dockerfile sånn at Apache 2 starter direkte? Det kunne vært veldig nyttig. Så hvis jeg nå går ut her, så ser vi da stoppet den filen. Nei, det er imaget. Men så skal jeg gå inn i dokkerfeil og prøve å gjøre en endring. Og da er det... Det man kan gjøre, er å legge på en kommando. Og da trenger man å legge på en kommando som starter apasje. Det kan jeg legge på her. CMD, så få kommando. Og da kan... Og da er det en slags sånn... Hva heter det? Jason-syntaks. For å få til dette her, så... Man kan ikke kjøre direkte den inn hit. Men det er en biner i Apache som heter Apache-kontroll. Den bineren kan man starte. Hvis man prøver å gjøre dette direkte, så vil det ikke fungere. Og det er fordi dette starter arrangen en bakgrunnsjobb, den kommandoen. Og den, for å få Apache til å starte, så må den kjøres i foreground. Og da er det en liten besvergelse. Det er en demon som da starter. Hvis jeg har fått det her riktig, så skal det nå bygges en Aparche-container som starter direkte. Så da må jeg prøve en bilde igjen. Da vil jeg nok få en feilmelding om at den allerede er bygget. Nei, det er feil. Det gikk fort å gjøre endringen, for da var det bare kommandoen som ble endret. Så kan vi prøve å starte konteineren igjen. Det er samme... Ja, det skulle funke, det. Så kan jeg se... Nei, jeg kan ikke se om den... si at den kjører her. Det skulle jeg ha sett her nede. Nei. Det ser faktisk ut som den ikke har startet. Da var det tydeligvis noe som ikke virket... Skal vi se... Det er ett spørsmål her. Kan man ha flere dokkerfiler i container?", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0023", "start": 4473.36, "end": 4773.06, "token_count": 589, "text": "Det gikk fort å gjøre endringen, for da var det bare kommandoen som ble endret. Så kan vi prøve å starte konteineren igjen. Det er samme... Ja, det skulle funke, det. Så kan jeg se... Nei, jeg kan ikke se om den... si at den kjører her. Det skulle jeg ha sett her nede. Nei. Det ser faktisk ut som den ikke har startet. Da var det tydeligvis noe som ikke virket... Skal vi se... Det er ett spørsmål her. Kan man ha flere dokkerfiler i container? Nei. I utgangspunktet så har man én dokkerfil. Og den bygger da én container. Men man kan jo starte flere instanser av den containeren. Men skal vi se. Hva var problemet her? Jo... Skal vi se om vi har noen konteinere å kjøre. Den står og kjører. Men... Den svarer ikke på port 8081. Så det betyr nok at Apache ikke kjører inni konteineren. Da må vi gå tilbake til dokkefilmen. Og så se om jeg har fått syntaksen helt riktig. Det er mulig det gjør en forskjell om man starter den interaktivt. Tanken er at man skal starte den i bakgrunnen. Det gjør man med minus d. Sånn som det. Men her får jeg en melding om... Da skyldes det kanskje... at det allerede... Oi. Ja. Jeg glemte å stoppe den her, ja. Da må jeg stoppe den først. Sånn. Så prøver jeg å starte containeren i bakgrunnen. Da ser vi. Når jeg starter med minus D, så får jeg ikke opp et skjell, for da har jeg ikke bedt om det. Da startes denne i bakgrunnen. Nå ser vi... Den er oppe og kjører. Da ser vi også... Nå virket det faktisk som det skulle. Nå startet den filen... Imaget startet, containeren startet. Og den startet da også automatisk webserveren. Så nå har vi på en måte fått et veldig kraftig verktøy. Jeg kan stoppe den her. B5. Ja, det var faktisk flere med B5. Eksplisitt stopp en sånn, da. Nå stopper jeg den konteineren. Og da ser vi... Ved å bygge denne konteineren med...", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0024", "start": 4718.04, "end": 4997.8, "token_count": 588, "text": "Nå startet den filen... Imaget startet, containeren startet. Og den startet da også automatisk webserveren. Så nå har vi på en måte fått et veldig kraftig verktøy. Jeg kan stoppe den her. B5. Ja, det var faktisk flere med B5. Eksplisitt stopp en sånn, da. Nå stopper jeg den konteineren. Og da ser vi... Ved å bygge denne konteineren med... Så har vi nå en konteiner som tar det innholdet vi ønsker. Installerer Apache 2 og kjører den i forgrunnen. Så det vi gjorde var bare å bygge den sånn. Nå er den ferdigbygd. Og her har vi da en fiks ferdig oppskrift, så nå er det bare for den som måtte ønske det. På omtrent no time så har vi da en kjørende konteiner. Da sa vi at nå er det veldig mye lettere å starte en til. Som kjører på 80-82. Sånn som det. Eller tre stykker for den saks skyld. Hvis jeg går til 8082, så ser vi at der har jeg også en container som kjører. 8083. Har jeg en annen webserver osv.? 84. Den hadde jeg ikke startet. Så vi ser på denne måten at det er ekstremt hurtig å starte å kjøre containere. Men... neste problemstilling blir da hvordan kan man endre på innholdet. I utgangspunktet så må man da gå inn i konteineren og endre på innholdet. Vi kan jo prøve det, altså. Sånn generelt så kan jeg gå inn i en konteiner, f.eks. denne her. Går jeg inn i den på... 81 er det vel jeg går inn i nå. Og så kan jeg gå til hit. Her ligger indekshvila. Så kan jeg legge til fra 8081, f.eks. Så kan det gå ut igjen. Da har vi fortsatt tre konteinere som kjører. Så kan vi se om... Ja, da ser vi her. Nå får vi en spesiell melding fra 8081. Fra 8082. Så får vi den samme gamle meldingen. En konteiner bygges opp av flere image, som er på en måte lagdelt. Men hvis man tenker på det grunnleggende imaget, så har man bare ett image.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0025", "start": 4923.36, "end": 5261.3, "token_count": 590, "text": "Så kan det gå ut igjen. Da har vi fortsatt tre konteinere som kjører. Så kan vi se om... Ja, da ser vi her. Nå får vi en spesiell melding fra 8081. Fra 8082. Så får vi den samme gamle meldingen. En konteiner bygges opp av flere image, som er på en måte lagdelt. Men hvis man tenker på det grunnleggende imaget, så har man bare ett image. Det er da i dokkefylen. Øverst i dokkefylen så står det 'from a bunte'. Det betyr hent et bunte-image. Men så, ja... Det du henter da, er alt som skal til for å gjøre det underliggende Linux-operativsystemet til en Ubuntu 1804. Hvis jeg hadde... Her så er det jo ikke... Vi kan se... VM-en her... Det er jo en... Det er jo Debian. Det er Debbian versjon 10.3. Så... Så når jeg kjører from Ubuntu, så det imaget inneholder alt som skal til for at dette Debbian-operativstemmet ser nøyaktig ut som Ubuntu 1804. Og så, når jeg installerer Apache 2, så kommer det et nytt lag på det imaget. Alt som gjør det opprinnelige buntimaget forskjellig fra det. På den måten er det en lagdeling som gjør at man til slutt får et image som inneholder alt det man trenger. OK... Skal vi se. Jo, da er det to problemstillinger som står igjen. Men den første problemstillingen... Eller det er vel egentlig bare én problemstilling som står igjen. Og det er å kunne få en fil lokalt til å vise innholdet i dokkecontaineren. Vi kan prøve å få det til. Skal vi se. Dette her ville jo... starte en konteiner på 8084. Så kan vi prøve å legge til et volum. Da kan jeg prøve å... Skal vi se... Jeg kan prøve å legge til ruteområdet her. Og så kan jeg kopiere... Kan lage en fil... Veldig kort. Som inneholder... hei. Og så kan jeg prøve å kjøre den kommandoen her. Men jeg kan ta og legge på et volum. Ruth skal peke til VAR... WWW HTML. Tror det er sånn det skal kjøres. Jeg sjekker noen gamle kommandoer. Jeg gjør et forsøk.", "source": "lecture"}
{"lecture_id": "linux8", "chunk_id": "linux8_0026", "start": 5163.36, "end": 5469.44, "token_count": 570, "text": "Skal vi se... Jeg kan prøve å legge til ruteområdet her. Og så kan jeg kopiere... Kan lage en fil... Veldig kort. Som inneholder... hei. Og så kan jeg prøve å kjøre den kommandoen her. Men jeg kan ta og legge på et volum. Ruth skal peke til VAR... WWW HTML. Tror det er sånn det skal kjøres. Jeg sjekker noen gamle kommandoer. Jeg gjør et forsøk. Her var det en port som allerede var i bruk. Vi tar 85. Sånn. Straks ferdig. Så bare gjøre ett forsøk på dette her. Hva henter vi nå fra...? Ja, det så ikke så godt ut. Ja, vi fikk det nok ikke helt til. Men det var fordi... ja. Mappen her skulle mappes over på... På webserveren. Men jeg kan... Vi har holdt på lenge nå. Så jeg kan ta en liten pause, så kan jeg komme tilbake om et kvarter. Og så kan jeg pose her hvordan... Den riktige kommandoen for å få til dette. Fra filsystemet inn i dokker i Misjøen. Sånn at når vi etterpå laster inn webfilen, så skal den i den som ligger på hosen. Men jeg ser klokka er min nå, så vi tar 15 minutters pause der. Så er planen etter pausen at dere kan gå inn i såkalte breakout rooms. Litt sånn som vi gjorde forrige fredag. Da vil Ine og Pedran være i hvert sitt rom. Jeg vil også være i ett til å begynne med. Men så har Ine et opplegg for å lage en kø. For det ble en del trøbbel sist med at mange kom inn i samme rommet. Det ble litt kaos. Så Ine kommer til å gi en beskjed på i chatten om hvordan dere skal komme inn. Men først tar vi en pause til... Ja, i hvert fall til 12.30. Kom gjerne med spørsmål til forelesningen i chatten. Så kan jeg prøve å gi ut generelle svar etter pausen. Ok. Men da takker jeg foreløpig for i dag. Det er veldig vanskelig å forstå hva som er skjedd, og hvordan det er. Hva er det som er så spesielt med denne filmen?", "source": "lecture"}
