{"lecture_id": "linux7del15", "chunk_id": "linux7del15_0000", "start": 0.0, "end": 310.02, "token_count": 586, "text": "Der kommer det. Ser at jeg har en liste med tegnere. Så kan jeg ta RM på én av dem. ID-en der er faktisk det samme som host name. Alle har en del sånne rare navn, Fervent Galileo og Tender Williams osv. Percy Ellis. Man kan også bruke det navnet, som er enklere å huske. Men nå tar jeg bare sletter med ID-en. Hvis jeg lister på nytt nå, så forsvant en av vennene mine. Ja, vi kan prøve Loving Shep. Da forsvant den også. Hvis jeg tar bare dokker, container, LS, så får jeg bare de som kjører. Men det er ingen nå. Minus A gir alle. At vi hadde en brun... Jeg kan prøve volum sånn som det. Da ser vi... Slette alle Stop containers. Da sier jeg ja, og da... Der er alle borte. En gang iblant så kan det være greit å rydde opp. Der, ja. Jeg tror jeg skrev kommandoen feil. Skal prøve å finne ut hva jeg gjorde feil. Ja, jeg skrev... og da fikk jeg ikke opp noen ting. Det kan kanskje være instruktivt, for jeg fikk ikke noen god feil. Det ser bare helt dumt ut. Men det er viktig å ha syntaksen riktig. Docker image LS. Da ser jeg... Disse tar litt mer plass. Men... Så disse imagene kan det være lurt å rydde opp i. Men likevel, det tar ikke så voldsom plass. 64 MB er egentlig veldig lite. Hvis man har en ubuntu virtuell maskin, så tar det i hvert fall en white med disk-plus. Man kan også slette disse. Da forsvant den. Hvis jeg nå starter en ny i bunte... Vi kan prøve å starte 14.04, så er vi fortere der. Det jeg gjorde nå, var at jeg ikke ba om et skjell. Da får jeg ikke oppi noe skjell, sånn at jeg kan gjøre noe inni. Siden jeg ikke hadde lastet ned 1404 før, så blir den lastet opp. Men... jo, jeg fikk faktisk opp et skjell likevel. Da kan vi også se hosename. Det er den ID-en som vi får når vi lister opp. Så... Ja, det dere kan se nå, er at... Jeg har eksplisitt fått opp den 14.04. Hvis jeg nå går ut igjen og lister images,", "source": "lecture"}
{"lecture_id": "linux7del15", "chunk_id": "linux7del15_0001", "start": 249.84, "end": 329.98, "token_count": 161, "text": "Da får jeg ikke oppi noe skjell, sånn at jeg kan gjøre noe inni. Siden jeg ikke hadde lastet ned 1404 før, så blir den lastet opp. Men... jo, jeg fikk faktisk opp et skjell likevel. Da kan vi også se hosename. Det er den ID-en som vi får når vi lister opp. Så... Ja, det dere kan se nå, er at... Jeg har eksplisitt fått opp den 14.04. Hvis jeg nå går ut igjen og lister images, så ser vi at nå har jeg fått opp den litt mindre. Da ser vi igjen. Andre gang jeg kjører, så går det mye fortere.", "source": "lecture"}
