{"lecture_id": "linux3del7", "chunk_id": "linux3del7_0000", "start": 0.0, "end": 213.58, "token_count": 596, "text": "Omdirigering til og fra filer benytter man seg ofte av i Linus. Så vi skal se litt på det nå. Hvis jeg skriver ekko hei, så går det til standard out. Og det er da ut i terminalvinduet. Så kan jeg i stedet omdirigere dette til en fil. På denne måten. Da ligger innholdet... Hei, det ligger da i den filen. Hvis jeg gjør dette en gang til, så vil innholdet i filen overskrives. Så hvis jeg ser på filen nå, så ser vi at den er blitt avskrevet. Veldig eksplisitt. Legger inn 'hei 2'. Den legges inn i filen. Men nå, hvis jeg ønsker at 'hei' skal komme i tillegg, så kan jeg legge på to større tegn. I tillegg til det som ligger der fra før. Generelt kan det ofte være nyttig å kunne omdirigere feilmeldinger. Og mens standard out er kanal 1, så er standard error er kanal 2. Så vi kan prøve f.eks. med vilje å skrive ekkohøy feil. For en feilmelding. Så kan jeg tenke meg at jeg ønsker å legge feilmeldingen i en fil. Men det funker ikke helt som man skulle ønske. For det som skjer, er at det bare er Standard1, eller Kanal1, StandardAlt, som sendes til ErdoTekst. Fortsatt ut til sin standard, som er ut til terminalen. For å få sendt selve fernmeldingen... Det man kan gjøre da, er å legge på 212, som betyr send kanal 2 til r.text. Hvis jeg gjør det, så ser vi at da får jeg r.text inne i denne filmen. Så kan det også gå an å sende standard-out til ett sted og standard-error til et annet sted. Og det med følgende konstruksjon... Da kan vi si... At vanlig opphold, standard-out av denne kommandoen, skal til her og tekste. Og eventuelt feil skal til r-da-tekste. Og i dette tilfellet så kom feilnett. Hvis jeg hadde skrevet ekko riktig... Så får jeg ikke noe feil, men da får jeg output til heitvott-teksten. Og denne konstruksjonen er veldig nyttig. Da kan man styre nøyaktig hvor man vil ha feilmeldingene. Har en eller annen kommando,", "source": "lecture"}
{"lecture_id": "linux3del7", "chunk_id": "linux3del7_0001", "start": 171.02, "end": 393.5, "token_count": 600, "text": "At vanlig opphold, standard-out av denne kommandoen, skal til her og tekste. Og eventuelt feil skal til r-da-tekste. Og i dette tilfellet så kom feilnett. Hvis jeg hadde skrevet ekko riktig... Så får jeg ikke noe feil, men da får jeg output til heitvott-teksten. Og denne konstruksjonen er veldig nyttig. Da kan man styre nøyaktig hvor man vil ha feilmeldingene. Har en eller annen kommando, og så ønsker man ikke å ta vare på feilmeldingene... Man vet det kommer en masse feilmeldinger, sånn som i denne her... Så i stedet for å sende ut en fil, så kan man sende det til en device som heter dev.0. Og dev.0 er et slags sort hull. Alt man sender dit, blir bare borte. Men i praksis så betyr det bare glem alt av feilmeldinger. Det skal ikke ses i det hele tatt, og det skal ikke lagres noe sted. En annen måte å utføre den kommandoen som sender denne her... Som sender både StandardOut og StandardAut til samme sted... Det er en litt kortere måte. Den her. Den betyr send både kanal 1 og kanal 1. Så her får vi, uansett om den er riktig eller ikke, så får vi... Enten feilmelding eller den riktige output i r.tekstene. Det finnes en annen måte å omdirigere på også. Hvis jeg f.eks.... Jo, hvis jeg tar LS på noe på en mappe som ikke finnes... LS finnes ikke, så... Og så ønsker jeg kanskje den skulle ut hit. Så har vi sett at jeg kan kanalisere... Jeg kan kanalisere error til en annen tid. Men en annen konstruksjon, det er å si... Kanal 2-error, det skal jeg sende til samme sted som 1. På denne måten. Så det betyr... Send error til samme sted som 1. Og da vil jeg få feilmeldingene i... Nei, det fikk jeg ikke. For der er det en liten feil i notatene. Denne konstitusjonen er ikke riktig. Vi skal sende to til Å1. Altså Å1 er adressen til 1. Så hvis jeg gjør det på denne måten, den riktige måten, så vil... Feilmeldingene sendes til samme sted som én.", "source": "lecture"}
{"lecture_id": "linux3del7", "chunk_id": "linux3del7_0002", "start": 347.64, "end": 562.16, "token_count": 590, "text": "Send error til samme sted som 1. Og da vil jeg få feilmeldingene i... Nei, det fikk jeg ikke. For der er det en liten feil i notatene. Denne konstitusjonen er ikke riktig. Vi skal sende to til Å1. Altså Å1 er adressen til 1. Så hvis jeg gjør det på denne måten, den riktige måten, så vil... Feilmeldingene sendes til samme sted som én. Og da får jeg den feilmeldingen ut der. Så kikk på notatene og se hvor er det en liten feil? Nemlig at man bruker denne konsesjonen. Den fungerer ikke. Og én, det er på en måte adressen. Samme adresse som kanal 1. Nyttig å bruke når man ønsker å pipe på feilmeldinger. For eksempel så... Ja, så kan det være... La oss si jeg ønsker å finne... På denne maskinen... alt som heter noe med passord. Vanligvis når du gjør en sånn kommando, så leter den masse, og så kommer det en haug med 'permission denied'. Da kunne det være greit å peipe vekk de. Da kan man tenke seg at ok, jeg bare... Jeg vil... Grep minus V. Den fjerner alt som har noe med passive D å gjøre. Med 'permission' fra alle de setningene som kom, så var det 'permission denied'. Hvis jeg prøver dette, så ser vi at det funka dårlig. Permission er fortsatt med. Men da fins det igjen en konstruksjon, eller den samme konstruksjonen, så der kan vi legge på den her. Vi sier jeg vil sende to til samme sted som kanal 1. Og kanal 1 blir pipet videre til grep. Og dermed så fungerer det. Da får jeg filtrert bort alle linjer som har permission i seg. Det jeg gjorde, var at jeg la på den konstruksjonen. Før standard 1 sendes til pipen, så sendes alt som da skal til standard R, den sendes til kanalen. Og så vinner det til grepet. En litt lignende konstruksjon kan man bruke iScript. Jeg har lagd et veldig kort script der som heter r.shell. Og det bare skriver ut ekko-error. Vanligvis, hvis man skriver ut ekko-error, så kommer det til standard 1.", "source": "lecture"}
{"lecture_id": "linux3del7", "chunk_id": "linux3del7_0003", "start": 521.58, "end": 636.6, "token_count": 367, "text": "Det jeg gjorde, var at jeg la på den konstruksjonen. Før standard 1 sendes til pipen, så sendes alt som da skal til standard R, den sendes til kanalen. Og så vinner det til grepet. En litt lignende konstruksjon kan man bruke iScript. Jeg har lagd et veldig kort script der som heter r.shell. Og det bare skriver ut ekko-error. Vanligvis, hvis man skriver ut ekko-error, så kommer det til standard 1. Men denne konstruksjonen sier at alt som går til standard 1, det skal videresendes. Så da betyr det at dette blir en feilmelding som går ut i kanal 2. Hvis jeg nå kjører dette, så kommer error ut. Og det ville det gjort hvis jeg bare hadde echoet der inne. For den både standard in og standard er går til terminal default. Men nå kan jeg si ok, jeg vil ta error fra denne... Fra denne kommandoen å sende til r.exc. Og da ser vi at det funker som det skal. r.exc inneholder nå feilmeldingen fra dette skriftet. Så dette er en måte å eksplisitt sende feilmeldinger til kanal 2 på. Og det gjøres ved den konstruksjonen. Det er ikke så veldig ofte man bruker disse konstruksjonene, men det kan være nytt en gang iblant. Hvis du møter et skript hvor disse er brukt, så er det greit å vite hva de betyr.", "source": "lecture"}
