{"lecture_id": "linux5del11", "chunk_id": "linux5del11_0000", "start": 0.0, "end": 219.16, "token_count": 586, "text": "Vi skal nå se på ri i schellscript og i kommandolinjen. Og ri har en litt spesiell syntaks, for det er også definert i ettertid, så det har kommet som et tillegg til bæsj. Og konstruksjonen for å lage... La oss si jeg ønsker å lage et ri som heter noe med tall. Da er det en sånn konstruksjon. Hvis jeg skal bruke en sånn konstruksjon hele tiden, så kan jeg... Et lite knep er å bruke taste kontroll K. Da sletter jeg det fra linjen, og så kontroll Y når jeg skal bruke det. Så da kan jeg enkelt definere RI-elementer. La oss si første element... Tall av null. Det kan være null. Element én, det kan være én. Så kan jeg nå bruke kontroll Y. Så si to er lik to. Kontroll Y igjen. Tre er lik tre. Ikke tre, men T er i. Da har jeg definert et ray med fire elementer. Så kunne jeg jo tro at når jeg nå skal skrive ut et element... Det skulle få det til på denne måten, tall av 1, f.eks. Men det skriver bare ut tall av 1 - null. Ja, det skriver ut null av én, faktisk. På samme måte som tall av to skriver ut null av to. For å skrive ut det riktige elementet, så må man legge på krøllparenteser rundt. Derav det blir litt spesiell syntaks. Men da fungerer det som det skal. Nå kan vi skrive ut de forskjellige elementene. Bare man husker på den syntaksen, så fungerer det. Mens denne syntaksen... Den fungerer ikke i det hele tatt. Den bruker den nullen fra første elementet. Så f.eks. så ønsker man noen ganger å løpe gjennom alle elementene i et rai, eller alle indeksene. Og da er det noen konstruksjoner som er nyttig å kunne. En kan jeg ta kontroll K på den, og kontroll Y.... For å få ut alle elementene må man legge inn en alfakrøll inne i re i stedet for elementnummeret. Da skrives ut verdien av alle elementene. Så kunne man også ønske seg å skrive ut indeksen. Igjen blir det litt kryptiske konstruksjoner. Men dette gir da alle indeksene av elementet.", "source": "lecture"}
{"lecture_id": "linux5del11", "chunk_id": "linux5del11_0001", "start": 165.68, "end": 404.64, "token_count": 594, "text": "alle elementene i et rai, eller alle indeksene. Og da er det noen konstruksjoner som er nyttig å kunne. En kan jeg ta kontroll K på den, og kontroll Y.... For å få ut alle elementene må man legge inn en alfakrøll inne i re i stedet for elementnummeret. Da skrives ut verdien av alle elementene. Så kunne man også ønske seg å skrive ut indeksen. Igjen blir det litt kryptiske konstruksjoner. Men dette gir da alle indeksene av elementet. Og på den måten så kan man f.eks. løpe gjennom alle elementer i en forløkke. For i inn, og så... Så må vi ha en alfakrøll, og vi må ha et utropstegn først. Det får i inn, og så løpe gjennom alle indeksene. For hver indeks så kan du f.eks. skrive ut ekkoelement dollar i er... Og så... Og så element av dollar i. Da har jeg den riktige konstruksjonen. Krøllparenktes før og etter. Tall av dollar i... og don. Og på den måten så ser vi hvordan vi kan løpe gjennom et helt r. Det finnes en annen måte å definere r-e på. Og det er å kan definere et helt r-e på en gang. På denne måten. La oss si... A, B, C, D, E, F. Sånn som det. Her har jeg nå... ... definert et r-ei. Eller definert de første elementene av r-eiet arr. Sånn. Så da kan jeg skrive et f.eks. element nummer 1. Men som oftest inni løkker så definerer man RI direkte. Så derfor er det vanligste måten å starte å definere et RI på, er bare å skrive inn elementer, sånn som dette her. Dette vil da være det vanligste utgangspunktet for å definere et RI. Det er bare det første ri-elementet. Og jeg skriver det ut som ri-a0. Helt til slutt. Antall elementer i et ri har også en spesiell konstruksjon. Da må man ha med alfakrøll, og så må man ha en hashtag. Da får man ut antall elementer. Her var det bare ett element. I r var det fire. Og det samme var det i tall-raj, som jeg definerte. Så det gir antall elementer i raj.", "source": "lecture"}
