{"lecture_id": "linux6del3", "chunk_id": "linux6del3_0000", "start": 0.0, "end": 245.8, "token_count": 594, "text": "Alle Linux-brukere er med i en gruppe. Og hvis man skal se hvilke grupper man er med i, så kan man bruke kommandoen groups. Hvis jeg bruker groups på group 100, så ser vi at groups er med i group 100 og i sudo. Og vi ser at default gruppe, det er group 100 for filer som... Lages av denne gruppen. Av denne brukeren. Så... Men det går an å endre gruppe som en fil er med i. Og det bruker man command change group eller chrp på. Og jeg kan da endre til en gruppe som denne brukeren er med i. Change group sudo for fil.tk. Hvis jeg nå lister filene på nytt... Så ser vi at denne filen er eid av sudogruppen. Eller det vil si, alle som er med i sudogruppen, har disse rettighetene til gruppen. Så hvis vi endrer rettigheter for fil.taxi til la oss si 775... Skal vi se at nå har de som er med i sudogruppen, har alle rettigheter, både read, write og execute, til denne filen, fil.tkc. Man marer ut for å lage nye grupper. Så vi kan f.eks. lage med adgroup, så kan man lage en ny gruppe. Da sier jeg at vi lager en studgruppe. Og da må jeg oppi passord. Sånn. Nå har det blitt lagd en studgruppe på systemet med gruppe-id 1001. Og da kan vi grepe studg på et group. Da vil vi se at stut-gruppe nå har en linje i etc.-gruppe. Og så kan man da f.eks. legge til brukere til denne gruppen. Så jeg kan da ta... For å legge til brukere, så må jeg ha sudo-rettigheter. Add user. La oss si jeg ønsker å legge til nå... Group 100 til gruppen Stud... Gruppe, på den måten. Hvis jeg nå igjen ser i Etse-passord på Grepper etter Stud-gruppe, så ser vi at Group 100 har nå blitt medlem av den Stud-gruppen. Så kan vi gi alle som er medlem av denne nye Stud-gruppen, rettigheter til... For eksempel fil.txt. Og det gjør vi da med Change Group. Skjeve GRP til Studgruppe for fil.txt. Men da ser vi... Dette får vi ikke lov til, og vi burde få lov til det. Så lenge vi er med i gruppen...", "source": "lecture"}
{"lecture_id": "linux6del3", "chunk_id": "linux6del3_0001", "start": 189.12, "end": 331.2, "token_count": 391, "text": "Hvis jeg nå igjen ser i Etse-passord på Grepper etter Stud-gruppe, så ser vi at Group 100 har nå blitt medlem av den Stud-gruppen. Så kan vi gi alle som er medlem av denne nye Stud-gruppen, rettigheter til... For eksempel fil.txt. Og det gjør vi da med Change Group. Skjeve GRP til Studgruppe for fil.txt. Men da ser vi... Dette får vi ikke lov til, og vi burde få lov til det. Så lenge vi er med i gruppen... I denne studiegruppen, så burde jeg få lov. Men vi ser, selv om det står at vi er med her, så dukker ikke den opp når vi gjør groups. Så det man da må gjøre, er bare å logge ut og inn igjen for at det skal tre i kraft. Hvis jeg nå skriver 'groups', så ser vi at nå er jeg med i studiegruppe. Og da kan jeg gå tilbake. 'Change group studiegruppe fil.tkc'. Da ser vi at jeg får lov. Og studiegruppe har endret seg til... Nei, gruppetilhørigheten har endret seg til studiegruppe. Så alle som er medlem av studiegruppe, får nå tilgang til fil.tkc. Med disse. Og man kan ikke tillegge noen grupper som man ikke er med i selv. Hvis jeg ser på Etsy Group... Hvis starten er Admo, f.eks. Hvis jeg prøver å legge til Adm, så ser du at jeg ikke får lov til det. Man får bare lov til å legge til grupper som man selv er med i. Ja.", "source": "lecture"}
