{"lecture_id": "linux7del7", "chunk_id": "linux7del7_0000", "start": 0.0, "end": 280.0, "token_count": 583, "text": "Ja, da skal vi ta oss og kjøre en Hello World. Ja, jeg kan jo ta oss og... Med disse slidene så kan jeg ta og... Kjøre det i et vindu her. Skal jeg ta og i stedet... Det kan sikkert være fint for dere å ha slidene oppe, men jeg kan da dele... Et dokkervindu med dere i stedet. Sånn. Jeg kan kanskje vise hvordan det er tenkt at dere skal gjøre det, hvis dere ikke har gjort det allerede. Er inne på desktopen min, som står nede på bordet mitt. Og så går jeg inn som jeg bruker OS70. Bare logger inn på den som vanlig. Jeg er nettopp logget inn, så jeg trengte ikke... Ja, generelt så må man bruke sudo for å kjøre dokker. Som jeg snakket om tidligere, dette er VM-er. Man trenger ikke være like bekymret for å kjøre ting som Ruud. Hvis noe galt skjer, så går det an å bygge VM-ene på nytt. Sånn. Men i hvert fall nå har jeg et Ruud-skjell. For de som er interessert, så kan du se at her ligger en dokker.so. Jeg installerte dokker på VM-en her. Det eneste jeg gjorde, var å kjøre det. Det installerer sertifikat og noe greier, og så henter det ned dokker fra dokker.com. Det som er installert, er dokker. Når man har gjort det, så kan man begynne å kjøre containere. Vi kan starte med dokker. Også Hello World. Det er en... En bitte liten dokker hello world. Da ser vi den starter oss oppover, men da har den kjørt en liten container. Vi kan kanskje gå tilbake til slidene og se på hva som egentlig skjer her, når jeg kjører denne hello world. Etter hvert skal vi kjøre litt mer avanserte ting. Man kan f.eks. kjøre Ubuntu, og da starter opp tilsvarende en hel Ubuntu-server. Så ser vi den kommandoen der, var det jeg kjørte. Men hva var det som egentlig hendte, da? Jo, når jeg kjører docker-rund, så er det egentlig flere kommandoer som skjer. Man kan gjøre de eksplisitt, men det er bare både docker-bild... Så man kjører egentlig de tre kommandoene der.", "source": "lecture"}
{"lecture_id": "linux7del7", "chunk_id": "linux7del7_0001", "start": 210.0, "end": 322.76, "token_count": 231, "text": "Etter hvert skal vi kjøre litt mer avanserte ting. Man kan f.eks. kjøre Ubuntu, og da starter opp tilsvarende en hel Ubuntu-server. Så ser vi den kommandoen der, var det jeg kjørte. Men hva var det som egentlig hendte, da? Jo, når jeg kjører docker-rund, så er det egentlig flere kommandoer som skjer. Man kan gjøre de eksplisitt, men det er bare både docker-bild... Så man kjører egentlig de tre kommandoene der. Og pull, dvs. at den går ut i dockerhub, som er et repository. Altså et lager av forskjellige docker-images. I vårt tilfelle henter vi bare en liten hello world. Som vi ser her, kan vi hente Så lastes det imaget ned fra Dokkerov hit. Og så det neste... Det var pull. Og så rund. Da kjøres... Da kjøres det imaget som en kontakt.", "source": "lecture"}
