{"lecture_id": "linux5del3", "chunk_id": "linux5del3_0000", "start": 0.0, "end": 206.76, "token_count": 600, "text": "Jeg skal nå se på command and fine, som kan brukes til å finne filer på Linux-systemet. Så syntaksen til fine er at man først må si hvor man ønsker å finne filene. Her sier jeg prikk, altså i mappen jeg står i. Så må man spesifisere hva slags filer man ønsker å finne. Jeg skal prøve å finne alle dotsy filer, alle som begynner på et eller annet og slutter på c. Så kan jeg prøve å spesifisere litt mer spesifikt hvilken mappe jeg skal lete i. Her finner jeg alle i OS-mappen. Og her finner jeg alle nede i Old i OS-mappen. Man kan også spesifisere nøyaktig filnavnet på denne måten. Da kan jeg f.eks. si alle filer på mitt hjemmeområde som heter sum.c. Da finner jeg alle de der. Det finnes en annen metode som heter locate. Og hvis jeg bruker kommandoen locate sum.c, så finner jeg alle filer på systemet som heter noe som inneholder sum.c. Ikke nødvendigvis nøyaktig sum.c. Den locate-kommandoen er avhengig av at det er en oppdatert locate-database. Og den kan da være litt kjappere, mens fine funker alltid. Og den letter helt fra scratch gjennom alle mappene. En annen måte å bruke fine på som er veldig nyttig, det er å bruke fine i forhold til tid. når en fil har vært endret. F.eks. hvis du vet at du har en fil som har blitt endret på et eller annet tidspunkt, så kan man spesifisere det. Og da er det en opsjon som heter \"-newer\", newer-MT. MT står her for Modified Time. Så skal vi finne da filer som er... Endret tidligere enn gitt dato. Eller det vil si... Med nyere MT så vil du da finne filer som er endret etter denne datoen. Så vi kan f.eks. se... 8. eller 6. februar... Oi. 6. februar. Jeg skal finne alle filer som er modifisert etter det. Det er litt vanskelig å se når det er modifisert, så man kan legge på en minus LS, som kan legge på alle fine kommandoer. Da ser jeg her eksplisitt at dette er bare filer som er etter 6.2.", "source": "lecture"}
{"lecture_id": "linux5del3", "chunk_id": "linux5del3_0001", "start": 165.28, "end": 322.7, "token_count": 442, "text": "som er endret etter denne datoen. Så vi kan f.eks. se... 8. eller 6. februar... Oi. 6. februar. Jeg skal finne alle filer som er modifisert etter det. Det er litt vanskelig å se når det er modifisert, så man kan legge på en minus LS, som kan legge på alle fine kommandoer. Da ser jeg her eksplisitt at dette er bare filer som er etter 6.2. Så jeg kan f.eks. gjøre sånn. Og da finner jeg alle fra 8.2. Så nå kan jeg spesifisere tidspunktet. La oss si jeg sier alle som er nyere enn dette tidspunktet. Alle filer som er nyere enn 8.2.2021 klokka 22.00. Da ser vi at jeg får akkurat bare disse her fra 22.06,03 og 06. Etter 22.00 8.2. Så kan det kanskje være at du vet et tidspunkt som du gjorde noen endringer. Og da kan det være en... Da kan man legge inn... Det skal være nyere enn dette tidspunktet. Enn for eksempel... Vi kan si at det skal være nyere enn 20 klokka 8. Og så skal det ikke være nyere enn 22. Og da ser jeg at da får jeg alle tidspunkt som er mellom dette, klokka 208. februar, og klokka 22. Så den her er 2023-2116. Så disse tre filene ble modifisert mellom de to tidspunktene. Så hvis man da vet om at man har gjort noen endringer på et helt spesielt tidspunkt, så kan man med denne enkle, lille konstruksjonen så kan man finne nøyaktig de filene.", "source": "lecture"}
