{"lecture_id": "linux5del1", "chunk_id": "linux5del1_0000", "start": 0.0, "end": 208.24, "token_count": 595, "text": "Vi skal nå se på passordkryptering på en Linux-server, og hva som skjer når vi logger inn på en Linux-server. Ja, vi vet at all info om innlogging ligger i en fil som heter etterpassword. I hvert fall all info som brukernavn og bruker-id osv. Hjemmemappe. Default selv. Men passordet ligger ikke her. Tidligere så lå i stedet for den X-en, så lå det en såkalt passordhersj. En kryptert form av passordet. Av sikkerhetsgrunner så ligger det nå ikke lenger i passord, sånn at det kan ses av alle. Men default, så ligger en... Passordhersen ligger i etshadow. Men den har ikke en vanlig bruker lov til å se på, så da må man være sudobruker for å ha ut rettigheter. Nå hadde jeg nettopp tastet ut passordet, ellers måtte jeg taste passordet direkte. Her ser vi en lang streng, som er en såkalt hers. Det er generert med en hersingalgoritme, en krypteringsalgoritme, som ut ifra passordet lager denne hersen. Og det som skjer når du logger inn, er at man taster inn passordet, og så har man en algoritme som lager denne hersen, og så sammenligner man med det som ligger i Etch Shadow. Hvis det er det samme, så får du lov å logge. Vi kan se litt på de forskjellige hersingmetodene. Tidligere brukte man Dess, som er en relativt dårlig algoritme. Så brukte man MD5. Det brukes fortsatt i en del sammenhenger. Men det var noen mangler ved MD5, sånn at den litt lettere kunne knekkes i noen tilfeller. Så... I de senere årene har man gått over til Sja. Sja-256 og Sja-512. Dette er da antall bitt som er brukt i krypteringen. Jo flere bitt, jo vanskeligere er det å knekke. Og vi så på vårt eksempel at... Det sto en dollar seks først her i hashen. Og det betyr... At dette var sja512. Så det som skjer når vi krypterer passordet, det er at man... Eller når vi logger inn, så er det første som skjer, at man taster en passord. Og så vil loggenstillet kryptere passordet med en krypteringsalgoritme.", "source": "lecture"}
{"lecture_id": "linux5del1", "chunk_id": "linux5del1_0001", "start": 160.88, "end": 368.4, "token_count": 598, "text": "Jo flere bitt, jo vanskeligere er det å knekke. Og vi så på vårt eksempel at... Det sto en dollar seks først her i hashen. Og det betyr... At dette var sja512. Så det som skjer når vi krypterer passordet, det er at man... Eller når vi logger inn, så er det første som skjer, at man taster en passord. Og så vil loggenstillet kryptere passordet med en krypteringsalgoritme. Så får vi en lang hastereng. Så sjekkes den mot EtsShadow. Hvis den da er lik, så får du logge inn. Poenget er at det er vanskelig å gå den andre veien. Eller i praksis umulig å gå den andre veien herfra og tilbake og finne ut passordet. Tidligere lå dette passordet i Klarteks, så alle kunne se det for alle brukere. Det har man sluttet med, for det er mulig... Selv om det er umulig å gå denne veien, så er det mulig å bruke en såkalt brute force-metode for å knekke passord. Og det man gjør da, er at man sender inn en rekke forslag på passord. Man gjetter rett og slett. Typisk å gå gjennom alle bokstaver i alfabetet. Eventuelt noe som er smartere, Bruk en ordbok, gå gjennom alle ordene i ordboken. Kjøre krypteringsalgoritmen som brukes når man logger inn. Og så sjekke mot hashen her. Er det den samme, gjør man det for en million forskjellige passord. Og så plutselig får man en match, og da vet man passordet. Så på den måten kan det være mulig ut fra hasher å finne passordord. Selv om det ikke er passord i klartekst, så kan man da klare å finne det ut ved Brute Force. Vi skal se nå på hvordan vi kan... Hvordan vi kan klare det. Ja... Vi så her at den passordstrengen lå i Shadow. Eller i dette tilfellet åtte tegn her mellom... Etter dollar nummer to... Mellom dollar nummer to og dollar nummer tre. Der er det en streng. Og det er et såkalt salt. Og vi så at vi brukte sja5. Og det er mulig fra kommandolinja, og så... Med kommandoen MK-password. Hvis man da bruker...", "source": "lecture"}
{"lecture_id": "linux5del1", "chunk_id": "linux5del1_0002", "start": 314.16, "end": 453.52, "token_count": 391, "text": "Hvordan vi kan klare det. Ja... Vi så her at den passordstrengen lå i Shadow. Eller i dette tilfellet åtte tegn her mellom... Etter dollar nummer to... Mellom dollar nummer to og dollar nummer tre. Der er det en streng. Og det er et såkalt salt. Og vi så at vi brukte sja5. Og det er mulig fra kommandolinja, og så... Med kommandoen MK-password. Hvis man da bruker... Hvis man da spesifiserer hvilken algoritme det er, minus M... I vårt tilfelle så var det A512. Og så, hvis man i tillegg spesifiserer saltet, som var dette... Mellom andre og tredje dollartegn. Så kan man kjøre passordalgoritmen. Hvis jeg nå taster inn mitt passord på denne serveren, så vil du se at da kommer ut i andre enden... Jo, faktisk, da får vi til en match. Det er ikke så lett å se, men du ser de begynner på H6, CV, KIUD og sånn. Og så ser vi slutten. Den er også akkurat den samme som her. Dette skjer ved innlogging. Jeg taster inn passordet. Og så kjører skjellet denne kommandoen. Og så får du ut denne strengen og tester den. Er det det samme som i Shadow? Hvis det er det, så får jeg lov å logge. Denne metoden kan da brukes til å lage en brute force-passordknekker. Og det er det dere skal gjøre i første oppgave. Denne uka.", "source": "lecture"}
