{"lecture_id": "linux2del8", "chunk_id": "linux2del8_0000", "start": 0.0, "end": 206.14, "token_count": 588, "text": "Vi skal nå se på symbolske linker, eller lenke kan man også kalle det. Det er da lenker som peker fra et sted i filsystemet til et annet. Vi kan først se på hvordan man kan lage en symbolsk lenke til en mappe. Linker... Eller snarveier kan man også kalle det. La oss si jeg ønsker å lage en lenk til... Man skriver alltid til der man ønsker å... Eller til den mappen som finnes. Det som finnes fra før, er det første argumentet, og så... Den du ønsker å lage, er det andre argumentet. Nå lager jeg en lenke. Hvis jeg lister med minus L, så vil det si at her så har jeg en link... Og den starter med L, i motsetning til mapper som starter med D og filer som starter med en strek. Så... Da ser vi at dette er en link som peker på Jusubin. Så hvis jeg nå flytter meg til Mbin... Og gjør LS... Så ser vi... Jeg har hatt igjen masse filer, for det er alle de som ligger i user-bind. Men hvis jeg utfører PWD, så ser vi at det ser ut som jeg er i under min i M-bind. Hvis jeg går opp igjen også, så er jeg tilbake her hjemme. Men hvis jeg går ned, så kunne det vært nyttig å vite hvor jeg egentlig er i filsystemet. Det er en shell-bilt-in, så den flytter med i filsystemet. Men det finnes også en bind-P32D. Og hvis jeg bruker den, så får jeg se da hvor jeg er absolutt i filsystemet. Så kan jeg gå opp igjen. Man kan også lage pekere etter filer. La oss si... Da ser vi at den peker til bind PWD, det programmet der. Og så skal jeg bare kalle den for P. Da ser vi at jeg har en filpeker her nå, som P peker til bind PWD. Og da kan jeg utføre den kommandoen ved å taste P. Og da ser vi... Da utfører den... Dette er da en fil som peker til en annen fil. Dette er en moppe som peker til en annen moppe, så dette blir en slags snarvei. Mens dette her blir en slags alias for det programmet. Og det kan være nyttig hvis du ønsker at en versjon av et eller annet program skal peke til én bestemt versjon.", "source": "lecture"}
{"lecture_id": "linux2del8", "chunk_id": "linux2del8_0001", "start": 165.88, "end": 214.28, "token_count": 157, "text": "som P peker til bind PWD. Og da kan jeg utføre den kommandoen ved å taste P. Og da ser vi... Da utfører den... Dette er da en fil som peker til en annen fil. Dette er en moppe som peker til en annen moppe, så dette blir en slags snarvei. Mens dette her blir en slags alias for det programmet. Og det kan være nyttig hvis du ønsker at en versjon av et eller annet program skal peke til én bestemt versjon. F.eks. at Emax skal peke til emax21.34. Lag en link i systemet som gjør dette.", "source": "lecture"}
