{"lecture_id": "linux2del6", "chunk_id": "linux2del6_0000", "start": 0.0, "end": 189.4, "token_count": 589, "text": "Jeg skal nå se litt mer på det å slette mapper og filer. Så hvis vi tar utgangspunkt i det filset vi har her, så kan vi f.eks. prøve å slette mappen dir1 med kommandoen rmdir. Men det får vi ikke lov til, for den mappen er ikke tom. Så rmdir kan bare brukes til å slette tomme mapper. F.eks. så kan jeg... Jeg skal slette mappen Katt med rmdir. Den blir borte. Hvis jeg skal slette alt under... eller dir1 med alt innhold, så må jeg bruke rm minus r. Dir1. Sånn som det. Hvis jeg gjør det, så blir alt slettet. Så kan jeg jo da slette også enkelte filer. Hvis jeg f.eks. går inn... Her ligger det en fil.taxe. Da kan jeg ta RM på den. Så kan jeg også legge til minus I som en opsjon på RM, som da spør om du er sikker på at du skal slette den. Og da må jeg svare ja hvis jeg skal få slettet den. Ja... Noen andre kommandoer som er nyttig å kunne, det er... Ja, for det første... Da er det nyttig å kunne finne filer. Og det finnes en kommando som heter locate, som finner filer på hele systemet. Her finner den alle filer som heter fil.takec. Hvis jeg f.eks. prøver å finne et password, som jeg vet finnes på systemet, så ser vi at den leter også overalt. Og databasen er ganske rask, Skal vi se. Men la meg lage en fil under dir2, som heter fil.txc. Så kan jeg prøve å finne den. En annen kommando for å finne, det er find. Den fungerer uavhengig av den locate-databasen. Så den bruker ganske mye tid, for den leter da etter rekkertskifte. Men jeg kan f.eks. si finn i dir.2, og så ønsker jeg å finne navnet fil.taxe. Da ser du at jeg finner den. Mer vanlig er kanskje å si finn. Altså finn her og under denne filen. Noe som også nyttig er å legge på en stjerne for å finne alle filer som har filer. Hva er noe med.il. f.eks.? Da finner jeg også denne, siden her står det.il. på den måten.", "source": "lecture"}
{"lecture_id": "linux2del6", "chunk_id": "linux2del6_0001", "start": 145.4, "end": 296.6, "token_count": 464, "text": "Så den bruker ganske mye tid, for den leter da etter rekkertskifte. Men jeg kan f.eks. si finn i dir.2, og så ønsker jeg å finne navnet fil.taxe. Da ser du at jeg finner den. Mer vanlig er kanskje å si finn. Altså finn her og under denne filen. Noe som også nyttig er å legge på en stjerne for å finne alle filer som har filer. Hva er noe med.il. f.eks.? Da finner jeg også denne, siden her står det.il. på den måten. En generell nyttekommando, det er grep. Og det kan vi bruke for å finne... For eksempel... La oss si jeg ønsker å finne alle brukernavnene som har strengen 1234 i mappen... Nei, i filen. Det kan jeg gjøre sånn med grep. Det var ingen, men hvis jeg prøver med 123, så ser vi at der var det straks ganske mange. Og det vil si grep 123, den vil da finne alle linjer med forekomsten 123 i filen hetsepassord. En annen ting som er nyttig, er å kunne telle. Hvis jeg ønsker å telle antall linjer i ett passord, så kan jeg gjøre det sånn med Word count, dobbelt c, minus l. Den gir linjene. Hvis jeg ikke har med minus l, så vil du se at den også teller ord og tegn. Så dette betyr at det er 4830 linjer i ett passord. Det kan være nyttig å kunne kombinere denne type kommandoer. Hvis jeg først tar grep 123, så så vi at det var ganske mange linjer der. Hvis jeg ønsker å telle det, så kan jeg pipe og sende det til WC min selv. Da teller jeg 30 linjer i 1C-passord som inneholder tegnene 123.", "source": "lecture"}
