{"lecture_id": "linux11del16", "chunk_id": "linux11del16_0000", "start": 0.0, "end": 209.92, "token_count": 593, "text": "Vi har sett at LS og PS, og også alle andre command lets, de er veldig kraftige ved at de ikke bare sender ut tekst som resultat, men hele objekter. Men det er kanskje først når man bruker disse objektene i small script og onlinere, at man virkelig kan se hvor kraftige de er. Da skal jeg bare lage ett eksempel eller et par eksempler. Hvis man bruker Foreach, så er syntaksen noe sånt som dette her. Foreach dollar LS in LS... For eksempel stjerne.tk. Da lister jeg alle filer med exception.tk. Vi ser at syntaksen ligner igjen veldig på bæsjsyntaks. Men den er litt annerledes. Men det kan gjøre... Dette vil nå være løkken, så inni her så kan jeg da ta f.eks. en variablesum. Og så kan jeg legge sammen lengden av... Denne one-lineren her, den vil da ta og gå gjennom alle filer, og så vil den legge sammen lengden av de filene. Vi kan jo først se hva man egentlig får. LS-stjerne.taxi - jo, vi får ut de filene her. Summen her nå skulle da være summen av alle de filene. Så den vil være summen av de tretallene her. 8020 bite er da sørgelsen på filmen. Vi ser med en gang hvor lett det er å plukke ut dette her. Hvis vi skulle gjøre det samme i et liningskjell, så måtte man behandle teksten her og plukke ut akkurat den strengen med kanskje noe cut osv. Og så legge sammen. Så dette er en veldig elegant måte å gjøre det på. På samme måten ville man lagt inn et... Neste uke skal vi drive masse med det. Jeg vil også vise en litt annen måte man kan gjøre mye av det samme på. Som er en powerful, enda mer kraftig måte å bruke pipes på. Der man kan sa... Vi kan gjenta det samme eksempelet. LS-stjerne.tk. Så kan jeg pipe det til en... En for each-konstruksjon. Ikke bare for each, men for each object. Da vil nå hvert objekt behandles inne i denne konstruksjonen. Og da gjør jeg litt av det samme som jeg gjorde der oppe. Jeg tar sum, og så skal jeg prøve nå å legge til for each object for hvert av de objektene.", "source": "lecture"}
{"lecture_id": "linux11del16", "chunk_id": "linux11del16_0001", "start": 160.8, "end": 321.0, "token_count": 470, "text": "Som er en powerful, enda mer kraftig måte å bruke pipes på. Der man kan sa... Vi kan gjenta det samme eksempelet. LS-stjerne.tk. Så kan jeg pipe det til en... En for each-konstruksjon. Ikke bare for each, men for each object. Da vil nå hvert objekt behandles inne i denne konstruksjonen. Og da gjør jeg litt av det samme som jeg gjorde der oppe. Jeg tar sum, og så skal jeg prøve nå å legge til for each object for hvert av de objektene. Som sendes ut av lsstjerne.xe. De blir nå pipet, og så blir de tatt imot her. Så ønsker jeg å øke lengden. Nå har jeg ikke definert noen dollar ls, men da er det en default variabel, også hentet fra Linux selv. Dollar underscore. Den vil da være... Etter hvert som løkka løper gjennom, så vil den dollar underscore være verdt objekt. For hver gang inne i løkka, så vil dollar underskår være en ny fil. Og da kan jeg legge sammen lengden på vannbåten. Og så kan jeg skrive summen. Det ser jo litt rart ut. Summen blir det dobbelte. Og det skyldes rett og slett at jeg ikke har initiert variabelen sum. Og det kan jeg også gjøre. I starten her så kan jeg si dollar sum er lik null. Så, som i bæsj, så vil semikolon gi skille i neste... Semikolon vil kunne skille mellom to kommandoer. Så vil de to kommandoene utføres etter hverandre. Nå får sum den rette verdien. Så kan jeg legge til summe til slutt. Da får jeg straks en liten one-liner, som regner ut lengden av alle doptex-trefilder og legger dem sammen. Så på denne måten skal vi se hvor kraftig forskjellen er.", "source": "lecture"}
