{"lecture_id": "linux3del8", "chunk_id": "linux3del8_0000", "start": 0.0, "end": 198.1, "token_count": 599, "text": "Omdirigering til og fra kommandoer med pipes... Det har vi allerede gjort mange ganger. F.eks. så har vi gjort kommandoer som dette her. PCAUX gir ofte mye outfit, så da kan vi pipe det til kommandoen'more'. Da får vi outfit side for side. Det går også an å... Før man piper til'more', så kan man pipe det til... Plukke ut alle linjer med Haugerud, og så pipe det videre til Moore. På den måten så får man et rørsystem som man sender kommandoer mellom. Eller output fra én kommando går som input til neste. Og da kan man sette sammen kommandoer slik man vil, sånn at man får utført nøyaktig det man ønsker. Et annet eksempel... La oss si man tar Cat på passordfila. Da sendes den til terminal. Men i dette tilfellet så kanskje vi ønsker å sortere linjene her. Da kan vi pupe ut et sort. Sort sorterer da alfabetisk på første bokstav av linjen. Og så kan vi, istedenfor å sende videre til en kommando, så kan vi sende til en fil. Og da ligger den sortert utgave av passordfila inne i fil.tkst. Anis kommer først her. A, C og så videre. Alfabetisk. Det som skjer da, er... Egentlig, når vi lager disse kommandoene, så tar vi da det første eksempelet. Så sendes Standard out fra PCA-WX. Alle de linjene. De sendes inn i Standard in tomorrow. Og så kan man ta Standard out videre og sende til grep, f.eks. Så på den måten så får man et rødskyss hjem. Det andre eksempelet vi hadde, Cat eats the password. Da ser vi... Eats the password sendes inn til Standard in for Cat. Og Standard out for Cat sendes videre til... Så tar vi den kanalen og sender inn i Filot-tekster. Og det kan faktisk eksplisitt skrives på denne måten. Så kan man eksplisitt skrive at jeg ønsker... 8C-passord skal inn i CAT. Default funker sånn som det her. Man kan også med den mindre enn tegne, så ser vi veldig tydelig at etce passord sendes inn til Cat, og det som går ut fra Cat, sendes inn i Sort. Så på den måten har man et veldig kraftig system for å sette sammen kommandoer.", "source": "lecture"}
{"lecture_id": "linux3del8", "chunk_id": "linux3del8_0001", "start": 157.24, "end": 343.88, "token_count": 588, "text": "Og det kan faktisk eksplisitt skrives på denne måten. Så kan man eksplisitt skrive at jeg ønsker... 8C-passord skal inn i CAT. Default funker sånn som det her. Man kan også med den mindre enn tegne, så ser vi veldig tydelig at etce passord sendes inn til Cat, og det som går ut fra Cat, sendes inn i Sort. Så på den måten har man et veldig kraftig system for å sette sammen kommandoer. At man kan sette sammen kommandoer av mange små kommandoer, eller at man kan effektivt løse mange oppgaver fra kommandoene. Nå skal jeg vise et eksempel på det. Hvor vi tar PSA og AX... Og det jeg ønsker nå, er å plukke ut første del av PSA og AX. Hvor det står brukernavn... Hvis du ser i første kolonne her, så står det brukernavn. Det fins flere måter man kan gjøre det på, men kanskje den enkleste... Den som går mest frem, er å bruke et hjelpeprogram. Og det har en litt spesiell syntaks, men i hvert fall på denne måten. Print-dollar-1, så vil Åk... Det som er inni her, det er en kommando, dette er bare syntaksen til programmet Åk. Så vi piper nå alle dataene til Åk, og så på denne måten her, så kan vi få Åk til å printe ut det første ordet, den første kolonnen. Hvis vi gjør det, så kommer det da en masse brukernavn, men det er bare den kolonnen som vi får ut. La oss si vi ønsker å telle antall brukernavn. Så kunne vi jo pipe dette til wc minus l. Men da teller vi igjen bare antall linjer. Men for å få ut antall brukernavn, så kan vi gjøre et lite triks. Først pipe dette til sort, for da sorterer vi sånn at... Vi kan se hvordan det ser ut. Sånn at alle bruker noen kommer etter hverandre. Alle med Ruth kommer etter hverandre. Og så kan vi sende det videre til en kommando som heter Unique. Den gjør sånn at hvis det kommer mange like ord etter hverandre, så plukker den bare ut ett. Og da får vi straks en niste. Med alle brukere som har en kjørende prosess. Og så kan vi til slutt pipe den videre til wc-minusert, som teller antallet.", "source": "lecture"}
{"lecture_id": "linux3del8", "chunk_id": "linux3del8_0002", "start": 300.0, "end": 361.84, "token_count": 208, "text": "Først pipe dette til sort, for da sorterer vi sånn at... Vi kan se hvordan det ser ut. Sånn at alle bruker noen kommer etter hverandre. Alle med Ruth kommer etter hverandre. Og så kan vi sende det videre til en kommando som heter Unique. Den gjør sånn at hvis det kommer mange like ord etter hverandre, så plukker den bare ut ett. Og da får vi straks en niste. Med alle brukere som har en kjørende prosess. Og så kan vi til slutt pipe den videre til wc-minusert, som teller antallet. Og dermed får vi ut at 13 brukere har kjørende prosesser. Det er egentlig ikke helt nøyaktig, men det er en oppgave som spør om akkurat det. Hvorfor det er en feil på én i det tallet. Det overlater vi til oppgaven.", "source": "lecture"}
