{"lecture_id": "linux1del9", "chunk_id": "linux1del9_0000", "start": 0.0, "end": 179.98, "token_count": 600, "text": "Litt om oppgaver. Generelt når det gjelder oppgaver, så... Når man skal dokumentere at man har gjort en oppgave, så holder det lenge å bare copy og paste tekst fra de kommandoene du har gjort. Hvis du f.eks. har gjort... Ja, la oss si youname minus a. Du skal vise at du har gjort det. Så kan du ta den... Den teksten som står her. Og så bare... copy og så peise ned et dokument. Og så levere det. Så det holder lenge som dokumentasjon. Litt generelt om oppgavene denne uken. Det er bl.a. en oppgave hvor du skal bruke topp. Og topp, det er elkommandoen jeg har skrevet nå. Det er en kommando som viser fortløpende prosesser som står og kjører. Den stopper man med å tasse Q. Q, så kommer jeg ut igjen. Kontroll-L, så får jeg en clear screen. Men så skal man i den oppgaven også gjøre en kommando som heter PSAOX. Hvis du gjør den, så kommer det en masse linjer. Det er alle prosessene som står og kjører. Og da skal man i oppgaven også bruke grep. Og da setter man først en pipe. Dette er en pipe som sender nå alle dataene som kommer ut, alle linjene fra PSAUX. Det sendes nå videre til et annet program som heter GREP. Og i det GREP-programmet så kan jeg f.eks. grepe på tekst. Og f.eks. så kan jeg grepe på linjen eller på teksten 3.18329. Både linjer i PSA og X hvor dette brukernavnet står. På den måten. Og så går videre av oppgaven ut på at du skal lage et skript som gjør dette her. Og til slutt så skal skriptet virke på en sånn måte... Skripte PS-user. Det skal virke på en sånn måte at hvis du skriver f.eks..ps-user og så S318... Som et argument. Det som kommer da etter skriptet S318. Jeg kan legge på 318329. Det som kommer etter skriptet, det er argumentet. Og når jeg kjører det, da, så skal jeg i praksis gjøre det som står her oppe. Og det som må skje inni skriptet da, det er at S318329, det må legges på en måte bakerst i den kommandolinjen der.", "source": "lecture"}
{"lecture_id": "linux1del9", "chunk_id": "linux1del9_0001", "start": 144.4, "end": 225.0, "token_count": 295, "text": "at hvis du skriver f.eks..ps-user og så S318... Som et argument. Det som kommer da etter skriptet S318. Jeg kan legge på 318329. Det som kommer etter skriptet, det er argumentet. Og når jeg kjører det, da, så skal jeg i praksis gjøre det som står her oppe. Og det som må skje inni skriptet da, det er at S318329, det må legges på en måte bakerst i den kommandolinjen der. Og det kan man gjøre ved å bruke en spesiell variabel som heter dollar... dollar 1. Det første argumentet til skript, det vil legges internt i skriptet i en variabel som heter dollar 1. Så dermed så kan man inni skriptet bruke den verdien. Det skal vi snakke om senere, men prøv å få det til nå, sånn at du kan kjøre det skriptet her med vilkårlige kommandoer. Nei, vi vil kåre argumenter. For eksempel kan jeg i stedet sag... Og da skrives ut alle linjer som inneholder Ruth. I stedet for alle med 3.18,329.", "source": "lecture"}
