{"lecture_id": "linux4del12", "chunk_id": "linux4del12_0000", "start": 0.0, "end": 222.08, "token_count": 587, "text": "Vi skal nå se litt på en helt spesiell mappe som heter Prock. Og den ser ut som en vanlig mappe med filer. Vi kan ta ls-prock slash-prock. Den ligger øverst i roten. Den inneholder da en masse mapper og filer, ser det ut som.  F.eks. inneholder den en mappe som heter CPU-info. Som er ganske lang. Den inneholder da informasjon om CPU-en som kjører på den maskinen. Her er en intel CH. Og masse annen informasjon om CPU-en. Så har den f.eks. mer info. Sånn som... Meminfo, som sier hvor mye minne du har, og masse andre minneparametere. 32 gigabyte-minne, gigabyte-minne og en rekke andre minneparametere, som vi kommer tilbake til litt senere. Men egentlig så er ikke slash-prock et vanlig fil-system. Det som ligger i prock, er dynamisk. Så det er et slags sånn... Vinduet inn til operativstemfjernen hvor man kan hente ut verdier. Og det er også mulig å sette verdier. Nå skal vi først se på... Inni Proc så sto det masse tall. Og hver av disse tallene er en prosess i det. Så for hver prosess så er det en egen mappe i Proc som inneholder... Vi kan prøve å se hvordan det ser ut ved å prøve å kjøre en wildlucky som skriver ut payday-en. Der ser vi prosessen her. En payday 13.76. Da skal det finnes en egen mappe som starter på 13.3. Det er en mappe, så vi kan ta LS på den. Der ser vi det ligger en masse informasjon. For eksempel så skal det ligge et navn på kommandolinjen. Som kjøres. Nå tok vi LS, men vi setter CAT på den. Det er den kommandoen som da ble kjørt for å sette i gang denne payday. Og da ser vi at dette er dynamisk. Det er informasjon som du... Ikke ligger i filmen, men som du henter ut direkte fra kjernen. Det vi også kan prøve da, er å se på en spesiell fil her som heter STAT, som hver prosess har. Den inneholder en del sånn informasjon om prosessen som kjører. En av de er hvor mye tid den bruker, eller hvor mye tid den har brukt. Mer presist så gir den antall tics som prosessen har brukt", "source": "lecture"}
{"lecture_id": "linux4del12", "chunk_id": "linux4del12_0001", "start": 185.16, "end": 291.36, "token_count": 320, "text": "Det er informasjon som du... Ikke ligger i filmen, men som du henter ut direkte fra kjernen. Det vi også kan prøve da, er å se på en spesiell fil her som heter STAT, som hver prosess har. Den inneholder en del sånn informasjon om prosessen som kjører. En av de er hvor mye tid den bruker, eller hvor mye tid den har brukt. Mer presist så gir den antall tics som prosessen har brukt i use mode og corner mode. Og en tic er på et hundredels sekund. Så her er det masse detaljer om prosessen. Det kan vi se på ved å... Vi kan bruke en kommando som heter watch. Watch gir verdien av kommandoen du gir etterpå, hvert andre sekund. Eller, du kjører den hvert andre sekund, og så kan vi se hvordan verdiene utvikler seg. Her er et par verdier som faktisk endrer seg. Dette er antall tics i use mode og i kernel mode. For denne prosessen. Den bruker ganske mange tics. 100 tics tilsvarer 1 sekund med CPD-tid. Det er fordi denne står og kjører. Så alt i alt så gir... Så ligger det under PROK en masse informasjon om systemet, alle prosessene og alt som foregår inni datamaskinen.", "source": "lecture"}
