{"lecture_id": "linux7del2", "chunk_id": "linux7del2_0000", "start": 0.0, "end": 213.44, "token_count": 585, "text": "Men vi skal se på hva er... Hva er dere? Ja. Igjen tar vi utgangspunkt i... Dette er Prakmas utgangspunkt, med at man har en developer som sitter her oppe øverst i diagrammet og skal skrive kode, som så skal bygges og kjøres. Og da, som sagt, i motsetning til å ha store releaser, som er hvert halvår eller festival hver måned, så releases fortløpende kode fra developeren. Og kjører gjennom hele kjeden her. Inkludert automatiske tester. Og da gjør det å bruke containere... Det gjør dette mye enklere. Det er det som kanskje muliggjør dette i det hele tatt. Derfor er det en sentral del i Continues Delivery. Ideen med konteinere i det hele tatt er den samme som på konteinerskip. At man skal lage en enhet, en liten server, som passer sammen. Her oppe er det dokker. Konteinerne er bygd sånn at de lett kan stables oppå hverandre. Det er også ideen med dokker i dataverden. Man kan få en liten enhet og sette den til å kjøre hvor som helst. I motsetning til tidligere tider, hvor man hadde store servere som kjørte i maskinrom. De var veldig vanskelig å endre på. Og ikke minst var det vanskelig for utviklere å utvikle kode som fungerte, på mange forskjellige typer servere. Nå er alt det forenklet enormt ved hjelp av Datagym. Vi kommer nok litt mer til å se på bakgrunnen for dere litt mer teoretisk etter hvert. Hvordan den kan brukes. Det er en del begreper her. Det vi skal konsentrere oss om, er Docker Engine. Som på en måte er den installasjonen vi har gjort på Linux-VM-ene. Vi har allerede installert dokker, så for dere skal det bare være å logge inn på Linux-VM. Da kan dere bare kjøre dokker. Det skal vi se på i første praktiske del. I tillegg har man dokkerhub. Det er etter hvert veldig viktig. Det skal vi se mer på i neste uke. Det er litt sånn som github, hvor man kan laste ned kode til prosjekter. På dokkerhub kan man laste ned hele servere og hele systemer som dokker-images. Og så kan man kjøre det.", "source": "lecture"}
{"lecture_id": "linux7del2", "chunk_id": "linux7del2_0001", "start": 168.94, "end": 243.98, "token_count": 207, "text": "Vi har allerede installert dokker, så for dere skal det bare være å logge inn på Linux-VM. Da kan dere bare kjøre dokker. Det skal vi se på i første praktiske del. I tillegg har man dokkerhub. Det er etter hvert veldig viktig. Det skal vi se mer på i neste uke. Det er litt sånn som github, hvor man kan laste ned kode til prosjekter. På dokkerhub kan man laste ned hele servere og hele systemer som dokker-images. Og så kan man kjøre det. Det er det som skjer når man kjører dokker Hello World, som er det første vi skal gjøre. Da lastes det ned et lite image. Og så kjøres det på lokalmaskin. Så er det dokkemaskin og dokke-composed. Det er begreper som vi ikke kommer Styre litt større systemer.", "source": "lecture"}
