{"lecture_id": "linux10del3", "chunk_id": "linux10del3_0000", "start": 0.0, "end": 228.78, "token_count": 598, "text": "OK. Da skal vi se litt mer på virtualisering og prinsippene for virtualisering. Og aller først litt historie. Virtualisering regnes jo som et moderne begrep ofte. Men faktisk så drev IBM med virtualisering på sine stormaskiner allerede på 60-tallet. Så var det stort sett fysiske maskiner det gikk i, både i desktopper og ikke minst servere. Den første vitaliseringsløsningen for X86 Intella AMD, det var BMW-er i 1999. Så det er ca. 20 år siden. Det var den spede begynnelsen. Og deretter fulgte Send, som... Det er et virtualiseringssystem som dere kjører på deres Linux-VM-er. Virtual Box har dere kanskje vært borti, og KVM som vi skal se på senere i dag. Og mange andre. Microsoft har jo virtualisering, og også... Ja, VM-er er kanskje en av de aller største. Så var det et viktig punkt, og det var i 2005 som kom... Før det så var det... i praksis så var det ikke mulig å lage virkelig virtualisering. Hvor operativsystemet er helt uendret. Før det så måtte man bruke en del adhoc-metoder. For å komme rundt det at X86-hardware ikke støttet virtualisering. Vi skal se på nøyaktig hvordan virtualisering ble støttet for X86 i 2005. Det var et tidlig arbeid av påpeker Goldberg fra 1974, som så litt mer sånn i store trekk på hva som skal til for å kunne virtualisere en maskin. Man skal kunne kjøre et operativsystem på en virtuell maskin. Det de sa da, var at en maskin kan bare virtualiseres hvis alle sensitive institusjoner også er privilegerte institusjoner. Vi skal nå se litt på hva det egentlig betyr.  En sensitiv institusjon er en institusjon som bare kan utføres i cornal mode. Og da tenker vi typisk på sånne... Institusjoners rom som Holt, f.eks. I use mode så kan det ikke være sånn at en hvilken som helst prosess kan skru av maskinen. Det er da en sensitiv institusjon. En privilegert institusjon er en institusjon som forårsaker en trapp til cornal mode, hvis den gjøres i use mode. Det betyr at hvis du i use mode utfører en privilegert institusjon,", "source": "lecture"}
{"lecture_id": "linux10del3", "chunk_id": "linux10del3_0001", "start": 182.52, "end": 385.48, "token_count": 586, "text": "En sensitiv institusjon er en institusjon som bare kan utføres i cornal mode. Og da tenker vi typisk på sånne... Institusjoners rom som Holt, f.eks. I use mode så kan det ikke være sånn at en hvilken som helst prosess kan skru av maskinen. Det er da en sensitiv institusjon. En privilegert institusjon er en institusjon som forårsaker en trapp til cornal mode, hvis den gjøres i use mode. Det betyr at hvis du i use mode utfører en privilegert institusjon, så vil da systemet trappe til kjernen. Da vil kjernen få et varsel. Så kommer kjernen inn. Så behandler den kallet etter det. Sånn som f.eks. skjer i et systemkall. En institusjon som er et eksempel på dette er POPF, som skrur av og på intervjus. Det er en sensitiv institusjon. Den kan bare utføres i Kölnmoll. Utføres den i husimot, så skjer det ingenting. Så da bare ignorerer maskinen det som skjer. Akkurat som med for eksempel NOP. NOP betyr no operation. Ingenting skjer hvis den institusjonen utføres. Og det skal vi se, det er et problem for virtualisering. Og det er det som ikke må skje. Påpeker Goldberg sier her at alle sensitive institusjoner De må også være privilegerte. Mens dette er da en sensitiv institusjon. Når den utføres, så skjer det ingenting. Det Goldberg påpeker, er at en sånn institusjon, når den utføres, den må trappe. Den må være privilegert. Den må trappes sånn at operativsystemet vet hva som Et eksempel på en annen sensitiv instruksjon er CLI, clear interrupt flag. Men den er også privilegert. Hvis den utføres i user mode, så gjøres en trapp til corner mode. Og dette går fint med virtualisering. Vanlige institusjoner som vi stort sett har sett på, som ADAL, CMP og Move osv., De kan kjøres i user mode uten problemer, og man kan få utført akkurat det man vil. Men det som er problemet, er at et virtuelt operativsystem kjører i user mode. Det er et spørsmål om hva X86 er. Ja, det er på en måte Assembly, men...", "source": "lecture"}
{"lecture_id": "linux10del3", "chunk_id": "linux10del3_0002", "start": 335.04, "end": 460.66, "token_count": 340, "text": "Hvis den utføres i user mode, så gjøres en trapp til corner mode. Og dette går fint med virtualisering. Vanlige institusjoner som vi stort sett har sett på, som ADAL, CMP og Move osv., De kan kjøres i user mode uten problemer, og man kan få utført akkurat det man vil. Men det som er problemet, er at et virtuelt operativsystem kjører i user mode. Det er et spørsmål om hva X86 er. Ja, det er på en måte Assembly, men... Når jeg sier X86, så snakker jeg da om hele det institusjonssettet. X86 er det institusjonssettet som defineres av AMD og Intel. Så alle de prosessorene som de lager, som er da... De prosessorene som brukes av så å si alle servere og desktopper i verden. De bruker X86-institusjoner. Popf er en X86-institusjon. Det betyr at det er en institusjon som finnes i alle Intel- og IMDi-CPU-er. Det samme gjør Chalmé, eller Ad, Comp og Move osv. I Assembly bruker vi disse X86-institusjonene helt direkte. Men det fins også Assembly for andre institusjonssett. Arm, som er arkitekturen til mobiler, de bruker Arm Assembly. Der kan man skrive Arm Assembly. De bruker Arm Institution.", "source": "lecture"}
