{"lecture_id": "linux5del10", "chunk_id": "linux5del10_0000", "start": 0.0, "end": 257.8, "token_count": 589, "text": "Tilsvarende kan denne teknikken f.eks. brukes til å lese fra PCAWX. PCAWX vil da ha en rekke... Skriv litt... En rekke linjer, som starter med brukernavn, så UD, altså en del forskjellig informasjon om prosessene. Så vi kan prøve å lage nå en tilsvarende konstruksjon som utfører PSAOX, og så pipe alle dataene til valgkonstruksjonen. Nå vil jo da feltene være noen andre. Men det første feltet er fortsatt brukernavnet. Og så etter brukernavnet så kommer... La oss si nå at vi ikke er interessert i resten, så kan vi bare si... Bare kalle resten for X. Da vil resten av linjen tilhøre X. Så... Da kan vi se... Har... Har prosess... Har prosess payday. På den måten. Da skal vi ikke sende inn passord. Og sånn kan vi løpe gjennom alle prosesser. Da kjører vi wire.shell og så sender vi den til MORE. Den begynner nå øverst, brukernavn User har Prosess by ID. Det er fra den første linja, men dette er brukernavn Ruth, har Prosess 1 osv. Hvis vi f.eks. ønsker å få ut... Navnet på programmet, så kan vi legge inn... Da er det et antall felter før... Den siste er Prog. Skal vi se om dette blir riktig. Vi kan prøve oss frem. Har prosess... Det så ikke riktig ut. Da kan vi igjen se hva PSA og X egentlig gir. Så PayD, og så er det én, to, tre, fire, fem, seks, syv... åtte felter. Så da kan vi gå tilbake til skriptet og se hvor mange felter vi må legge inn før programmet kommer. Og det var én, to, tre, fire... Ja, det ser ut som åtte. Bra. Én til, da. Ja. Nå ser vi hva som var feil. Vi skriver fortsatt ut \"-pady\". Vi må skrive -prog. Sånn. Hvis vi kjører nå... Så ser vi brukerne rundt, har prosess, Espen innitt, osv. nedover. For hver bruker. Bruker han Haugerud, har prosessbæsj der. Så på den måten så kan man løpe gjennom alle elementene i PSA og X. Så kan man jo i tillegg...", "source": "lecture"}
{"lecture_id": "linux5del10", "chunk_id": "linux5del10_0001", "start": 201.76, "end": 383.38, "token_count": 447, "text": "Og det var én, to, tre, fire... Ja, det ser ut som åtte. Bra. Én til, da. Ja. Nå ser vi hva som var feil. Vi skriver fortsatt ut \"-pady\". Vi må skrive -prog. Sånn. Hvis vi kjører nå... Så ser vi brukerne rundt, har prosess, Espen innitt, osv. nedover. For hver bruker. Bruker han Haugerud, har prosessbæsj der. Så på den måten så kan man løpe gjennom alle elementene i PSA og X. Så kan man jo i tillegg... Så kan dette brukes da til å f.eks. sjekke if... Er lik... La oss si høyre. Sånn som det. Så kan vi akkurat for den brukeren... Så kan vi skrive ut verdien... Eller navnene på programmet. Sånn. Hvis vi nå stopper den og kjører... Så får vi igjen en syntaksfeil. Der står det 'iften'... Ja, her skal man se at her er det mangler en apostrof. Jeg kan altså se på fargene på auditoren. Hvis jeg kjører nå, så får jeg ut ingen. Og det... var merkelig, for noen av prosessene har brukerne høyere. Og da ser vi hva som er feil her. Her er det mangler en dollar. Da kjører vi på nett. Og da ser vi at her skrives det bare ut prosesser. Du får de linjene hvor man har brukernavn Høyre. Så kun de skrives ut. Så på den måten kan man løpe gjennom PSA og X, etc. password og alle andre typer filer med en wireløkke, og så kan man behandle linje for linje. Den type skript er genelt veldig nyttig å kunne skrive.", "source": "lecture"}
