{"lecture_id": "linux4del6", "chunk_id": "linux4del6_0000", "start": 0.0, "end": 191.5, "token_count": 590, "text": "Fåløkker er det veldig viktig å kunne i shadeskripting, for det bruker vi hele tiden. Så syntaksen for en fåløkke er rett og slett 'får' og så en variabel. Det er et variabelnavn man finner på selv. Kaller den Vari, f.eks. Inn, og så kommer det bare en liste med et eller annet. F.eks. la oss si jeg bare skriver en liste på to og tre... Og så er syntaksen do. Altså inni den løkka, så skal vi gjøre følgende. Og så kommer det linjer som vi skal skrive ut. Og da kan vi jo f.eks. i dette tilfellet skrive ut dollarvari. Så kan vi gjøre noe med litt mer. Variabel er her... Vari. Sånn. Og eventuelt... flere linjer med det vi skal gjøre. Pause. Bare å skru ut noe, og så Don. Og da ser vi at vi går gjennom løkken, og så først får variabelen H1. Så skriver vi ut akkurat dette her, og H1 endrer seg nedover. Den generelle syntaksen for løkker. Hvis man skal ha noe hjelp for sånt som dette, så kunne man jo prøve Man4, men det er ikke noe manual entry for 4. Og det er fordi 4 er skjell-keyword, så det er bygd inn i skjellet. Så hvis man har et skjell-keyword, så må man i stedet skrive help. Og da er dette den generelle syntaksen. De listene i Ford, det kan være veldig mye. F.eks. kunne vi tenke oss å løpe gjennom LS. Output fra LS. Og da kan jeg legge det inn i denne... Jeg får løkken. Var den litt lang, så jeg kan f.eks. ta... La oss si... At jeg i stedet bare skriver ut... \"... ekkodollarvari\". Sånn. Sånn det er. Og så kan jeg nå i stedet si... OK, her ønsker jeg en liste med LS. Da kan jeg ikke bare skrive eller sånn. Det... Da får jeg bare... I stedet si... OK, her ønsker jeg en liste med LS. Da kan jeg ikke bare skrive eller sånn. Det... Da får jeg bare... Så jeg må utføre den kommandoen. Men da har vi sett tidligere at da har vi en egen konstruksjon med parenteser.", "source": "lecture"}
{"lecture_id": "linux4del6", "chunk_id": "linux4del6_0001", "start": 158.68, "end": 351.0, "token_count": 586, "text": "At jeg i stedet bare skriver ut... \"... ekkodollarvari\". Sånn. Sånn det er. Og så kan jeg nå i stedet si... OK, her ønsker jeg en liste med LS. Da kan jeg ikke bare skrive eller sånn. Det... Da får jeg bare... I stedet si... OK, her ønsker jeg en liste med LS. Da kan jeg ikke bare skrive eller sånn. Det... Da får jeg bare... Så jeg må utføre den kommandoen. Men da har vi sett tidligere at da har vi en egen konstruksjon med parenteser. Sånn utfører vi en kommando. Så da vil LS utføres, og så returnere de verdiene her oppe. Så får vi én linje for hver verdi som LS utfører. Eller som LS finner. En vilkårlig kommando her inne. Et annet eksempel er at man kan se på innholdet i en fil. Her er innholdet i den filen 123. Da kan jeg skifte ut den kommandoen, og så kan jeg si... Ops... Tok en... Ja, tar den på nytt. Så kan jeg i den kommandoen som skal inngå i listen, skrive ut fil. Da vil jeg skrive ut filen her, og så vil den på hver linje i filen gå inn og utføre kommando. Så på denne måten kan man løpe gjennom det meste i et skjell. En litt annen måte å gjøre det på er å skrive... Stjerne. Stjerne generelt, det gir... alt som er i mappen. Så kunne jeg f.eks. la oss si at jeg skulle løpe gjennom alle filer som ender på tekst t. Da kan jeg gjøre det på den måten. Så kunne jeg også legge inn en variabel. La oss si... Var... La oss si jeg setter den til LS, sånn at var nå inneholder LS. Da kunne jeg også løpe gjennom alle elementene i den variabelen på denne måten. Så da innholdet var de fire strengene her, så løper forlokken igjennom. Denne måten å bruke folk på, Det bruker man hele tiden. Så det går også an å skrive en mer tradisjonell forløkke. Igjen så er det da den syntaksen vi bruker i nummerikk og i matte, nemlig med doble parenteser. Og her, så kan du, hvis du foretrekker det,", "source": "lecture"}
{"lecture_id": "linux4del6", "chunk_id": "linux4del6_0002", "start": 315.28, "end": 387.96, "token_count": 223, "text": "alle elementene i den variabelen på denne måten. Så da innholdet var de fire strengene her, så løper forlokken igjennom. Denne måten å bruke folk på, Det bruker man hele tiden. Så det går også an å skrive en mer tradisjonell forløkke. Igjen så er det da den syntaksen vi bruker i nummerikk og i matte, nemlig med doble parenteser. Og her, så kan du, hvis du foretrekker det, så kan du skrive mer vanlig java-syntaks i lik null i mindre enn fem. I pluss-pluss, sånn som det. Og så kan man sette du og Don. Ekko... La oss si vi bare skriver ut tallet. Og Don på den måten. Så det er en... En enklere måte å skrive forløpet på hvis du liker Javar-lignende syntaks.", "source": "lecture"}
