{"lecture_id": "linux6del5", "chunk_id": "linux6del5_0000", "start": 0.0, "end": 222.3, "token_count": 598, "text": "Noe som er litt praktisk, og som er spesielt hvis man skal automatisere, er å kunne logge inn på andre Linux-servere uten å taste passord. Så jeg skal prøve å demonstrere hvordan man kan gjøre det til en annen bruker på StuddSSH. Så nå har jeg en testbruker på StuddSSH, S318329. Og da kan jeg jo logge meg inn på StudSSO. Det var feil... Da kan jeg logge meg inn med passordet til brukeren. På denne måten. For det første er det tungvint å skrive passord hver gang. For det andre så er det faktisk et sikkerhetsproblem. Hvis du har passord, så kan det gjettes. Så hvis jeg nå går tilbake, så fins det en metode for å sette opp passordløs tilkobling. Og da må man lage et nøkkelpar. Og det gjør man med kommandoen SSHIJEN. Denne kommandoen genererer da et nytt nøkkelpar. Og du blir spurt hvor du vil legge disse nøklene. Dette er den private nøkkelen som må passes veldig godt på. Og da kan du svare bare default. Jeg har allerede lagd en sånn nøkkel, så... Hvis du har en nøkkel fra før, så er det bedre å bruke den nøkkelen og ikke skrive over, for da forsvinner de rettighetene du hadde tidligere. Så jeg kan svare nei her. Så gjør du dette første gang, så svarer du ja. Det som skjer når vi kjører den kommandoen, er at i en mappe som heter.so, så lages det da to filer. id.rsa, som er den private nøkkelen, og id.rsa.pub, som er den offentlige nøkkelen. Og poenget med dette er at id.rsa er en privat nøkkel som på en måte beviser at du er deg. Mens den offentlige nøkkelen, som ligger da... Og ser sånn ut. Den skal du da legge inn dit du ønsker å kunne logge deg inn uten passord. Og da vil systemet i den andre enden forstå at når du bruker din private nøkkel for å dekryptere en hemmelig melding, så vil den andre enden forstå at du har rettigheter. Det som skal skje, er at hele denne nøkkelen skal kopieres over til StudieSSH. Men da er det lagd en kommando som gjør hele dette her.", "source": "lecture"}
{"lecture_id": "linux6del5", "chunk_id": "linux6del5_0001", "start": 180.0, "end": 400.4, "token_count": 592, "text": "Og ser sånn ut. Den skal du da legge inn dit du ønsker å kunne logge deg inn uten passord. Og da vil systemet i den andre enden forstå at når du bruker din private nøkkel for å dekryptere en hemmelig melding, så vil den andre enden forstå at du har rettigheter. Det som skal skje, er at hele denne nøkkelen skal kopieres over til StudieSSH. Men da er det lagd en kommando som gjør hele dette her. Og den heter SSH-copy-ID. Så det du kan gjøre, er i stedet for den SSH-kommandoen som du vanligvis bruker for å logge deg inn på StudieSSH, så kan du i stedet si SSH-copy... copy-ID. Og da kommer det informasjon, og så må du bruke det vanlige passordet som du logger deg inn med SSH. Og hvis du skriver det passordet riktig, så vil dette skje at du får beskjed om å prøve å logge deg inn på denne maskinen med SSH. Så skal jeg prøve med den innloggingen her. Og det som nå skal skje, er dette at jeg kommer rett inn uten å skrive noe passord. Og dermed kan jeg enkelt gå frem og tilbake. Hvis jeg skal eksplisitt kunne gå med SSH herfra, fra studie-SSH inn på Linux-VM, så må jeg gjøre det samme her. Og så lage en SSH kiy-gen og så SSH copy-id over til Linux. Så det går an. Men... Med ctrl-d så kan jeg gå tilbake igjen. Og da kan jeg enkelt gå frem og tilbake uten å skrive passord. Det man også kan gjøre, er å utføre kommandoer på motsatt side. Hvis jeg ønsker å utføre hostname på study SSO, så kan jeg bare skrive kommandoen etter SSO-linjen. Og så utføres nå hostname på study SSO. Og hvis jeg vil gjøre mer... Omfattende operasjoner med... Det kan til og med være first host, name og så u-name i USA. Så kan jeg sende med hele kommandoer på den måten. Og da utføres de kommandoene på studiesesong. Når man setter opp passordløs innlogging på denne måten her, så er det veldig viktig å tenke over hva dette innebærer. F.eks. hvis du er i en gruppe på OSVM-en din hvor flere brukere har tilgang,", "source": "lecture"}
{"lecture_id": "linux6del5", "chunk_id": "linux6del5_0002", "start": 360.0, "end": 467.56, "token_count": 343, "text": "Omfattende operasjoner med... Det kan til og med være first host, name og så u-name i USA. Så kan jeg sende med hele kommandoer på den måten. Og da utføres de kommandoene på studiesesong. Når man setter opp passordløs innlogging på denne måten her, så er det veldig viktig å tenke over hva dette innebærer. F.eks. hvis du er i en gruppe på OSVM-en din hvor flere brukere har tilgang, så er det klart at med en gang du setter opp passordløs tilkobling til StudieSSH, så vil også de andre brukerne som har tilgang til en felles OSVM, også få muligheten til å logge inn på StudieSSH. Så hvis dette er tilfellet, så er det, med mindre det ikke har noe... Noe liggende av verdi på StudieSOS, så er det best å unngå å sette opp passordløs innlogging den veien, fra Linux-VM til StudieSOS. Men det som er trygt, er å sette opp det samme, passordløs innlogging fra StudieSOS til Linux-VM. For da... Det eneste det betyr, er at du som bruker på Studieshow, får tilgang til VM uten å taste passord. Det vil da også gjelde de andre som er på samme gruppe, men de vil da komme fra sin konto på Studieshow.", "source": "lecture"}
