{"lecture_id": "linux6del8", "chunk_id": "linux6del8_0000", "start": 0.0, "end": 187.2, "token_count": 588, "text": "Vi skal nå se på noe som er kjempenyttig hvis man samarbeider på en fellesscreen på Linux. Hvis man samarbeider på f.eks. Linux VM, hvor flere har tilgang samtidig, så kan man sette opp en screen som to eller tre kan bruke samtidig, og gjøre kommandoer om hverandre. Hvis vi tenker oss nå at jeg er Haugerud på studiesesong, og så har vi her en... Og så er vi på samme gruppe. Så starter jeg med å logge meg inn på OS100. Her har jeg kanskje allerede en screen kjørende. Men jeg skal lage en felles-screen. Og da må jeg bruke opsjonen minus DM. Det for at den skal ligge i bakgrunnen. Og så må jeg bruke opsjonen... Nei, jeg kan starte sånn, men jeg kan bruke opsjonen Felles for å vise hvilken screen som er felles. Den skal da kunne deles. Så da har jeg startet en screen, men du ser jeg kobler meg ikke til. Den minus D-en gjør at man ikke kobler seg til. For det jeg nå skal gjøre, er ikke sånn at jeg kobler meg til den loop og kobler meg til med minus R, men jeg skal koble meg til med minus X. Minus seks felles. Da har jeg nå en screen som er... Som andre kan koble seg til. Skreve ekko hei var for å se at nå... Vi kan se at det faktisk er denne screenen jeg kobler meg til. Så tenker vi også at denne stunten også har tilgang til group 100 med passord. Og kommer seg inn som gruppe 100, da kan denne studenten også se... OK, det er to screenere, felles og den andre. Nå skal jeg komme meg til den felles, men igjen med X. Og da ser vi at den studenten nå kommer inn i samme screen. Og de kan nå gjøre kommandoer om hverandre. Da kan den ene se hva den andre gjør, og det er lett å samarbeide med. Hvis man i tillegg har en lydkanal, så kan man prate sammen og gjøre kommandoer, skrive skript osv. Starte skript her, og så... Alt vil nå være felles. Og den andre kan da ta over og skrive en linje i skriptet. Så dette er kjempenyttig hvis man... Er på samme gruppe og samarbeider om Linux-skjelvprosjekter.", "source": "lecture"}
