{"lecture_id": "linux9del2", "chunk_id": "linux9del2_0000", "start": 0.0, "end": 263.76, "token_count": 588, "text": "I mellomtiden tenkte jeg å gjøre noe annet. Nemlig å teste ut dette interaktivt på en standard Linux-maskin. Så da vil jeg dele et annet vindu med dere. Her. Nå er jeg... Nå er jeg i... faktisk på desktopen min nede på OsloMet. Da skal jeg gjøre interaktivt det som jeg etterpå har tenkt å gjøre i dokker. Først kloner jeg disse filene. Så går jeg ned i mappen. Her ligger... Så tanken er nå at jeg skal teste hvor lang tid dette tar. Og da skal jeg teste... Ja, vi kan... Aller først så kan jeg teste bæsjskriptet. Jeg kjører det. Disse skriptene og programmene har jeg tilpasset til denne maskinen, sånn at de tar omtid. Det som kan være interessant å se, er at tiden kan være forskjellig på andre maskiner. Som f.eks. hvis man kjører det i dokker på Linux-V. Sum.vers ser sånn ut. Og den regnet ut denne summen ferdig på 5,5 sekunder. Vi kan starte øverst. Da lages det som vi vet en A.not. Så kan vi ta tiden på det. Den tar også ca. 5,5 sekunder. Sånn har jeg gjort tilsvarende med alle programmene. Det er å kompilere Java. Og da trenger man å installere Java sånn som jeg nå gjør på docketcontaineren. Med app-get-install JK. Så først kompilerer jeg Java. Det er sånn man kjører Java fra Linux-kommandolinja. Med Javak-kompilator først, og så kjører jeg med Javasum. Men jeg glemte å ta tiden. Den tar også omtrent fem sekunder. Sånn fortsetter vi. Pøl er som regel installert i polt på ubundet. Pøl er et språk som ble brukt mye tidligere. Tidligere var det en del av pensum med operativstemmer. Men etter hvert har Pearl blitt mindre brukt. Og spesielt Python har tatt over det som er Pearls rolle. Men det skal vi se nærmere på snart. Det var Python. Vi kan ta helt til slutt, så kan vi ta tiden på PHP også. I oppgaven dere får, så tar jeg ikke med PHP. Delvis fordi det kan bli et plastproblem med å få installert alt.", "source": "lecture"}
{"lecture_id": "linux9del2", "chunk_id": "linux9del2_0001", "start": 186.06, "end": 296.96, "token_count": 252, "text": "Pøl er som regel installert i polt på ubundet. Pøl er et språk som ble brukt mye tidligere. Tidligere var det en del av pensum med operativstemmer. Men etter hvert har Pearl blitt mindre brukt. Og spesielt Python har tatt over det som er Pearls rolle. Men det skal vi se nærmere på snart. Det var Python. Vi kan ta helt til slutt, så kan vi ta tiden på PHP også. I oppgaven dere får, så tar jeg ikke med PHP. Delvis fordi det kan bli et plastproblem med å få installert alt. Sånn. Så alt tar omtrent fem og et halvt skudd. Men så kommer selve clouet. I denne koden her så vil det være forskjell på hvor mange ganger hver av de klarer å kjøre gjennom Løkken på 5,5 sekunder. Så nå kommer spørsmålet til dere, og det er... Det er... hvilket av disse språkene tror dere er raskest?", "source": "lecture"}
