{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0000", "start": 0.0, "end": 220.08, "token_count": 583, "text": "Og da... En dokkefil er da i prinsippet en fil som inneholder alt det en dokkecontainer trenger. Det vi gjorde forrige gang, var at... Skal vi se... Nå før pause så gikk jeg inn på denne containeren her. Og det vi gjorde forrige gang, var at nå er jeg inne på containeren. Jeg kan kjøre apps... App Install og så videre. Og så installere den programvaren jeg trenger, f.eks. en webserver. Men det vi skal se på nå... Nå går jeg ut med Exit. Da ser jeg for øvrig at den, når jeg går inn med Execute og cobler meg opp, så vil den fortsatt stå og gå etterpå. Men det vi skal gjøre nå, er å bygge... Jeg skal lage en container som allerede har Apache installert før vi starter. Og det er da dokkefiles kommer inn i bildet. Det man gjør da, er at man lager en mappe. Jeg vil lage en webserver her. Så jeg lager en mappe som heter webserver. Så går jeg til den mappen. Jeg lager en fil som skal hete dockerfile. Kan ha andre navn, men hvis man bruker navnet dockerfile, sånn som det, så kan man bygge den. Og da vil default dokker forvente at filen heter dokkerfile. Så jeg kaller den dokkerfile. Og da, hvis dere ser i... ikke slidene, men i gjennomgangen... så vil dere se at det er en rekke kommandoer eller instruksjoner som gjør at man definerer hvordan containeren skal se ut. Det første og viktigste kanskje er from. Det sier hvilket image man skal velge. Det er akkurat som å kjøre dokker, containeren, bunte. Siste bunteversjon, som jeg default får da. Etterpå, når jeg saver denne finnen, så kjører man dokkebild. Og da vil man starte med å laste ned bunte-imaget. Så kan man etterpå kjøre kommandoer inne i... Når man bygger imaget, så vil disse kommandoene kjøres før man starter. På denne måten kan jeg f.eks. starte med å si... Og så kan jeg ta... Istedenfor update, så kan jeg ta install. Og da kan jeg installere... Ja, vi kan jo kanskje gjøre dette i første omgang. Vi kan ta én ting til.", "source": "lecture"}
{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0001", "start": 163.48, "end": 443.1, "token_count": 586, "text": "Og da vil man starte med å laste ned bunte-imaget. Så kan man etterpå kjøre kommandoer inne i... Når man bygger imaget, så vil disse kommandoene kjøres før man starter. På denne måten kan jeg f.eks. starte med å si... Og så kan jeg ta... Istedenfor update, så kan jeg ta install. Og da kan jeg installere... Ja, vi kan jo kanskje gjøre dette i første omgang. Vi kan ta én ting til. Vi kan ta... Det jeg gjør nå, er altså at jeg kopierer en fil som heter index.hotml. Da må jeg lage den inne i den mappen som jeg har her. Så vet jeg at i en Apache-server så ligger indeksfilen i VAR og BWWHTML. Da kopierer jeg den filen din, sånn at når dette imaget starter, så vil jeg få en container som inneholder en webserver med innhold indeks.hottime. Lagt opp et svært filsystem der med masse statiske sider som kunne serves. OK. Vi kan stoppe der i første omgang, og så kan vi prøve å bygge en container ut fra den dokkefilen. Så... Da har jeg den dokkefilen. Og da bruker man dokkebild. Dokkebilde... Ja, altså... Det er noen... Det er noen opsjoner man kan bruke på bilde. Skal vi se... Om jeg husker det. Ja... Minus T kan man i hvert fall ha med. Generelt, hvis man har en kommando som man lurer på, så kan man alltid legge på minus hell, sånn som her. Og da får man hjelp til akkurat den kommandoen dere vil. Minus T taglist. Det kan være nyttig, for da kan man legge på en kommando. Eller gi konteineren et navn, så vi kan bruke det. La oss si jeg kaller den Web, Apache, hva er det som blir et tydelig navn. Nå ligger det en dockerfil her i mappa, så da bare legger jeg på en prikk som betyr bygg fra den mappa som jeg står i. Ja. Must be a love case. Så jeg må faktisk gjøre det sånn. Det blir en rekke steg nedover. Nå begynner han å installere Apasje. Men det fine med denne lagdelingen er at det er en lagdeling i imager òg. Sånn at hver del kan lages til en eget image.", "source": "lecture"}
{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0002", "start": 366.12, "end": 602.28, "token_count": 587, "text": "La oss si jeg kaller den Web, Apache, hva er det som blir et tydelig navn. Nå ligger det en dockerfil her i mappa, så da bare legger jeg på en prikk som betyr bygg fra den mappa som jeg står i. Ja. Must be a love case. Så jeg må faktisk gjøre det sånn. Det blir en rekke steg nedover. Nå begynner han å installere Apasje. Men det fine med denne lagdelingen er at det er en lagdeling i imager òg. Sånn at hver del kan lages til en eget image. Øyeblikket før jeg begynte å installere Apasje, det kan bli et image. Da vil det være App-get-update, men ikke Apache-innstilt. Så man får den type lagdeling. Og hvis man da endrer på noe, f.eks. endrer litt på hva som kopieres inn, så er det bare en liten endring. Når jeg da bygger et nytt image, så brukes alle de andre lagene, for de er akkurat som før. Alt det er det samme. Så må man legge på en endring. Så kommer den på toppen av det nye. Som vi skal se etterpå, så trenger man ikke å gå gjennom hele den byggeprosessen fra start til slutt. Det holder med den siste biten. Ja, så ser vi... Nå fikk jeg en feil her. Copy. Det var ikke så rart jeg fikk en feil på det. Fordi copy den indeks.dot-hemmelen, den hadde jeg ikke laget. Så det er et godt eksempel på at da kan jeg rette opp det og bygge på nytt. Men vi kan før vi gjør det, så kan vi se om vi har fått et nytt image her.  Ja... Det ser ut som det ikke har blitt ferdig siden den... Siden den feilet. Så jeg kan prøve å rette opp det her først. Her inne så trenger jeg da en ineksfil. Da kan jeg bare... skrive inn noen her. Hilsen fra docker file container, for eksempel. Sånn. Da har jeg en fil her, og så kan jeg prøve å bygge på nytt. Da ser vi. Da... vil de tre første steppene... Der har man alle. Det er allerede et image som er ferdig. Det går veldig fort. Det er bare det siste steppet der. Det gjør en liten endring på imaget.", "source": "lecture"}
{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0003", "start": 560.8, "end": 785.64, "token_count": 591, "text": "Her inne så trenger jeg da en ineksfil. Da kan jeg bare... skrive inn noen her. Hilsen fra docker file container, for eksempel. Sånn. Da har jeg en fil her, og så kan jeg prøve å bygge på nytt. Da ser vi. Da... vil de tre første steppene... Der har man alle. Det er allerede et image som er ferdig. Det går veldig fort. Det er bare det siste steppet der. Det gjør en liten endring på imaget. Og så bygger man imaget. Så nå... Nå ser vi at vi har et ferdig image her. Da er det klart. Da kan jeg starte The Image som tidligere med dokkecontainer. Rønn minus IT... Og da heter det Apache. Så kan jeg kanskje kjøre bæsj der også. Sånn. Da er jeg inne i containeren. Og her er nå Apache installert. Det er flere måter å starte Apasje på. Jeg ser at den er installert. Ved at nå er det lagt inn muligheter for å starte Apasje-tjenesten. Et problem med dette er at den ikke har startet opp. Det kunne vært nyttig at den startet automatisk. Gå inn sånn som jeg gjør nå, og start den opp. Og så gå ut igjen. Når jeg går ut, så bruker jeg kontroll-p, kontroll-q. Hvis ikke, så stopper hele serien. Sånn. Så kan jeg liste igjen med PS. Og da ser vi at jo, jeg har en webbapasje nå som er oppe og kjører. Den kjører da en Apasje-server. Men vi ser vi har et annet problem her. Og det er at vi har ikke tilordnet noen port. Og dermed så vil ikke... Vil ved den neppe gi noe. Vi kan prøve... Den vil nok gi noe, men det er fra den lokale serveren som står her og kjører. Hvordan kan vi endre det? Jo, da kan vi rett og slett stoppe konteineren. Dere konteinerer stopp, og så ser vi den starter på 6A. Så det holder faktisk bare å skrive 6A. Så lenge det er entydig hvilken idé den er, så vil den stoppe. Så nå stoppet jeg WebApache. Og så kan jeg prøve å starte den igjen. Og så kan jeg ta minus P... La oss si vi tar 80-81 til 80.", "source": "lecture"}
{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0004", "start": 741.8, "end": 1016.18, "token_count": 595, "text": "Hvordan kan vi endre det? Jo, da kan vi rett og slett stoppe konteineren. Dere konteinerer stopp, og så ser vi den starter på 6A. Så det holder faktisk bare å skrive 6A. Så lenge det er entydig hvilken idé den er, så vil den stoppe. Så nå stoppet jeg WebApache. Og så kan jeg prøve å starte den igjen. Og så kan jeg ta minus P... La oss si vi tar 80-81 til 80. Det betyr nå at innkomne forespørsler til Local Hosts på port 80-81, det skal forwardes, sendes videre til port 80 på containeren. Da prøver jeg å kjøre den sånn SAD. Så kan jeg se her... Nei, det ser ikke ut som den webserveren kjører her. For vi stoppet jo hele containeren. Men da kan jeg prøve å starte webserveren. Sånn som det. Da starter den, så går jeg ut med kontroll P, kontroll Q. Så lister jeg konteineren igjen. Nå ser jeg at port 8081 blir sendt til port 80. Hvis jeg nå kjører curl local host på 8081, så ser vi at jeg får opp... Så nå fungerer det sånn som det skal. Og da vil jeg også kunne se... Hvis jeg nå går i en browser, så vil jeg også kunne se at den vil synes utenfra. Hvis jeg går til 8081 og OS... Skal vi se... Vi gjør et eksperiment der. Så skal jeg prøve å dele hele skjermen i stedet. Altså hele min desktop. Sånn. Nå ser dere forhåpentligvis hele min desktop. Men da er det et spørsmål om... Ser dere bra nok det jeg skriver? Skal vi se. Ja... Det er en som sier ja i hvert fall. Hvis det er noen som... Hvis denne skjermen er for liten, så si gjerne fra. Så kan jeg heller prøve å... Så kan jeg prøve å gå tilbake til å dele bare ett vindu. Ser et svart vindu til høyre for terminalen, bare. Det var rart. Vi kan se om vi får løst det på en annen måte. Men i hvert fall i første omgang, så vil jeg bare demonstrere. Hvis jeg nå går inn på OL70. Her er delen til den. Og da ser vi... Da kommer... Nei.", "source": "lecture"}
{"lecture_id": "linux8del7", "chunk_id": "linux8del7_0005", "start": 961.24, "end": 1175.0, "token_count": 420, "text": "Hvis denne skjermen er for liten, så si gjerne fra. Så kan jeg heller prøve å... Så kan jeg prøve å gå tilbake til å dele bare ett vindu. Ser et svart vindu til høyre for terminalen, bare. Det var rart. Vi kan se om vi får løst det på en annen måte. Men i hvert fall i første omgang, så vil jeg bare demonstrere. Hvis jeg nå går inn på OL70. Her er delen til den. Og da ser vi... Da kommer... Nei. Da er spørsmålet... Hvorfor får jeg nå en annen hilsen? Da må jeg gå tilbake hit, og så må jeg se dokker, container, PS... Nei, jeg har bare én... Én konteiner her. Mulig at dette her er... At det er cash. Vi kan prøve å gjøre et eksperiment. Så kan vi da ta dokker container og så stoppe den her. Dokker container, stopp. 2F. Kan stoppe den andre der også. Da har jeg bare én container som kjører. Ja. Og da, når jeg går her nede og prøver å... ... og starte på nytt, så ser vi at jeg ikke har noen kontakt. Så jeg tror kanskje at det bare var noe som lå i cash. Men det kan vi finne ut ved å... nå kjører ringen, så kan jeg starte på nytt. Det var den jeg kjørte. Og så må jeg... starte Apars 2 igjen. Start. Sånn. Da får jeg den riktige. Så... Det er den samme som jeg hadde her oppe. Da jeg kjørte curl low-closed. Da fikk jeg hilsen fra Dockenfield, og hilsen.", "source": "lecture"}
