{"lecture_id": "linux12del12", "chunk_id": "linux12del12_0000", "start": 0.0, "end": 287.72, "token_count": 597, "text": "Det vi tenkte å gjøre nå, var å prøve å bruke dette til å lete etter filer som er fra et visst tidspunkt. Vi har gjort det på Linux også, men det er litt mer komplisert å manipulere på et tidspunkt der. Her. Så kan vi prøve... Ja, kanskje vi skal... Kanskje vi skal lete etter noen filer. Skal vi se. Vi kan gå inn og se hvor vi har filer. La oss si jeg... Jeg husker at en eller annen gang i 1930 så endret jeg noen filer på... La oss si jeg ikke visste hvor de filene var. Så jeg skal prøve å finne alle filer som er lagd den 19.03.2019. La oss si mellom morgen og kveld. Det jeg kan starte med da, er å lage en variabel... La oss si jeg kaller den morgen. Det skal være get-date... Hva var det jeg sa? 14.4.219. La oss si 8 om morgenen. Sånn. 14.4, har du ikke det? Nei, det har du ikke. Helt om 19. mars var det jeg skrev på rødbladet. Ok... 19. mars. Sånn. Og så kan jeg definere kveld. La oss si jeg ønsker at kveld skal defineres sånn. Da gjelder det å finne filer som er laget... eller som er endret innenfor disse tidsrommene her. Men da trenger jeg jo... Ja, da trenger jeg igjen noen metoder eller properties. Som alltid så sender jeg da kveld til Get Mattered, metoden jeg ønsker å se på. Jo, men dette var datoen. Det er jo ikke datoen jeg ønsker å se på. Jeg ønsker å se på egenskapene til filer. Det er filer som jeg må se på. Og her ser vi på filer, så... Har vi en egenskap last right time? Den er det jeg ønsker å se på. For det er den som dukker opp her. Dette er last right time. Det står jo her også. OK. Så da kan jeg gjøre et forsøk. Jeg kan ta LS, og så kan jeg pipe til where object. Og så kan jeg nå prøve å plukke ut objekter hvor... Sånn. Jeg ønsker deg en fin kveld. Ha det bra. Sprite time... Den skal være større enn om morgenen. Skal se om det funker i det hele tatt. Ja, det så ut som det kunne virke.", "source": "lecture"}
{"lecture_id": "linux12del12", "chunk_id": "linux12del12_0001", "start": 215.68, "end": 497.7, "token_count": 595, "text": "For det er den som dukker opp her. Dette er last right time. Det står jo her også. OK. Så da kan jeg gjøre et forsøk. Jeg kan ta LS, og så kan jeg pipe til where object. Og så kan jeg nå prøve å plukke ut objekter hvor... Sånn. Jeg ønsker deg en fin kveld. Ha det bra. Sprite time... Den skal være større enn om morgenen. Skal se om det funker i det hele tatt. Ja, det så ut som det kunne virke. Får nå ut alle objekter som har et tidspunkt som er større enn det tidspunktet, om morgenen. Men jeg ønsker jo å se på det som er varig i løpet av den dagen. Og da kan jeg ta... I tillegg så ønsker jeg da at... The last right time skal være... Mindre enn... Mindre enn om kvelden. Sånn som det. Da får jeg ut akkurat det jeg ønsker av alle filene som har den egenskapen. Og igjen så kunne jeg jo ta... Bruke litt... Jeg kan ta LS minus R. Og så kan jeg ta C kolon slash... Nå finner jeg raskt alle filer under der, som er innenfor det tidsrommet. Men da ser vi igjen at det ble veldig mye... output. Noen feilmeldinger også. Så igjen kan vi rette på det ved å sende feilmeldinger til null. Konsekvenser. Last write er større enn om morgenen, mindre enn om kvelden. Men så kan jeg sende til format table, og så kan jeg si OK, kanskje jeg vil ha... Ha ut... Name og kanskje... Last write time, da. Da får jeg en oversiktlig liste over alle filer på systemet som ligger under her, som er endret i det tidsrommet. Da er det også lett å endre på... La oss si jeg ville begrense dette til mellom... Og la oss si... 13.45. Da definerer jeg kvelden sånn. Og så definerer jeg morgen som 13.45. Sånn. Og så gjør jeg det samme søket. Og vips, så får jeg ut akkurat de to filmene som ble endret her. Ja... Hvis jeg vet et eller annet som har foregått på maskinen, og jeg ønsker å finne det ut, så vil dette også lete gjennom alle systemfiler og alle filer som har endret seg akkurat innen dette tidsrommet.", "source": "lecture"}
{"lecture_id": "linux12del12", "chunk_id": "linux12del12_0002", "start": 450.0, "end": 508.96, "token_count": 164, "text": "Og la oss si... 13.45. Da definerer jeg kvelden sånn. Og så definerer jeg morgen som 13.45. Sånn. Og så gjør jeg det samme søket. Og vips, så får jeg ut akkurat de to filmene som ble endret her. Ja... Hvis jeg vet et eller annet som har foregått på maskinen, og jeg ønsker å finne det ut, så vil dette også lete gjennom alle systemfiler og alle filer som har endret seg akkurat innen dette tidsrommet. Så du ser igjen Sin PowerShell-commandlets returnerer objekter, så blir dette en veldig kraftig metode.", "source": "lecture"}
