{"lecture_id": "linux5del12", "chunk_id": "linux5del12_0000", "start": 0.0, "end": 207.64, "token_count": 597, "text": "Vi skal nå se på et vanlig problem når man bruker vile og read til å løpe gjennom data spesielt fra en kommando og ikke fra en fil. Så la oss si vi prøver og... eller ønsker å ta alle PID-ene fra PSA og X og legge inn i et radi. Å få ut PID-ene fra AoX på er å bruke AUK. Og sende det da til et program med AUK. Jeg har en litt spesiell syntaks på denne måten. Men inni her så kan man da printe ut elementet, f.eks. element 3. Eller i vårt tilfelle ønsker vi å få ut PID. Så det vil printe ut element nummer to. Når man skal gjøre noe sånt, så kan det ofte være lurt å teste... Er det dette som er forut? Ja, da ser vi den virker. Det gir meg payday-en. Så jeg skal da pipe det til en Wild-konstruksjon, hvor jeg skal lese linje for linje payday. Dette vil da inne i wildlucken, så vil dollar-payday nå være payday-en. Så kan jeg kanskje ønske å... Så trenger jeg en indeks til r-øyet. Så kan jeg si OK, la meg lage et payday-r-øy. Og her kan jeg da legge inn payday-r av dollar i. Det vil jeg skal være lik dollar payday. Så da får jeg et r-øy med alle payday-ene. Jeg kan f.eks. prøve å skrive ut antall elementer i dette jeg har laget. Antall elementer... Og det er jo da igjen en spesiell konstruksjon. Må ha P i D, R og så alfakrøll. Dette ble fortsatt ikke helt riktig. Vi må også ha krøllparenteser. Som vi alltid må ha når vi skal skrive ut vr-et. Dette burde da gi antall elementer. Så kan vi save og prøve å kjøre det. Det heter.pipe.chat. Og vi kjører det, men antall elementer kommer ikke ut. I første omgang så ser vi at vi har én ting som mangler. Vi kan ha en hashtag for å få ut antall elementer. Selv om vi prøver da igjen, så sier vi det hjelper. Men antall elementer er null. Så det virker som dette er et tomt array. Og det virker litt merkelig, så vi kan prøve å gå inn i wirelocken. Nå skal vi se... Har vi ikke fått ut noen elementer her?", "source": "lecture"}
{"lecture_id": "linux5del12", "chunk_id": "linux5del12_0001", "start": 166.52, "end": 352.12, "token_count": 593, "text": "Og vi kjører det, men antall elementer kommer ikke ut. I første omgang så ser vi at vi har én ting som mangler. Vi kan ha en hashtag for å få ut antall elementer. Selv om vi prøver da igjen, så sier vi det hjelper. Men antall elementer er null. Så det virker som dette er et tomt array. Og det virker litt merkelig, så vi kan prøve å gå inn i wirelocken. Nå skal vi se... Har vi ikke fått ut noen elementer her? Og så kan vi se om vi får ut noe. Ja, og da viser det seg... Vi får ut verdier her, så et antall elementer burde vært 311. Men her er det et problem, og det er det vanlige problemet som oppstår når man prøver å pipe noe fra en prosess, altså opput fra en prosess inn til en sånn valgkonstitusjon. Så vil denne valgkonstitusjonen, Den vil lage et eget subskjell, og alt som foregår inni her, foregår i det skjellet, og så avsluttes skjellet. Og etterpå så vil man ikke da ha de datakonstruksjonene, den datastrukturen, som ble lagd der inne. I dette tilfellet et ri. Så etterpå så har ikke det ri noen verdi. Hvis man gjør tilsvarende med en fil, og sender verdien av en fil inn, så fungerer det. Det første er å lage en temporær fil. Istedenfor å pipe til konstruksjonen, så kan vi sende inn filen til konstruksjonen på denne måten. Hvis vi nå prøver å kjøre, så ser vi at vi får ut antall elementer 310. Som er det riktige antallet elementer. Da kan vi altså fjerne denne her. En annen konstruksjon som kan brukes i tilfeller som dette, det er å i stedet for å lage en temporær fil, så har vi en konstruksjon som ser sånn ut. De tre tegnene her utgjør en såkalt prosess substitution. Bytter ut den prosessen og avput-en med en fil. Denne konstruksjonen vil tilsvare at man temporært legger dataene i en fil, og så sender videre. Dermed kan man gjøre dette direkte. Hvis jeg nå legger inn den prosessen uten å bruke en fil,", "source": "lecture"}
{"lecture_id": "linux5del12", "chunk_id": "linux5del12_0002", "start": 300.0, "end": 425.76, "token_count": 330, "text": "En annen konstruksjon som kan brukes i tilfeller som dette, det er å i stedet for å lage en temporær fil, så har vi en konstruksjon som ser sånn ut. De tre tegnene her utgjør en såkalt prosess substitution. Bytter ut den prosessen og avput-en med en fil. Denne konstruksjonen vil tilsvare at man temporært legger dataene i en fil, og så sender videre. Dermed kan man gjøre dette direkte. Hvis jeg nå legger inn den prosessen uten å bruke en fil, så vil dette tilsvare at man piper til vial-prosessen. Men nå vil dette her se ut som en fil. Og dermed så fungerer det. Så kan jeg prøve igjen og serve den, altså kjøre det. Og da ser vi at det fungerer som det skal. Riktignok ble av tallelementer én mindre, men her er det... Dette er dynamisk og flytende, så det kan endre seg fra gang til gang. I dette tilfellet kan det også være fordi man får et ekstra element i prosesslistingen når man skriver ut til en temporær film. Men uansett - dette vil gjøre at man kan løpe gjennom r-ene og direkte legge output Inn i RE og få ut PID-ene slik man ønsker.", "source": "lecture"}
