{"lecture_id": "linux11del7", "chunk_id": "linux11del7_0000", "start": 0.0, "end": 238.96, "token_count": 599, "text": "OK. Nå har jeg startet opp Bindosti fra imaget som ligger i dagens oppgaver med virtual box. Så det jeg skal gjøre nå, det er hvis jeg tar vindustassen og X, så... Eller hvis jeg går ned her... Sånn. Her får jeg opp et kommandoprompt. Da er det mulig å sette opp det til å gi påskjell, men default, så er det command.exe som jeg får opp. Hvis jeg her prøver å skrive LS, så ser vi at det er ikke en kjent kommando òg. Men hvis jeg skriver dir, dos-kommandoen dir, så får jeg listet filer. Dette er da et veldig begrenset... Men vi kan ta... Vi kan lage en liten hello.butt. Nå var den ferdig... Den hadde jeg lagd allerede. Hvis man bare skriver... så kan man kjøre den som... hello..hello.butt. Og så kjører den hello.world. Og helt tilsvarende ser det ut med webbeskrift. Så jeg tenker vi heller kan... Vi kan heller gå på og se på powershelf. Spørsmålet er om man må bruke hydrocox hvis man har Vinos PC. Nei, man trenger ikke å gjøre det. Man kan kjøre rett i sin egen Vinos. Det eneste kan være hvis man... I neste uke så skal vi gjøre noen oppgaver hvor vi endrer på Windows registry. Stort sett så er det helt uproblematisk. Vi skal ikke gjøre noen store endringer. Så da vil det funke fint å bruke egen Windows PC. Men òg hvis man er bekymret for å gjøre noen endringer, og hvis man har lyst til å eksperimentere litt mer, så kan det være lurt å bruke... Ok. Man kan faktisk i... I kommando til XV, så kan man taste påbeskjed, og da får man opp et påbeskjed. Hvis jeg nå skriver les, så ser vi... Da funker den kommandoen. Da kan vi prøve å lage... Å lage en hello word på vår selv. Jeg kan bare starte Notepad sånn. Og så kan jeg skrive 'hello word'. Sånn. Man må være litt forsiktig når man saver for å få dette som en... Unnskyld. For å få dette som en PowerShell-fil, så kan man ikke save som.txc, for da vil filen hete hello.pcn.txc. Så da er det viktig å velge all files før man saver, og så skrive navnet.", "source": "lecture"}
{"lecture_id": "linux11del7", "chunk_id": "linux11del7_0001", "start": 180.0, "end": 431.0, "token_count": 556, "text": "Da kan vi prøve å lage... Å lage en hello word på vår selv. Jeg kan bare starte Notepad sånn. Og så kan jeg skrive 'hello word'. Sånn. Man må være litt forsiktig når man saver for å få dette som en... Unnskyld. For å få dette som en PowerShell-fil, så kan man ikke save som.txc, for da vil filen hete hello.pcn.txc. Så da er det viktig å velge all files før man saver, og så skrive navnet. Og så servere. Da har man en Hello Word-fil, og så kan man kjøre den ved å skrive hello.pc. Den henter ut execution policy. Det betyr at her har jeg allerede satt den til remote side. Men i Default så er den satt til restricted. Så jeg kan prøve å sette den tilbake til Default, sånn som den var opprinnelig. Men da ser vi det Faiquer lover. Og det er fordi jeg er nå en vanlig bruker. Så for å få lov til dette her, så må jeg starte Powershell som administrator. Og det er nyttig å kunne. Da kan man f.eks. taste Windows R. Hvis jeg taster Windows R og Powershell, så får jeg opp et vanlig Powershell-vindu. Så det funker ikke. Hvis jeg taster vindus-knappen og X deg imot, og så begynner... Oi. Nei, det funker heller ikke. Hvis jeg starter her med vindus-X, og så starter å skrive powershell, så vil du se at da får jeg opp diverse powershell-muligheter her. Med en editor osv. Men hvis jeg tar det øverste, og så høyreklikker der... Da får jeg muligheten til å kjøre som administrator. Det er det jeg må gjøre. Og da svarer jeg ja på det. Og så kan jeg... Sette execution policy f.eks. til default. Hvis jeg da går tilbake til mitt vanlige... ... forskjell, som vanlig bruker, så vil du se, jeg får ikke lov... ... og jeg får ikke lov å kjøre dette skriftet. Så da må jeg inn som administrator. Og så må jeg sette execution polter, polsier... Til... Erim Motzheim. Yes. Hvis jeg nå går tilbake, så får jeg lov å kjøre.", "source": "lecture"}
