{"lecture_id": "linux3del10", "chunk_id": "linux3del10_0000", "start": 0.0, "end": 193.22, "token_count": 597, "text": "Vi skal nå se på subshelt, som er en konstruksjon som kan være veldig nyttig i mange tilfeller. Jeg skal vise den med et eksempel på et problem som vi kan løse. Da tenker vi oss først at vi har to filer med noe tekstig. 1, 2, 3, f.eks. Og jeg lager en fil 2, som skriver noen tall i litt annen rekkefølge. Sånn. Og så tenker vi oss nå at vi ønsker å sortere disse filene. Ser hvis jeg sorterer fil 2, så får jeg 1, 4, 2, 3 - riktig alfabetisk. Men så kunne det kanskje være at jeg ønsker å sortere begge disse filene samtidig. Slå dem sammen. Uten eksplisitt å legge dem inn i samme file, vil det være mulig å gjøre. Da kan jeg sende output av begge to ut i terminal på den måten her. Og hele denne listen her ønsker jeg å sortere. Det er klart. Jeg kunne prøve å sende dette til... Legge det inn i samme fil og så sortere. Men jeg skulle ta de to kommandoene opp ut fra de to kommandoene og sortere. Og da tenker vi jo at da kunne vi gjøre sånn - sort - for å få sortert begge to. Men da viser det seg at da får jeg ikke sortert i starten her. 1, 2, 3. Altså den... Den første filen skrives ut til terminal. 1, 2, 3... Og så etterpå utføres kommando nummer 2. Og så... Den, da sorteres fil 2. Men den samsorteres ikke med den andre filen. Så måten vi kan løse det på, er å bruke denne konstruksjonen her, som gir en... Som gir en subkommando... Det ligner litt på sånn når man... Når man skal kjøre en kommando og så legge den i en variabel og legge på en dollar her, men her... Her lager vi et subshell. Det som kommer inn i parentes her... Det startes da opp et lite skjell som de to kommandoene kjøres i. Og så sendes alt opp ut fra det videre. Og dermed så ser vi at de får... Slått sammen output fra de to, og så får vi en samsortering. Så hele hovedpoenget her er at vi lager et subcell hvor alt dette utføres.", "source": "lecture"}
{"lecture_id": "linux3del10", "chunk_id": "linux3del10_0001", "start": 160.12, "end": 200.22, "token_count": 140, "text": "og legge på en dollar her, men her... Her lager vi et subshell. Det som kommer inn i parentes her... Det startes da opp et lite skjell som de to kommandoene kjøres i. Og så sendes alt opp ut fra det videre. Og dermed så ser vi at de får... Slått sammen output fra de to, og så får vi en samsortering. Så hele hovedpoenget her er at vi lager et subcell hvor alt dette utføres. Og så kan vi pipe og bruke output fra det subscellet videre som vi måtte ønske.", "source": "lecture"}
