{"lecture_id": "linux8del8", "chunk_id": "linux8del8_0000", "start": 0.0, "end": 259.78, "token_count": 595, "text": "Det som vi skal prøve å få til nå, som er problemstillingen, det er hvordan kan vi lage eller endre dockerfile sånn at Apache 2 starter direkte. Det kunne vært veldig nyttig. Så hvis jeg nå går ut her... Så ser vi da stoppet den filen. Nei, det imaget. Men så skal jeg gå inn i... Da er det... Det man kan gjøre, er å legge på en kommando. Da trenger man å legge på en kommando som starter apasje. Det kan jeg legge på her. CMD som får kommando. Hva heter det? Jason Syntax. For å få til dette her, så... Man kan ikke kjøre direkte den inn i Aparche 2 Start. Men det er en biner i Aparche som heter Aparche Kontroll. Den bineren kan man starte. Hvis man prøver å gjøre dette her... Det er fordi dette starter arrangementen en bakgrunnsjobb. For å få Apache til å starte, må den kjøres i foreground. Da er det en liten besvergelse man må legge til her. Og det er minus det foreground. Så det er en demon som da starter. Så skal det nå bygges en Aparche-container som starter direkte. Så... da må jeg prøve en bilde igjen. Da vil jeg nok få en feilmelding om at den allerede er bygget. Nei, det får jeg ikke. Så vi så nå gikk det veldig fort å gjøre den endringen, for da var det bare den kommandoen der som ble endret. Så kan vi prøve å starte. Det er samme... Ja, det skulle funke, det. Så kan jeg se... Nei, jeg kan ikke se om den... Se at den kjører her. Det skulle jeg jo se her nede. Nei, det ser faktisk ut som den ikke har startet. Da var det tydeligvis noe som... ikke virket. Skal vi se... Det er ett spørsmål her. Kan man ha flere dokkerfiler i konteiner? Nei. I utgangspunktet så har man én dokkefil, og den bygger da én konteiner. Men man kan jo starte flere instanser av den konteineren. Man har gjerne én dokkefil som definerer én konteiner. Men skal vi se. Hva var problemet her? Jo... Men den svarer ikke på port 8081. Så det betyr nok at Apache ikke kjører inn i konsernet.", "source": "lecture"}
{"lecture_id": "linux8del8", "chunk_id": "linux8del8_0001", "start": 203.54, "end": 398.18, "token_count": 397, "text": "Kan man ha flere dokkerfiler i konteiner? Nei. I utgangspunktet så har man én dokkefil, og den bygger da én konteiner. Men man kan jo starte flere instanser av den konteineren. Man har gjerne én dokkefil som definerer én konteiner. Men skal vi se. Hva var problemet her? Jo... Men den svarer ikke på port 8081. Så det betyr nok at Apache ikke kjører inn i konsernet. Da må vi gå tilbake til dokkefilmen. Og så se om jeg har fått... Syntaksen... helt riktig. Om man starter den interaktivt. Tanken er at man skal starte den i bakgrunnen. Og det gjør man med minus D. Sånn som det. Men her får jeg en melding om port is already allocated. Da skyldes det kanskje at jeg allerede... Oi. Ja, jeg glemte å stoppe den her, da. Da må jeg stoppe den først. Sånn. Så prøver jeg å starte konteineren i bakgrunnen. Da ser vi. Når jeg starter med minus D, så prøver jeg å starte conteineren i bakgrunnen. Nå får jeg ikke opp et skjell, for da har jeg ikke bedt om det. Da startes denne her i bakgrunnen. Og nå ser vi... Den er oppe og kjører. Og da ser vi også... Her nede... Nå virket det faktisk som det skulle. Nå startet den filmen... Imaget startet. Konteineren startet, og den startet da også automatisk webserveren.", "source": "lecture"}
