{"lecture_id": "linux3del1", "chunk_id": "linux3del1_0000", "start": 0.0, "end": 187.8, "token_count": 585, "text": "Skjellvariabler er variabler som man kan sette i skjellet. Det er omtrent som variabler i et program. Man definerer variablene, og så kan man bruke det senere i programmet. Måten man setter det på i et Linux-skjell, er sånn som dette her. Du skriver et varabelnavn, OS, og så setter du det lik Linux. Men det som er spesielt i skjellet, er at man skal bruke den variabelen. Så skriv jeg ekko. Så må man ha med dollartegn for å få ut verdien på variabelen. Så ecco dollar os, det gir oss da den variabelen vi definerte. Så må man passe på å ikke ha mellomrom. Skjellet er veldig bar på syntaks. Hvis jeg gjør det, så får jeg passe på Der gjør jeg command.notfound, for jeg har et mellomrom der. Og der også gjør det at jeg får command.notfound. Det man tilordner, må komme rett etter likhetstegnet. Så i tillegg, hvis man prøver å... Hvis man prøver å skrive noe mer, f.eks. OSR lik Linus... Web, for eksempel. Sånn som det. Så ser jeg at jeg får en command not found, men det er fordi jeg har et mellomrom her. Så den tolker dette som to kommandoer. Så OS vil fortsatt være Satellinux. Men det jeg ønsker, er å få begge ordene med. Og da må jeg sette begge ordene inn i en parentes, og da får vi det som vi ønsker. Eller så kan det være en liten ting med variabler hvis man ønsker å skrive ut noe sånt som Ecco... OS... Og så Linux, Deb f.eks.... OS. Sånn. Og så fungerer det som det skal. Men hvis man prøver å sette bokstaver rett etter her... SOS - hvis man ønsker å skrive det. Da får man plutselig ingenting. Og det er fordi da skjønner ikke skjellet at dette er en variabel. Bare tolker skjellet som at hele dette er en variabel. I akkurat sånne tilfeller går det an å legge inn krøllparenteser rundt variabelen. Og dermed får man ut akkurat det man ønsker. Linux DEB SOS. At den tekststrengen kommer rett etter.", "source": "lecture"}
{"lecture_id": "linux3del1", "chunk_id": "linux3del1_0001", "start": 153.02, "end": 217.44, "token_count": 227, "text": "Men hvis man prøver å sette bokstaver rett etter her... SOS - hvis man ønsker å skrive det. Da får man plutselig ingenting. Og det er fordi da skjønner ikke skjellet at dette er en variabel. Bare tolker skjellet som at hele dette er en variabel. I akkurat sånne tilfeller går det an å legge inn krøllparenteser rundt variabelen. Og dermed får man ut akkurat det man ønsker. Linux DEB SOS. At den tekststrengen kommer rett etter. Generelt så kan man også fjerne en definisjon med UNSET. Så hvis jeg nå skriver ut det, så kommer det bare SOS. Så kan man i tillegg, med Z, så kan man liste alle variabler som er definert i skjellet. For det er ganske mange som er definert. Så får man en lang liste over alt som er definert av varabler.", "source": "lecture"}
