{"lecture_id": "linux8del5", "chunk_id": "linux8del5_0000", "start": 0.02, "end": 223.0, "token_count": 584, "text": "Og hva er forskjellen på image og container? Generelt, container er da den kjørende enheten. Imaget er filen som inneholder alkohol. Men vi kan starte en container. Dere container run. Og så så vi sist at minus it, det er for interaktivt å tette y. Det er for å starte opp en terminal. Og så kan vi si at i den... Nå bare laster jeg ned punktet. Og så ønsker jeg å kjøre et bæsjvindu når den starter opp. Og da ser vi... Nå hentes det et image fra... Ikke fra GitHub, men fra Dokkeraup. Da ble det lastet ned, og så ser vi at nå fikk vi opp et prompt der. Og det betyr at nå er jeg inne i dokker-imaget. Inne i dokker-konteineren. Så nå er dette en konteiner, for det er et image som da er startet opp. Så en instanse har jeg nå fått opp. Og jeg kan starte flere instanser av det samme imaget. Så... Hvis jeg tar PVD her, så vil jeg se at jeg er inni et Linux filsystem. Jeg kan ta... og se hva slags distribusjon det er. Og vi ser at dette er 18.04. Og så så vi sist at... Hvordan er det hvis jeg tar Exit nå? Så vil... Vi kan prøve det. Så vil containeren stoppe. Hvis jeg nå tar dokkecontainer PS, så ser vi at vi har en... Ingen container som kjører. Men PS-A, da vil jeg se at jeg har en container som... Det ble gjort exit på for tolv sekunder siden. Men da er det mulig å starte den på nytt. Så da kan jeg si... Dokker, konteiner start. Så konteiner i den. Så ser vi at da starter konteineren. Og der har vi en konteiner som kjører i syv sekunder. Eller som har kjørt i syv sekunder. Konteineren er liksom selve instansen. Og imaget er det imaget som instansen er startet fra. Men nå er vi på en måte ute av konteineren igjen. Vi så også sist på hvordan vi kan koble oss til. Og det kan vi gjøre med... Det er et par materiører på her. Den beste måten er kanskje å bruke eksekut. For da kan man si at man ønsker å eksekutere på...", "source": "lecture"}
{"lecture_id": "linux8del5", "chunk_id": "linux8del5_0001", "start": 170.2, "end": 366.0, "token_count": 367, "text": "Og der har vi en konteiner som kjører i syv sekunder. Eller som har kjørt i syv sekunder. Konteineren er liksom selve instansen. Og imaget er det imaget som instansen er startet fra. Men nå er vi på en måte ute av konteineren igjen. Vi så også sist på hvordan vi kan koble oss til. Og det kan vi gjøre med... Det er et par materiører på her. Den beste måten er kanskje å bruke eksekut. For da kan man si at man ønsker å eksekutere på... I denne konteineren så ønsker jeg å kjøre bæsj. Så... Ops. Kanskje jeg ikke trenger IT her. Prøve IT her, da. Nei, da må jeg sjekke ut hvordan det var i brukt eksekutt. Skal vi se. Dette her burde virke. Sånn. Ja. Jeg lurer på hva jeg gjorde feil sist, men skal vi se. Det var bare rekkefølgen på IT. Jeg måtte ha... IT må komme etter eksigens. Sånn. Så da har jeg koblet meg inn i konteineren igjen. Da kan jeg se til meg at jeg har history, så jeg kan bla tilbake her. Og så er det en annen måte å gå ut av konteineren på. Det er kontroll P, kontroll Q. Da kommer jeg ut, og da vil jeg se at jeg fortsatt... System PS. Så står den fortsatt der og kjører.", "source": "lecture"}
