{"lecture_id": "linux1del6", "chunk_id": "linux1del6_0000", "start": 0.0, "end": 175.04, "token_count": 586, "text": "Jeg er nå logget inn i et terminalvindu, et såkalt Linux-skjell. Vi skal nå se litt på hvordan man beveger seg rundt i filsystemet ved hjelp av kommandoer. En første kommando er Pwd, Print Working Directory, som viser meg hvor jeg står i filsystemet. Og her er logget inn som en student, en testbruker på SSÅ. Og da ser vi at i dette tilfellet så er ikke home... ... slash home slash brukernavn, men vi ser vi har en annen path foran her. Og dette er fordi disse filene ligger ikke på denne serveren, men de ligger på en annen server. Hvis man beveger seg rundt i filsystemet, så kan det være greit å kunne liste hvilke filer man har. Og da er det en kommando som heter LS, som lister filer og mapper. Her ser vi at det som kommer ut i blått, er mopper, og det andre er filer. Hvis man lister med LS minus L, legger til opsjon L, så får man en lang listing. Vi skal senere se i detalj på hva alt dette her betyr. Men her kan man se at der det står en D først, er det for directory. Da er det en mappe. Og mappe kan man bevege seg ned i. Og hvis jeg f.eks. ønsker å gå til mappen undervisning, så bruker jeg CD, Change Directory, og så skriver jeg undervisning. Hvis det er litt lange ord, så er det et fint tips. Da fylles resten ut hvis det er entydig. En kjapp måte å gå ned til undervisning på, det er bare å skrive CDU, og så TAB, og så utføre-kommandoen ved å trykke Return. Så kommer jeg ned i undervisning. Når vi ser i det prompet her, så vises det hele tiden hvor jeg er. Så når man kommer et nytt sted, så er det ofte lurt å finne ut hva jeg er. Hva er det som finnes her? Jo, her ser vi... Her er det en mappe under her igjen. Så da kan jeg gå ned i den mappen med CD-mappe. Jeg kan skrive det helt ut sånn, CD-mappe. Og så har jeg kommet hit. Hvis mappen er tom, så... Så viser jeg sånn at den er tom. Da kommer det bare 12.0. LS viser ingenting.", "source": "lecture"}
{"lecture_id": "linux1del6", "chunk_id": "linux1del6_0001", "start": 139.84, "end": 303.1, "token_count": 481, "text": "Så når man kommer et nytt sted, så er det ofte lurt å finne ut hva jeg er. Hva er det som finnes her? Jo, her ser vi... Her er det en mappe under her igjen. Så da kan jeg gå ned i den mappen med CD-mappe. Jeg kan skrive det helt ut sånn, CD-mappe. Og så har jeg kommet hit. Hvis mappen er tom, så... Så viser jeg sånn at den er tom. Da kommer det bare 12.0. LS viser ingenting. Jeg må også kunne gå oppover igjen i filsystemet. Så da kan jeg ta cd. Den går ett hakk opp. Så nå er jeg kommet opp til undervisning. Hvis jeg nå går ned igjen, så kan jeg gå to steg opp på denne måten. Prikk, prikk, slash, prikk, prikk. Da kommer jeg helt øverst igjen. Så da kan jeg gå ned til undervisning. Så kommer jeg til hjemmemappen. Hvis man ønsker å få en blank skjerm, så kan man taste Kontroll-L. Blanke skjerm. Det kan også være praktisk. En del sånne tips som dette her står under Linux-hjelp på kurssiden. Vi kommer også til å gå gjennom litt mer detalj. Sånne små triks som gjør det raskere å bruke kommandolinjen. Nå er jeg et stykke ned i filteret, men det kan gå sakte bakover, sånn som dette her. Og så gå helt opp i toppen av filteret. Og da ser vi her... Nå er jeg på roten av filsystemet. Og så kan jeg gå tilbake igjen. Ned til U0, og ned til min bruker. S31830. Jeg kunne gjort alt dette her også ved å bare gå direkte opp til roten. Da er jeg helt øverst i filteret. Og så kan jeg gå hjem igjen ved bare CD. Kledd over til det. Så vil jeg nå se at nå er jeg hjemme.", "source": "lecture"}
