{"lecture_id": "linux5del5", "chunk_id": "linux5del5_0000", "start": 0.0, "end": 209.96, "token_count": 575, "text": "Head og tail er to nyttige kommandoer som man kan bruke til å se starten og slutten av filer. F.eks. hvis man ønsker å se de første fem linjene av et passord. Så kan man gjøre det på den måten. Head plukker da ut de fem første linjene. Hvis man bare vil se den første linjen, så legger du til opsjon. Bare vis første linje. Tilsvarende, hvis du da ønsker å se siste linje. Siste fem linjer, så kan du gjøre det på den måten, for du vil se de fem siste linjene av It's a Password. Man kan alltid... altså gjøre det motsatt. Man kan enten med en strøm av data... Så kan man pipe den til head. Eller hente et tail. Så kan vi se de siste tre linjene. Så kan jeg gjøre det på den måten. Og hett og telt kan jeg finne og kombinere med sort. La oss si jeg ønsker å sortere possordfilm på UiD. UiD er den... Altså user ID. Det er det tredje elementet. 1, 2, 3. Demon er én, Bind er to, osv. Og UiD0 er veldig spesielt, for det er Root. Så hvis du lager en... Man kan lage flere Root-brukere, men da vil de ha UiD0. Hvis noen har lagd en skjult rute, kan det være nyttig å se alle som har null, som UiD. Så det vi kan prøve å gjøre da, er å prøve å sortere hele postordfilen etter den UiD-en. Men vi ser i utgangspunktet at så er den delvis sortert etter... Vi kan se på Tail. Her er det litt mer hulter og bulter. 1000 kommer først, og så 1001. Så la oss prøve å sortere, og så sende til Tail. Vi har sett at vi kan sortere passordfilmen på denne måten. Bruker bare sort. Da sorteres det bare på det første elementet. Vi ønsker å sortere på det tredje. Det vi kan gjøre da, er å bruke en opsjon på sort som er minus T, kolon. Det betyr sorter et med kolon som merke. Og så ønsker vi kolonne 3. Da sier vi som tidligere minus K3.", "source": "lecture"}
{"lecture_id": "linux5del5", "chunk_id": "linux5del5_0001", "start": 163.16, "end": 354.02, "token_count": 581, "text": "Så la oss prøve å sortere, og så sende til Tail. Vi har sett at vi kan sortere passordfilmen på denne måten. Bruker bare sort. Da sorteres det bare på det første elementet. Vi ønsker å sortere på det tredje. Det vi kan gjøre da, er å bruke en opsjon på sort som er minus T, kolon. Det betyr sorter et med kolon som merke. Og så ønsker vi kolonne 3. Da sier vi som tidligere minus K3. Så nå sorterer vi med kolonne 3. Så sender vi det til så de får de fem siste. Men vi ser her er det et eller annet som ikke går helt bra. For dette ser ikke sortert ut. Og det er fordi vi sorterer alfabetisk. Så default sorterer sort alfabetisk, så vi må legge på en N for å få numerisk sort. Og den N-en må ligge foran K-en, hvor den er minus K. Sånn. Da sorterer vi numerisk, og da ser vi vi får de siste UID-ene. Vanlige brukere starter typisk på 1000, så når jeg har lagt til en bruker her, S123456, får da UID 1001. Og nobody har den høyeste UID-en. Men vi ønsker å se i den andre enden, og da kan vi bruke Head. En Ruth-bruker som har UD0. Så... På denne måten ser vi hvordan Sort og Head og Tail kan brukes sammen. En annen veldig nyttig måte å bruke Tail på, det er å legge på minus F. Da vil den følge filen. Hvis man endrer på en fil mens man bruker Tail minus F, Vise det som blir lagt til i filen. Det kan være nettopp på loggfiler. Vi kan se på en fil som heter authotlog, og som viser innlogginger. Men man må være Harud rett etter for å se på den. Så vi kan ta Sudhotel, og da... Nå har jeg nylig tastet inn passord. Ellers måtte jeg taste inn passordet for gruppe 100. Dette er nå live forsøk på å logge seg inn, som da vises i denne loggfilen. Og med TailminsF så ber vi Tael om å følge denne loggfilen og vise alt som kommer inn fortløpende. Og da ser vi her er det en masse sånne fail password from 159... Dette er da en IP.", "source": "lecture"}
{"lecture_id": "linux5del5", "chunk_id": "linux5del5_0002", "start": 318.16, "end": 402.56, "token_count": 282, "text": "Så vi kan ta Sudhotel, og da... Nå har jeg nylig tastet inn passord. Ellers måtte jeg taste inn passordet for gruppe 100. Dette er nå live forsøk på å logge seg inn, som da vises i denne loggfilen. Og med TailminsF så ber vi Tael om å følge denne loggfilen og vise alt som kommer inn fortløpende. Og da ser vi her er det en masse sånne fail password from 159... Dette er da en IP. Som prøver å logge seg inn som bruker Ruth, og så prøver den et tilfeldig passord. Typisk er dette et script som har en liste med passord. Sånne vanlige, brukte RUT-passord. RUT-RUT blir testet først. Så ser vi den samme IP-en som om og om igjen prøver ut en rekke RUT-passord for å komme inn på denne Linux-VM-en. Det er derfor dere må være spesielt forsiktige med å sette god passord på konto. Men altså... Taleminus-f. Det gjør at man kan følge en fil og så se live hvordan den oppdateres.", "source": "lecture"}
