{"lecture_id": "linux10del1", "chunk_id": "linux10del1_0000", "start": 0.0, "end": 197.88, "token_count": 583, "text": "Virtualisering. Når vi snakker om virtualisering på server- eller maskinnivå, så ser vi for oss virtualisering av en hel server eller en desktop. Det som virtualiseres, er all hardwaren til denne serveren. I denne figuren ser vi det vanlige bildet som vi har hatt tidligere i operativsystemer. Vi har hardware nederst, med SVPU, RAM, IO osv. Bildet vi startet med i vår, var at oppå her hadde vi et operativsystem som styrte alt. Men når vi snakker om virtualisering, så er det da en hypervisor som kjører oppå her. Og en hypervisor kan være en... En helt dedikert hypervisor, som i praksis vil inneholde et operativsystem. Eller så kan det være et operativsystem som har en del kjernemoduler som hjelper til med virtualiseringen. Uansett så vil det da være et lag mellom hardware og operativsystemer og applikasjoner som kjører på toppen. Så vi ser at denne hypervisoren her, den tilbyr tre grensesnitt. Med CPU, RAM og IO til operativsystemer. Dette er et bilde på at vi kjører tre virtuelle maskiner. De virtuelle maskinene her... For operativsystemet her ser det ut som det kjører på fysisk kalver. Det ser på en måte ut som operativsystemet her... Vi kan ikke se forskjell på om det kjører på hypervisor, et virtuelt grensenett, eller om det kjører direkte på rammen. Det er ikke helt sant. Det vil være mulig å finne ut, men i hvert fall sånn generelt med hypervisor av type 2, vi skal se på de typene senere, så er de lagd sånn at OS kan kjøre Helt uten endringer, rett på hypervisoren. Det betyr at da kan man ta en helt vanlig Ubuntu 1804 og boote opp på hypervisoren, og den kjører akkurat som om man hadde bootet den opp på hardware direkte. Det viktige hypervisorene gjør, er å simulere hardware, som gir nøyaktig samme grensenytt som hardware gjør. Ja, og som jeg sa, operativsystemene som kjører på en virtuell maskin, de tror de kjører på ekte hardware. Dette er ganske viktig sikkerhetsmessig også. Det gjør at denne type virtualisering", "source": "lecture"}
{"lecture_id": "linux10del1", "chunk_id": "linux10del1_0001", "start": 153.6, "end": 265.68, "token_count": 277, "text": "Det betyr at da kan man ta en helt vanlig Ubuntu 1804 og boote opp på hypervisoren, og den kjører akkurat som om man hadde bootet den opp på hardware direkte. Det viktige hypervisorene gjør, er å simulere hardware, som gir nøyaktig samme grensenytt som hardware gjør. Ja, og som jeg sa, operativsystemene som kjører på en virtuell maskin, de tror de kjører på ekte hardware. Dette er ganske viktig sikkerhetsmessig også. Det gjør at denne type virtualisering er en sikker måte å fordele applikasjoner på VM-er. Så det betyr at denne VM-en her, den er veldig god. Det er litt annerledes i dere, for... Vi har sett på dokker i tidligere uker, og da kjøres prosessene på samme operativsystem. Det ligner på dette her, men da kan vi ha to forskjellige OS i hver sin dokkerinstans. Men de kjører ikke på noen Hypervisor, de kjører inne i samme operativsystem. Og der er skillelinjene mindre.", "source": "lecture"}
