{"lecture_id": "linux12del78", "chunk_id": "linux12del78_0000", "start": 0.0, "end": 249.68, "token_count": 594, "text": "Generelt så kan man ta prosesser sånn som det her, og så kan man teipe til... Så kan man pipe til Forage. Og da er det... Egentlig så er det Forage of Objects. Som Forage er et... Så har man en løkke inni forage-objektstatementet. Og inni her vil man da løpe gjennom hvert av de objektene man fikk tilsendt. Da kan man f.eks. gjøre en test som if... Og når man løper gjennom forage-løkken, så har man en slags default variable, som er dollar underscore. Dollar underscore, den er da det objektet som nå testes ut i løkken. Så kan man da si hvis dollar underscorer sitt navn, hvis det er lik... Bruker samme eksempel som sist. Nopad. Nopad. Sånn. Hva om... Og da igjen dollar underscore sitt ikke navn, men id. Ja. Nå har vi vel ikke noen natta ennå for å kjøre, så jeg må starte den natta først. Hvis jeg da kjører målnineren... Så ser vi igjen. Så får vi... Så får vi det som kommer til å skje hvis vi ikke har med WATF, nemlig at Nopad blir drept. Så dette er en sånn veldig kraftig wallliner-metode. At man sender til Forage, og så inne i denne kodeblokken,  Så kan man da skrive kode som behandler ett objekt en gang. Det går an å gjøre dette på en litt annen måte, som er enda mer pipelining. Vi kan ta... Vi kan ta den biten her og kopiere. Så kan vi... Istedenfor å sende til Forridge, så kan vi sende det til en annen konstruksjon som jeg ikke har sett på før, som heter Ware Object. Og det er en konstruksjon som da plukker ut objekter av en spesiell type. Og så piper videre til Forridge. Så vi kan... Vi ønsker alle objekter som har et navn lik Knallpad, de ønsker vi å ta tak i pipen og sende videre. Da ser vi at vi får enda mer sånn én av én operasjon langs pipeninen. Så her sender vi prosesser, piper det til Vere Object. Dette ble en litt tilsvarende metode som sist. I forrige forsøk hadde vi en løkke inni forhåndsobjektet.", "source": "lecture"}
{"lecture_id": "linux12del78", "chunk_id": "linux12del78_0001", "start": 199.64, "end": 308.06, "token_count": 293, "text": "Og så piper videre til Forridge. Så vi kan... Vi ønsker alle objekter som har et navn lik Knallpad, de ønsker vi å ta tak i pipen og sende videre. Da ser vi at vi får enda mer sånn én av én operasjon langs pipeninen. Så her sender vi prosesser, piper det til Vere Object. Dette ble en litt tilsvarende metode som sist. I forrige forsøk hadde vi en løkke inni forhåndsobjektet. Dette blir da enda mer pipelining. Og igjen så skjer det ikke noe før vi har en opput. At det ene objektet som heter Noped, det kommer nå inn i pipeline. Da følger det sånn. Først å sende PS ut alle prosessobjekter. BareObject har en klausul her. Den sjekker... Jeg vil ha alle objekter hvor navnet er Noped. Så sendes det videre til 4H-objekt, og 4H-objektene tar alle objektene. Og for hvert av objektene, så... Det dreper den prosessen. Så dette er en sånn veldig ryddig måte å lage en fair plan på.", "source": "lecture"}
