{"lecture_id": "linux12del10", "chunk_id": "linux12del10_0000", "start": 0.0, "end": 241.86, "token_count": 592, "text": "Så skal vi se på... ja, et par kommandoer som er veldig nyttige. Som vi har tilsvarende i Linux. Og det er spesielt sort object og select object. De har mange egenskaper, men kanskje det mest nyttige er å sortere på bokstaver og tall. Men også da... belgutt fra en liste. Så vi kan prøve først å bruke LS. Så kan jeg sende det til sort. Vi kan skrive det fullt ut først. Sort object på den måten. Men så trenger vi å sortere et eller annet. Vi må si hva vi vil sortere på. Da kunne jeg, som vanlig, så kunne jeg sende LS til Game eller get members. Eksplosives, get member. Da får vi alle propper til det. Og så kan vi se... OK, length, den vil vi prøve. Så da tar jeg sort over objects. Og så ønsker jeg å sortere på lengde. Da ser vi... Vi får en sortert liste med hvor lengden står. Så kunne vi også ta med... Her kan man legge på opsjoner. Hvis jeg taster minus D her og tapp, så ser vi om vi får descending... Ja, det er eneste opsjon som begynner på D, men generelt så kan man... Her ønsker jeg det sending. Det betyr rett og slett at vi sorterer i synkende verdier. Sånn som dette objektet her, har en default utskriftsmetode. Ofte kan det være greit å kunne skrive det ut på andre måter. Det man generelt kan gjøre da, er å sende output til format table. Da kan man skrive ut sin egen liste over hva man ønsker å ha med. La oss si jeg ønsker å ha med name og lengd på den måten. Så da får jeg ut en formatert tabell med navnet først og lengden etterpå. Da kan man plukke ut nøyaktig det man ønsker, og få en grei overskrift. Dette kan forkortes til FT. FT... Så får man en sånn overskrift.  Ja. Noen ganger så... Du vil jo en sånn liste kunne bli ganske lang. La oss si jeg går opp hit. Og så skriver jeg ut den tilsvarende listen. Ja. Nå ble det ikke gjort noe lenger, det er bare fordi jeg tok LS. Men la oss si jeg tar nå LS minus R. Den er veldig nyttig. Da går man nedover. Der fikk jeg en masse filer.", "source": "lecture"}
{"lecture_id": "linux12del10", "chunk_id": "linux12del10_0001", "start": 190.66, "end": 433.52, "token_count": 599, "text": "Dette kan forkortes til FT. FT... Så får man en sånn overskrift.  Ja. Noen ganger så... Du vil jo en sånn liste kunne bli ganske lang. La oss si jeg går opp hit. Og så skriver jeg ut den tilsvarende listen. Ja. Nå ble det ikke gjort noe lenger, det er bare fordi jeg tok LS. Men la oss si jeg tar nå LS minus R. Den er veldig nyttig. Da går man nedover. Der fikk jeg en masse filer. Da er det et par ting vi kan gjøre her. Vi så noe rødt over skjermen. Vi kan luke bort feilmeldinger. Så vi kan ta feilmeldinger og sende til null. Ikke se alle, men plukke ut... Ja, la oss si de fem første. Og det er her select object kommer inn. Da kan vi si select object. Og så kan vi si first... Jeg ønsker bare de første fem. På den måten. Så vil jeg da plukke ut de fem største objektene. Og da ser vi... Da har vi veldig kjapt med en kommandolinje funnet et veldig kraftig verktøy, nemlig en metode å finne alle filer... Eller å finne de fem største filene som ligger i denne mappen. Den tar litt lengre tid, men den leter nå gjennom alle mapper på C-kolon, og så plukker den ut... Den sorterer da alle objektene etter lengde. Og så, etter at den har sortert, så velger den de første fem. Og så skriver den ut. Filosofien her er den samme som vi har sett i Linux. Men på en måte så er dette enda kraftigere, fordi vi har objekter som pipes imellom her. Det tar nok litt lengre tid og krever litt mer ressurser, men det er veldig fleksibelt når man skal programmere. Så dermed har jeg på kort tid fått ut de fem største fillene på disken. Ja... Vi snakker om tid. Ofte så kan det være nyttig å så måle... måletid. Og da er det en kommando som heter measure... Skal vi se... Measure command. Den tar da tiden på én kommando. Så man skriver mesh command. Starter med curl point S og avslutter med curl point S. Og da kan jeg generelt ta tiden på hvor langt de kommandoer bruker. Så det kunne jeg brukt for å sammenligne hastigheter av forskjellige skrift i Windows.", "source": "lecture"}
{"lecture_id": "linux12del10", "chunk_id": "linux12del10_0002", "start": 383.1, "end": 476.02, "token_count": 256, "text": "Ja... Vi snakker om tid. Ofte så kan det være nyttig å så måle... måletid. Og da er det en kommando som heter measure... Skal vi se... Measure command. Den tar da tiden på én kommando. Så man skriver mesh command. Starter med curl point S og avslutter med curl point S. Og da kan jeg generelt ta tiden på hvor langt de kommandoer bruker. Så det kunne jeg brukt for å sammenligne hastigheter av forskjellige skrift i Windows. Og da får vi ut en lang liste, og dette er et slags... Dette er et tidsobjekt. Men det vi ønsker å se her nå, er at dette tok 22 sekunder. Her kommer det ut en skrift. Her kommer det ut en utskrift. Men det vi vet fra PowerShell, er at egentlig så er nok dette her et objekt. Og det er da et objekt som man kan plukke ut og trekke ut sekunder osv. Og det har også metoder. Og det skal vi se generelt på nå. Det er på tide.", "source": "lecture"}
