{"lecture_id": "linux7del4", "chunk_id": "linux7del4_0000", "start": 0.0, "end": 201.1, "token_count": 577, "text": "Dette er et viktig diagram som vi nok kommer tilbake til. Senere i kurset skal vi snakke mye om virtuelle maskiner. Dere kjører allerede på en virtuell maskin nå, med de Linux-vevene vi har gitt dere. Er å forenkle det å... installere, drifte og kjøre servere. Tidligere, sånn ca. 20 år siden, så kjørte alle servere, webservere, databaser og alt, på fysiske servere. Som var bokser eller gjerne rackservere som sto i store rack, som de fortsatt gjør. Men da... Applikasjonene kjørte direkte på hardware. Altså her nede på det grå området. Da var det et host operating system, og så kjørte applikasjonene rett på den hosten. Til venstre i figuren her, så ser vi her står det hypervisor. Det er dette som er infrastrukturen som gjør at man kan kjøre virtuelle maskiner. Oppå hypervisoren kjører det tre forskjellige virtuelle maskiner. Helt øverst kjører applikasjonen. Da kan dette være Gest OS. Det kan være forskjellige versjoner av OS. Den røde kan være Ubuntu. Den oransje kan være Red Hat, og den grønne kan være Fedora f.eks. Eller det kan være det samme. Du kan ha tre sykler av det samme. Det som hypervisoren gjør, er at den for hver av disse virtuelle maskinene, så gir den det samme API-et som fysisk hardware gir. Og for en Ubunte VM som kjører her, så ser det akkurat ut som den kjører direkte på fysisk hardware. Men i virkeligheten så har den et virtuelt API her nede. Men alt den gjør... Det går gjennom hypervisoren. Dette forenkler veldig det med å sette opp, starte og stoppe servere. Men en ulempe, og kanskje den største ulempen med virtuelle maskiner, er at som dere ser her på dette eksempelet, så kreves det tre hele OS. De OS-ene er store. Vi snakker om OS som bruker mange gigabyte med ram. Hvis du kjører 100 sånne, så tar det opplagt enormt med ressurser. Og det er der docker kommer inn. Og konteinere.", "source": "lecture"}
{"lecture_id": "linux7del4", "chunk_id": "linux7del4_0001", "start": 152.68, "end": 283.6, "token_count": 422, "text": "Dette forenkler veldig det med å sette opp, starte og stoppe servere. Men en ulempe, og kanskje den største ulempen med virtuelle maskiner, er at som dere ser her på dette eksempelet, så kreves det tre hele OS. De OS-ene er store. Vi snakker om OS som bruker mange gigabyte med ram. Hvis du kjører 100 sånne, så tar det opplagt enormt med ressurser. Og det er der docker kommer inn. Og konteinere. For konteinerne som er på høyre side av bildet her, har mye av de samme egenskapene. Man kjører applikasjoner og man kan ha forskjellige operativsystemer. Det kan være igjen Ubuntu, Red Hat og Fedora f.eks. Tre helt forskjellige. Som applikasjonene kjører på. Men her ser vi... Her er det en veldig forenkling, for her er det bare ett underliggende operativsystem. Da er det en docker engine som ligger mellom operativsystemet og dockercontainerne. Som på en måte fyller inn all den forskjellen det gjør å være Ubuntu, Fedora eller Red Hat. Her med virtuelle maskiner, så bruker man en masse ressurser for å få til den fortsettelsen. Så derfor er Docker mye enklere på den måten at de bruker mindre ressurser, og de er lynraske å starte opp. Skal se etterpå at det går veldig fort å starte en Apache. ... webserver som kjører på dokker. For operativsystemet er allerede i gang. Hvis man starter en stor KVM-VM, så kan det fort ta et halvt minutt å starte. Mens det bare tar sekunder med dokker.", "source": "lecture"}
