{"lecture_id": "linux6del11", "chunk_id": "linux6del11_0000", "start": 0.0, "end": 234.76, "token_count": 600, "text": "Vi har sett hvordan vi kan kopiere over mapper med SEP. La oss nå gjenta det eksempelet her. Her har jeg en mappe TMP på Linux VM på IS100. Og på Studio SSO så har jeg ikke noen sånn mappe. Men da kan jeg prøve å kopiere over den mappen ved å... Gjøre SEP. Group 100... 100 at os.100.vlab.cs.joa.no. Sånn. Og så må jeg si hvor den skal ligge, kolon. Og det er TMP som jeg ønsker å kopiere over. Og jeg ønsker å kopiere den hit. Og så ønsker jeg hele mappen med unde mapper og filer. Og da må jeg ha med minus r. Da vil den kopieres over hit. Og jeg ser jeg har TMP der. Men hvis jeg gjør dette på nytt, så ser vi - igjen så vil alle filene kopieres over. Og da fins det en annen kommando. Rsynk. Så ser vi. Igjen vil alle filene kopieres over. Og da fins det en annen kommando. Rsync. Som er litt mer intelligent. Den sjekker hvilke filer som finnes. Og så kopierer den over bare de som ikke finnes. Så hvis jeg nå fjerner TMP-en... Og så kan vi teste ut RSYNC i stedet på samme mappe. Hvis man får en sånn fernmelding, så betyr det at man ikke har installert RSYNC på begge sider. Så det betyr her, så... På LinningsVM-en så har jeg ikke installert RSYNC. Så da må jeg ta en app-dinsal på RSYNC. Så har jeg installert den. Så kan jeg prøve igjen, og da... ... kan vi se om det har fungert. Da kan vi sjekke TMP. Ja, da har vi fått over tre filer. Så kan vi prøve å lage en ny fil her. Og så gjør vi Arsing på nytt. Og da... Hvis vi da ser på temp, så ser vi at da har ny fil kommet over. Vi kan ikke se det, men det som skjer i bakgrunnen, er at ingen av de eksisterende filene kopies over. Så dette er veldig nyttig hvis man skal ta backup fra et system til et annet. Så kan man også legge på... Jo, en liten detalj her er at... Hvis jeg nå sletter én fil... Sånn. På Os100. Og så gjør en ny Rsynk. Så vil vi se at den filen i TMP, den er der fortsatt.", "source": "lecture"}
{"lecture_id": "linux6del11", "chunk_id": "linux6del11_0001", "start": 187.8, "end": 272.72, "token_count": 251, "text": "Vi kan ikke se det, men det som skjer i bakgrunnen, er at ingen av de eksisterende filene kopies over. Så dette er veldig nyttig hvis man skal ta backup fra et system til et annet. Så kan man også legge på... Jo, en liten detalj her er at... Hvis jeg nå sletter én fil... Sånn. På Os100. Og så gjør en ny Rsynk. Så vil vi se at den filen i TMP, den er der fortsatt. Så her er det ikke én til én. Men hvis man ønsker at filer som slettes på det originale CD-et der man kopierer fra, også skal slettes dit man kopierer til, så kan man legge på minus, minus, delete. Sånn. Og da vil man se at det slettes nye filer. Det er ikke sikkert det alltid at man ønsker det. Hvis det er backup, Eller på dette stedet, så ønsker du kanskje at den fortsatt skal være der. Men det er da et valg.", "source": "lecture"}
