{"lecture_id": "linux7del12", "chunk_id": "linux7del12_0000", "start": 0.0, "end": 229.44, "token_count": 576, "text": "Det kom et veldig godt spørsmål i chatten i pausen, om hvordan Dokker er nyttig. Og hvordan man bruker det i praksis. Og det er selvsagt ikke absolutt alle som bruker Dokker i sine løsninger eller containere. Vi har hatt en enorm vekst i bruken, spesielt i litt mer moderne tider. F.eks. sånn som finn.no. Jeg hadde en student som begynte der for et par år siden. Da var han overrasket over at de i veldig stor grad brukte dokker. Det mange bruker er kybernetes, som er et system for å orkestrere dokkerbruk. Sette opp store systemer med databaser, webservere, servere som regner statistikk osv. Sette opp det sammen sånn at det kjører og fungerer. Det er kubernetis. Men hver av de elementene vil bestå av konteinere som gjør sine oppgaver. Det man typisk gjør, er å skrive kode og så teste den ut i en dockercontainer. Den containeren vil, når man tester, være akkurat den samme som du kjører i produksjon. Det er nettopp det med å teste kode som man lager, helt og nøyaktig i samme miljø. Det å forenkle og sette opp det miljøet. At de kan kopieres og så kjøres i produksjon. Det er det som er kanskje det aller viktigste med dokker og containere. Vi kommer ikke så langt inn på det i denne uke, men jeg tenkte neste uke så... Så kommer vi mer inn på det. Altså definere hvilke biblioteker og hva... Alt som man trenger for å kjøre en viss applikasjon. Litt som JVM. Jo, det er... Det er helt riktig. Den har samme funksjon som JVM, som er Java virtuell maskin. JVM gjør det samme som virtuelle maskiner, som også Docker gjør. Den abstraherer bort det underliggende hardwaren. Samme måte som en classfile kan kjøres på forskjellige JVM-er. Du kan ha en JVM på Windows og du kan ha en JVM på Linux. Begge kan kjøre den samme classfile. De kan kjøre på forskjellig hardware og forskjellige operativstemmer. Likevel får du akkurat det samme miljøet for din applikasjon som du har utviklet.", "source": "lecture"}
{"lecture_id": "linux7del12", "chunk_id": "linux7del12_0001", "start": 180.0, "end": 266.42, "token_count": 254, "text": "JVM gjør det samme som virtuelle maskiner, som også Docker gjør. Den abstraherer bort det underliggende hardwaren. Samme måte som en classfile kan kjøres på forskjellige JVM-er. Du kan ha en JVM på Windows og du kan ha en JVM på Linux. Begge kan kjøre den samme classfile. De kan kjøre på forskjellig hardware og forskjellige operativstemmer. Likevel får du akkurat det samme miljøet for din applikasjon som du har utviklet. Hvis man skal utvikle en applikasjon og teste den for ekstremt mange forskjellige miljøer, så blir det veldig vanskelig. Det forenkler lokket med at du kan utvikle i forskjellige containere, men kanskje enda bedre at man kan være en som dette er den containeren vi bruker. Alle utviklere og i all drift og all testing så brukes nøyaktig dette miljøet. Det miljøet er da veldig lett å spre til alle som er innholdet.", "source": "lecture"}
