{"lecture_id": "linux1del3", "chunk_id": "linux1del3_0000", "start": 0.0, "end": 194.68, "token_count": 591, "text": "Som du ser, befinner jeg meg nå på en Windows-maskin. Det er en virtual box windows som jeg kjører. Det er den samme som ligger i oppgave én, eller i de første UK-oppgavene. Så blir de som har Mac, bedt om å installere en virtual box windows. Og der den kjører fra. Det jeg har tenkt å se på nå, er hvordan man Logger seg inn fra Windows til StudySSH, som dere trenger å gjøre oppgaver i uke to. Så hvis jeg nå prøver å kjøre Putty, som er det programmet som jeg anbefaler at dere bruker for å logge dere inn med SH til en Linux-server fra Windows, så ser vi at den fins ikke her. Så... Hvis du ikke har Putty installert, så kan du installere den. Da er det egentlig bare å søke på Putty. Den første linken, så er det en som står det 'downloade', putty here. Så kan du gå dit. Kan du bruke en sånn installasjonsopplegg? Det enkleste er kanskje bare å ta den 64-bits-putty.xo her. Da legger jeg den på desktopen, så har man den til senere. Da har jeg putty her oppe. Så kjører jeg putty. Bare dobbeltklikker og rønner. Og det... Nå er alt klart til å logge inn på Study SSO. Det man trenger å gjøre da, er å skrive inn hosename for Study SSO. Så må man faktisk bruke HiOA. Jeg tror ikke DNS er oppdatert, sånn at OsloMet virker, men denne funker iallfall. Det er på port 22, som er default, når man bruker SSH. Så egentlig bare skriv inn den, og så return eller klikk open. Så får man en melding her. Det er altså man gjør. Gjerne for første gang man logger inn på en Linux-server, på en SSO-server, som er en sånn sikkerhet... En sånn ekstra sikkerhet for at det ikke er en man-in-the-middle-attack. Men når det er første gang, så kan du svare yes på den. Hvis det samme skjer andre gang, så kan man kanskje være litt mer obs. Men iallfall. Log inn ASS og det du gjør der, og så skriv inn studentnummeret ditt. Jeg har en testbruker, S318329, så du skriver inn det studentnummeret.", "source": "lecture"}
{"lecture_id": "linux1del3", "chunk_id": "linux1del3_0001", "start": 154.3, "end": 293.12, "token_count": 400, "text": "på en SSO-server, som er en sånn sikkerhet... En sånn ekstra sikkerhet for at det ikke er en man-in-the-middle-attack. Men når det er første gang, så kan du svare yes på den. Hvis det samme skjer andre gang, så kan man kanskje være litt mer obs. Men iallfall. Log inn ASS og det du gjør der, og så skriv inn studentnummeret ditt. Jeg har en testbruker, S318329, så du skriver inn det studentnummeret. Og så må du ikke legge på at oslomett osv. Hvis man gjør det, så kommer man inn, men da blir det noe trøbbel med innloggingen, sånn at man ikke kan endre på... lage nye filer osv. Så du bruker bare studentnummeret og så det samme passordet som du har på Kalmas og overalt ellers. Skal vi se om jeg får til det her. Sånn, ja. Hvis du skriver riktig passord, så kommer du da inn på Studiesse. Så. Hvis det er behov for det, så kan man endre på fonter i Putty. Jeg kan vise deg denne første der inne. Her er det en... Det gjorde nå å være høyre-klikke her oppe. Ja, jeg må opp på den baren der, og så høyre-klikke. Og så er det window appearance her. Der kan man endre fond. For eksempel jeg skrur 14, Apply... Så får jeg litt større fonder. Så kan jeg utføre Windows... Ikke Windows, men Linux-kommandoer i cellet, som Pwd, Ls, LS-l osv.", "source": "lecture"}
