{"lecture_id": "linux7", "chunk_id": "linux7_0000", "start": 0.0, "end": 255.86, "token_count": 590, "text": "Som dere ser, så er temaet for i dag konteinere og dokker. For et par år siden hadde vi en gjesteforeleser, Mike Long, som foreleste om dokker. Og han har et veldig bra opplegg. Så det jeg hadde tenkt å gjøre i dag, er å stort sett følge hans opplegg. I tillegg så er... så vil dere se på ukens oppgaver. At det er ikke så veldig mange oppgaver denne uken. Det er først noen fra OS-pensumet som gjelder hypertrening og tråder. Og så er det opplegg... obligatorisk fem. Fire og fem som er de obligatoriske. Oppgave fire går ut på å gå gjennom og teste ut mye av det vi gjør nå. Så er det en litt større oppgave nummer fem, som går ut på at man skal bruke dette til å sette opp en Docker Apache webserver. I tillegg skal man lage en kopi av den. Når man bruker containere, er det lett Målet med i dag er å få til dette her, å komme såpass langt. Å se hvor lett det er å sette opp en webserver med containere, og ikke minst hvor fort det går. Hvis vi kommer litt lenger, så er ukens utfordring å lage et selskap Det er en litt avansert utgave, men det viser hvor fort og langt man kan komme med å... OK. Så da tenkte jeg å starte først med å fortelle litt om dokker sånn helt generelt. Dere kan laste dere ned direkte fra presentasjonen. Det skal gå an. I tillegg ligger de under filer i kanvas, så dere kan se på de der. Og så er det veldig fint hvis dere stopper og spør. Eller ikke stopper, men dere kan skrive spørsmål i chatten, så skal jeg... Kan jeg svare på spørsmål i pausen også? Ok. Ja, som sagt... Mike Long, han... Han jobber i et firma som heter Pragma, og de jobber mye med devops og continuous delivery. I stedet for å ha én stor release én gang i året, så legger man ut ny kode fortløpende. For å få til det, er noe sånt som dokker og containere helt nødvendig. Så det er litt av bakgrunnen hans. Ja, her ser vi en slide om Continuous Delivery. Og det er egentlig litt sånn reklame også. Eller reklame...", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0001", "start": 193.2, "end": 440.0, "token_count": 597, "text": "Han jobber i et firma som heter Pragma, og de jobber mye med devops og continuous delivery. I stedet for å ha én stor release én gang i året, så legger man ut ny kode fortløpende. For å få til det, er noe sånt som dokker og containere helt nødvendig. Så det er litt av bakgrunnen hans. Ja, her ser vi en slide om Continuous Delivery. Og det er egentlig litt sånn reklame også. Eller reklame... En gang i året de siste årene så har de holdt en gratis åpen introduksjon til Continuous Delivery. Ja, forhåpentligvis er... Er vi ferdig med koronaviruset i august, så er planen om at de skal arrangere et sånt seminar. Det går over fire dager. Det er generelt veldig nyttig for dere. Så jeg anbefaler absolutt å melde dere på når dere får beskjed om det senere. Men vi skal se på hva er... Hva er dere? Ja. Igjen tar vi utgangspunkt i... Dette er Pragmas utgangspunkt, med at man har en developer som sitter her oppe øverst i diagrammet og skal skrive kode, som så skal bygges og kjøres. I motsetning til å ha store releaser, som er hvert halvår eller hver måned, releases fortløpende kode fra developeren. Og kjører gjennom hele kjeden, inkludert automatiske tester. Da gjør det å bruke containere... Det er bra. Det gjør dette mye enklere, eller det er det som kanskje muliggjør dette i det hele tatt. Derfor er det en sentral del i Continuous Delivery. Ideen med containere i det hele tatt er den samme som på containerskip. At man skal lage en enhet, en liten server som passer. Her oppe er det dokker. Konteinerne er bygd sånn at de lett kan stables oppå hverandre. Det er også ideen med dokker i dataverden. Man kan få en liten enhet og sette den til å kjøre hvor som helst. I motsetning til i tidligere tider, hvor man hadde store servere, som... Kjørte i maskinrom. De var veldig vanskelige å endre på. Og ikke minst var det vanskelig for utviklere å utvikle kode som fungerte, på mange forskjellige typer servere. Og alt det forenklet enormt ved hjelp av DotGit.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0002", "start": 399.4, "end": 617.16, "token_count": 588, "text": "oppå hverandre. Det er også ideen med dokker i dataverden. Man kan få en liten enhet og sette den til å kjøre hvor som helst. I motsetning til i tidligere tider, hvor man hadde store servere, som... Kjørte i maskinrom. De var veldig vanskelige å endre på. Og ikke minst var det vanskelig for utviklere å utvikle kode som fungerte, på mange forskjellige typer servere. Og alt det forenklet enormt ved hjelp av DotGit. Vi kommer nok litt mer til å se på bakgrunnen for dere litt mer teoretisk etter hvert. Målet er å se på teknologien og se hvordan den kan brukes. Det er en del begreper her. Det vi skal konsentrere oss om, er Docker Engine. Som på en måte er den installasjonen vi har gjort på Linux-VM-ene. Vi har allerede installert dokker, så for dere skal det bare være å logge inn på Linux-VM. Som Roots, det er det enkleste. Så kan dere da bare kjøre docker. Det skal vi se på i første praktiske del. I tillegg så har man DockerHub. Det er etter hvert veldig viktig. Det skal vi se mer på i neste uke. Det er litt sånn som Gitube, hvor man kan laste ned kode til prosjekter. Så kan man på DockerHub laste ned hele servere og hele systemer som... Dokker images, og så kan man kjøre det. Det er det som skjer når du kjører dokker Hello World, som er det første vi skal gjøre. Da lastes det ned et lite image. Og så kjøres det på lokalmaskinen. Så er det dokkemaskin og dokker composed. Det er begreper som vi ikke... Det er mer for å styre litt større systemer. Ok... ja. Her ser vi et bilde av noe som ser ut som ekte containere. Og en del av... eller kanskje den viktigste ideen er avhengighet. For eksempel så vil det generelt være vanskelig å ta et programsystem og kjøre på en annen servertype. Opplagt hvis du går fra Linux-servere til Window-servere, så er det umulig. Men det er også vanskelig å gå fra Red Hat til... Men det fine med dere er at hele den biten kan enkelt testes ut ved å kjøre containere. Da kan man starte opp en Ubuntu-container og en Reddat-container,", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0003", "start": 563.26, "end": 779.9, "token_count": 586, "text": "Og en del av... eller kanskje den viktigste ideen er avhengighet. For eksempel så vil det generelt være vanskelig å ta et programsystem og kjøre på en annen servertype. Opplagt hvis du går fra Linux-servere til Window-servere, så er det umulig. Men det er også vanskelig å gå fra Red Hat til... Men det fine med dere er at hele den biten kan enkelt testes ut ved å kjøre containere. Da kan man starte opp en Ubuntu-container og en Reddat-container, og så kan man teste ut og kjøre koden. Det skal vi se på etter hvert. Som vi nok kommer tilbake til. Senere i kurset skal vi snakke mye om virtuelle maskiner. Dere kjører jo allerede på en virtuell maskin nå med de Linux-VM-ene som vi har gitt dere. Hovedpoenget med virtuelle maskiner er å forenkle det å... Å installere, drifte og kjøre servere. Tidligere, sånn ca. 20 år siden, så kjørte alle servere, webservere og databaser og alt, på fysiske servere. Som var bokser eller gjerne rack-servere som sto i store rack, som de fortsatt gjør. Her nede på det grå området her. Infrastruktur. Da var det et host operating system, så kjørte applikasjonene rett på den hosten. Så ser vi til venstre i figuren her. Her står det hypervisor. Det er dette som er infrastrukturen som gjør at man kan kjøre virtuelle maskiner. Oppå hypervisoren så kjører det tre forskjellige virtuelle maskiner. Helt øverst kjører applikasjonen. Da kan dette være Gest OS. Kan da være forskjellige versjoner av OS. Den røde kan være Ubuntu. Den oransje kan være Red Hat. Og den grønne kan være Fedora f.eks. Eller det kan være det samme. Du kan ha tre sykler av det samme. Men det som hypervisoren gjør, er at den får hver av disse... Den gir det samme API-et som fysisk hardware gir. For en Ubuntu VM som kjører der, ser det ut som den kjører direkte på fysisk hardware. Men i virkeligheten har den et virtuelt API her nede. Men alt den gjør, går egentlig gjennom hypervisoren. Dette forenkler veldig.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0004", "start": 739.3, "end": 929.9, "token_count": 576, "text": "Eller det kan være det samme. Du kan ha tre sykler av det samme. Men det som hypervisoren gjør, er at den får hver av disse... Den gir det samme API-et som fysisk hardware gir. For en Ubuntu VM som kjører der, ser det ut som den kjører direkte på fysisk hardware. Men i virkeligheten har den et virtuelt API her nede. Men alt den gjør, går egentlig gjennom hypervisoren. Dette forenkler veldig. Det med å sette opp, starte og stoppe servere. Men en ulempe, og kanskje den største ulempen med virtuelle maskiner, er at som dere ser her i dette eksempelet, så kreves det tre hele OS. Og de OS-ene er store. Vi snakker om OS som bruker... Mange gigabyte med ram. Hvis du kjører 100 sånne, så tar det opplagt enormt med ressurser. Det er der dokker kommer inn. Og konteinere. For konteinerne som er på høyre side av bildet her, har mye av de samme egenskapene. At man kjører applikasjoner og man kan ha forskjellige operativsystemer. Det kan være igjen Ubuntu, Red Hat og Fedora f.eks. Tre helt forskjellige. Som applikasjonene kjører på. Men her er det en veldig forenkling, for her er det bare ett underliggende operativsystem. Da er det en docker engine som ligger mellom operativsystemet og dockercontainerne. Som på en måte fyller inn all den forskjellen det gjør. Med virtuelle maskiner bruker man masse ressurser for å få til den fortsettelsen. Derfor er dokker mye enklere på den måten at de bruker mindre ressurser. Og de er lynraske å starte opp. Skal se etterpå at det går veldig fort å starte en Apache-webserver som kjører på dokker. For operativsystemet er allerede i gang. Hvis man starter en stor KVM-VM, så kan det fort ta et halvt minutt å starte. Mens det bare tar sekunder med dokker. Ok. Som sagt, skriv gjerne spørsmål i chatten hvis det er noe dere lurer på. Ja. Dette var litt av det jeg begynte å snakke om. Tilbake på 2000-tallet...", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0005", "start": 887.86, "end": 1078.88, "token_count": 593, "text": "Og de er lynraske å starte opp. Skal se etterpå at det går veldig fort å starte en Apache-webserver som kjører på dokker. For operativsystemet er allerede i gang. Hvis man starter en stor KVM-VM, så kan det fort ta et halvt minutt å starte. Mens det bare tar sekunder med dokker. Ok. Som sagt, skriv gjerne spørsmål i chatten hvis det er noe dere lurer på. Ja. Dette var litt av det jeg begynte å snakke om. Tilbake på 2000-tallet... Man hadde svære servere. Og så fikk man en periode hvor man begynte å virtualisere. At da i stedet for å ha store fysiske servere som sto og kjørte i årevis, så var det en katastrofe om de gikk ned. Så begynte man å få virtuelle maskiner som var mye mer fleksible. Det er kommet enda lenger i dag med dokker. Det typiske med dokker er at du har én instans, én dokkercontainer, som kjører én tjeneste. Det er det den gjør. Ikke noe annet. Tidligere var det store servere som gjerne kjørte flere tjenester samtidig. Og de sto og gikk i årevis. Og de måtte da vel... Og det var veldig tungt å oppgradere, f.eks. å få inn nye biblioteker osv. Ofte så unngikk man det, så det tok veldig lang tid å oppgradere. Med Dokker så kom man bare i en fei. Plasserte et nytt oppdragsinstitutt med nye biblioteker. Og så er man klar til å kjøre videre med den nye versjonen. Én ting må nevnes når det gjelder Dokker. Det er sikkerhet. Og da, kan man si, generelt er virtuelle maskiner sikrere. Fordi det eneste de gir til VM-ene, er et API. Og det er veldig vanskelig å gjennom det API-et å kunne gå fra én VM til en annen. Det er praksis umulig. I hvert fall. Veldig vanskelig å komme opp her. Skillet er ikke så sterkt mellom to dokkecontainere. Du kan se på det som prosesser som kjører på samme maskin. Hvis du får hacket en av dem, så er det større muligheter til å komme inn på systemet og hacke den andre.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0006", "start": 1031.66, "end": 1257.96, "token_count": 589, "text": "Fordi det eneste de gir til VM-ene, er et API. Og det er veldig vanskelig å gjennom det API-et å kunne gå fra én VM til en annen. Det er praksis umulig. I hvert fall. Veldig vanskelig å komme opp her. Skillet er ikke så sterkt mellom to dokkecontainere. Du kan se på det som prosesser som kjører på samme maskin. Hvis du får hacket en av dem, så er det større muligheter til å komme inn på systemet og hacke den andre. Det er det største problemet i forhold til verktøy eller maskin. Nå skal vi straks begynne å kjøre noen containere. Da skal vi se at det er en liten applikasjon. Det er som sagt i praksis en prosess som er veldig avlukket. Ingen andre prosesser i det hele tatt... Nesten i det hele tatt kan se hva som skjer innenfor. Vi kan kjøre starte og stoppe og flytte og delete. Og laste ned nye fra Dockerup. Og vi kan også lage egne. Ja. Litt mer om VM-er i forhold til containere. Vi ser på... På høyre side ser vi en VM. Dette er VM-en, som kjører på et gjeste-OS. Så har vi Linux-kjernen her. Så ser vi at en container, det er på en måte midt imellom en vanlig prosess og en VM. Med virtuell maskin kjører prosessen her oppe på gjeste-OS. Mens her, konteineren, vi ser at det er en vanlig prosess, men den er isolert fra alle andre prosesser på en mye bedre måte enn standard. Her på venstre side ser vi det en nevnte, at her kjører de en Ubuntu-konteiner og så kjører de en SentOS-konteiner, men begge to kjører på den samme Linux-jern. Men de trenger en vinduskjerne under. Muligens får vi tid til å se på det også. Litt terminologi... Vi har konteinere. Vi har konteinere av imager. Images er hele... den blokken av konteinere. Hvis man har virtuell maskin, så er et image absolutt hele apparativsystemet og alt som kjører. Mens for konteinere så er et image ikke så stort som hele OS. Det er alt det du trenger for å få en generell Linux-hjerne til å se ut som en ubudt kjører.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0007", "start": 1200.0, "end": 1490.04, "token_count": 578, "text": "Men de trenger en vinduskjerne under. Muligens får vi tid til å se på det også. Litt terminologi... Vi har konteinere. Vi har konteinere av imager. Images er hele... den blokken av konteinere. Hvis man har virtuell maskin, så er et image absolutt hele apparativsystemet og alt som kjører. Mens for konteinere så er et image ikke så stort som hele OS. Det er alt det du trenger for å få en generell Linux-hjerne til å se ut som en ubudt kjører. Man starter images, og en instans som kjører et image, det kalles en container. Neste uke skal vi se litt på volumer, men det vil være lagringsplass for containerne. Opplagt så har de nettverk. Det er egentlig stort sett det vi ser på i dag. Vi tar imager og kjører det. Ja, da skal vi ta oss og kjøre en Hello World. Ja, jeg kan jo ta oss og... Med disse slidene så kan jeg ta og... I stedet for slidene... Det kan sikkert være fint for dere å ha slidene oppe. Men jeg kan da dele... Et dokkervindu med dere i stedet. Sånn. Jeg kan kanskje vise hvordan det er tenkt at dere skal gjøre det. Her er jeg inne på desktopen min, som står nede på bordet mitt. Og så går jeg inn som jeg bruker OS70. Dere bare logger inn på den som vanlig. Ja, generelt så må man bruke sudo for å kjøre dokker. Som jeg snakket om tidligere, dette er VM-er, så man trenger ikke være like bekymret for å kjøre ting som Ruud. Hvis noe galt skjer, går det an å bygge For de som er interessert, kan du se at her ligger en dokker.so. Jeg installerte dokker på VM-en, så var det eneste jeg gjorde, var å kjøre det scriptet der. Det installerer sertifikat og noe greier. Så henter det ned dokker fra dokker.com. Så er det som er installert, dokker. Når man har gjort det, så kan man begynne å kjøre konteinere. Så vi kan starte med dokkesteiner grønn. Også Hello World. Det er en bitte liten dokker hello world. Da ser vi den starter oss oppover. Men da har den kjørt en liten container.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0008", "start": 1419.68, "end": 1733.08, "token_count": 579, "text": "Jeg installerte dokker på VM-en, så var det eneste jeg gjorde, var å kjøre det scriptet der. Det installerer sertifikat og noe greier. Så henter det ned dokker fra dokker.com. Så er det som er installert, dokker. Når man har gjort det, så kan man begynne å kjøre konteinere. Så vi kan starte med dokkesteiner grønn. Også Hello World. Det er en bitte liten dokker hello world. Da ser vi den starter oss oppover. Men da har den kjørt en liten container. Vi kan kanskje gå tilbake til slidene og se på hva som egentlig skjer her. Etter hvert skal vi kjøre litt mer avanserte ting. Istedenfor Hello World kan man kjøre Ubuntu. Da starter opp tilsvarende en hel Ubuntu-server. Dokker-info og dokker-version gir litt informasjon om installasjonen. Så ser vi... Den kommandoen der var det jeg kjørte. Men hva var det som egentlig hendte, da? Når jeg kjører dokker-rund, så er det egentlig flere kommandoer som skjer. Men det er bare dokker-bild, dokker-pull og dokker-rund. Så man kjører egentlig de tre kommandoene der. Og pull, dvs. at den går ut i dokkerhøv, som er et repositorium. Altså et lager av forskjellige dokker-images. Som vi ser her, kan vi hente EngineX eller hele Ubuntu. Så lastes det imaget ned fra Dockerup hit. Det var pull og så rund. Da kjøres det imaget som en container. Disse slidene er bygd opp sånn at her står det... Your turn, hello world. Men da fant jeg ut i går at det er litt problem hvis man trykker på de, så... Jo, så kommer man ikke... Her er en feil med... Den går til exercise. Da får du en feilmelding om at du ikke finner siden. Man trenger ikke gå gjennom det på den måten. Man kan også gå... Vi har en link i oppgavesettet. Prøv å gå dit den måten her. Jeg deler et annet vindu, sånn at vi... Sånn, ja. Hvis jeg trykker her, så ser du det kommer opp en... 04. Hvis jeg da tasser inn null foran eneren her... Tydeligvis er ikke dette oppdatert.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0009", "start": 1640.38, "end": 1990.02, "token_count": 600, "text": "Jo, så kommer man ikke... Her er en feil med... Den går til exercise. Da får du en feilmelding om at du ikke finner siden. Man trenger ikke gå gjennom det på den måten. Man kan også gå... Vi har en link i oppgavesettet. Prøv å gå dit den måten her. Jeg deler et annet vindu, sånn at vi... Sånn, ja. Hvis jeg trykker her, så ser du det kommer opp en... 04. Hvis jeg da tasser inn null foran eneren her... Tydeligvis er ikke dette oppdatert. Da kommer jeg til den riktige. Ellers kan dere følge linken som står i oppgaven. Disse oppgavene er egentlig sånn selv... help contain, som man kan kalle det. Dere kan gå gjennom og så gjøre bit for bit. Men det jeg tenkte, var at vi kan gjøre det sammen. Prøv å gjøre det samtidig som jeg gjør det. Eller alternativt, hvis dere foretrekker, så kan dere slappe av og se på når jeg gjør det første gang. Og så kan dere stille og rolig på egen hånd teste det ut selv senere. Første oppgave har vi allerede gjort. Kjør Love World. Det vi kan prøve å gjøre, er å gjøre en litt mer avansert oppgave. Nemlig å... Start opp en container. Ja, jeg ser at noen har problemer med å se noe her. Men at det virker å refreshe sidene. Nå har jeg problemer med å selge et vindu. Sånn. Jeg startet med å kjøre Docker container rundt Hello world. Men da kan jeg prøve å kjøre et helt OS. Hvis jeg skriver minus IT, gir jeg for interaktivt. T er for at en skal sette opp en T10. Så kan jeg f.eks. bare si Ubuntu, for å få opp en Ubuntu-VM. I noen av oppgavene senere kjører de Alpine, som er en sånn mini... Liten Linux-installasjon. Jeg kan starte Ubuntu her, så vi er litt mer vant til det. Så må jeg starte et bæsjvindu også, for å... Nå står den og sier... og da er den ute på og henter ned et image. Uansett hva slags Linux jeg har, eller hvilken distribusjon jeg har lokalt her, så vil det imaget sørge for at dette ser helt ut som... Vi har fått opp et promp som Ruth.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0010", "start": 1929.36, "end": 2179.34, "token_count": 592, "text": "I noen av oppgavene senere kjører de Alpine, som er en sånn mini... Liten Linux-installasjon. Jeg kan starte Ubuntu her, så vi er litt mer vant til det. Så må jeg starte et bæsjvindu også, for å... Nå står den og sier... og da er den ute på og henter ned et image. Uansett hva slags Linux jeg har, eller hvilken distribusjon jeg har lokalt her, så vil det imaget sørge for at dette ser helt ut som... Vi har fått opp et promp som Ruth. Jeg er Ruth. Det pleier man å være i de imagene. Vi har et fullt filssystem her. Dette ser ut som en... Eller, det er en praksis. Jeg får opp Ubuntu 1804. Jeg prøver en liste prosesser, så ser vi at det er veldig lite prosesser som kjører. Det er en av de tingene som er gjort med tegnere, at man skiller det helt fra resten av apparativsystemet. Selv om jeg vet at under her er det et fullt OL som kjører. Den store forskjellen nå, hvis jeg kjører exit her, så er hele den containeren som jeg startet opp og kjørte, den store forskjellen nå... Den er stoppet fullstendig. Kjører ingenting av det som jeg hadde tillit til. Sånn generelt så kan jeg kjøre dokkecontainer-PS. Da viser jeg alle containere som kjører. Da er det ingen containere som kjører, men hvis jeg legger på AS... Jeg har et stort vindu for å få med alt, så da er det kanskje vanskelig for dere... ... vanskelig for dere å se. Klarer du å se dette? Det er helt på grensen om det går. Poenget er at... Bare si hva det er. Dette er en listing av alle de tre konteinerne som... Ingen av de kjører. Status er 'exited' for alle sammen. Hovedpoenget er når du starter og kjører en konteiner... Da stopper den igjen etterpå, så fjerner du hele konteineren. Jeg kan prøve å bare starte på nytt. Nå så vi... Nå gikk det mye fortere. Det går egentlig ekstremt kjapt å starte og stoppe en container. Så nei, den kommandoen her startet og stoppet... En hel server, kan du si. Med fysisk server tar det mange minutter.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0011", "start": 2139.2, "end": 2398.68, "token_count": 597, "text": "Hovedpoenget er når du starter og kjører en konteiner... Da stopper den igjen etterpå, så fjerner du hele konteineren. Jeg kan prøve å bare starte på nytt. Nå så vi... Nå gikk det mye fortere. Det går egentlig ekstremt kjapt å starte og stoppe en container. Så nei, den kommandoen her startet og stoppet... En hel server, kan du si. Med fysisk server tar det mange minutter. Med en VM tar det fort i hvert fall et halvt minutt. Men med... Ja, jeg ser... Det er ikke timer. Tenkte å prøve å ta tiden på denne. Med dere så går det veldig fort. Der ser du start og stopp på under fem sekunder. OK. Vi skal se mer i detalj på hvordan man stopper og starter. Men jeg tenkte vi kunne gå litt tilbake til høydene. De følgende slidene handler generelt om å kjøre imager, som vi gjorde. Det er mulig å laste ned imager. Hvis jeg kjører docker container-en, så både lastes ned og startes imager. Docker pull og alpine. Et spørsmål her... Er skrivebordsprogrammet f.eks. dokkere? Nei, altså et standard skrivebordsprogram er ikke en dokkerinistans. Et standard skrivebordsprogram er mer sånn klassisk at det er... Det som er spesielt med Docker, er at det typisk bare kjører én eneste tjeneste. F.eks. en regneoppgave eller en webserver eller en database. Men det eneste Docker-instansen gjør, er å kjøre den tjenesten. Da kan man... Det betyr at man da laster ned et image. Som man så kan kjøre. Ja... I neste runde skal vi teste ut noen av disse her. Vi kan bare se kort på hva man kan gjøre. Den kommandoen her... Den starter opp Alpine. Alpine er en liten... Alpine er en liten Linux-versjon som er veldig lett. Ubuntu er stor, mange gigabyte. Alpine er veldig liten og lett. Men det som skjer, er at man starter opp Alpine, gjør LS-L, og så stopper hele containerne. Tilsvarende her så starter man Alpa1 og bare skriver ut. Et skrivebordsprogram har flere dokker som kjører? Nei, det er på en måte helt forskjellige greier. Det spørs hva du mener med et skrivebordsprogram. Men...", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0012", "start": 2350.22, "end": 2634.02, "token_count": 597, "text": "Alpine er en liten Linux-versjon som er veldig lett. Ubuntu er stor, mange gigabyte. Alpine er veldig liten og lett. Men det som skjer, er at man starter opp Alpine, gjør LS-L, og så stopper hele containerne. Tilsvarende her så starter man Alpa1 og bare skriver ut. Et skrivebordsprogram har flere dokker som kjører? Nei, det er på en måte helt forskjellige greier. Det spørs hva du mener med et skrivebordsprogram. Men... Generelt så kan du kjøre mange dokkere, mange dokkerinstanser samtidig. En av oppgavene denne uken går på å sette opp ni webservere som er helt uavhengige av hverandre, og som kjører dokker. Men det viktige med det oppsettet er at i praksis så bruker alle de ni underliggende kreativsystemet som er det samme. I tidligere tider, når man da brukte VM-er, det gjør man fortsatt, så når man starter ti VM-er, så starter man hele OS for hver av de VM-ene. Det tar mye tid og det tar mye ressurser. Så det er den største forskjellen. Jeg kunne kanskje bare gå inn og se kjapt på hvordan... ser det ut? Ja, nå har jeg gått inn på Dokkerhaug, og her liker det da imager som... Som kan lastes ned. Det vi lastet ned var Ubuntu. Hvis jeg går på Explore her, så vil man se at det er et uttall. Her er det 21 av 3 mill. forskjellige imager. Det er imager som... Av forskjellige typer, som er lastet opp. Her har vi buntet som vi nettopp losset ned. En rekke imager. Da kan man bare lock and run Debian, så får man en Debian-versjon som man... Så kan man også selv laste opp imager til. Det er et stort men, og det er sånn sikkerhetsmessig, altså sånn som Ubuntu følger opp sine egne imager, men det er et generelt problem med sikkerhet. Og man vet hva egentlig et image inneholder. Litt sikkerhetsmessig er det litt mer Mer tvilsomt enn om man installerer systemer og applikasjoner selv. Imagetags kan man også se på i neste... ... gjør det selv. Imagetags er generelt sånn at man kan velge hvilken nasjon Ja, vi tar en pause.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0013", "start": 2550.0, "end": 2864.0, "token_count": 595, "text": "Det er et stort men, og det er sånn sikkerhetsmessig, altså sånn som Ubuntu følger opp sine egne imager, men det er et generelt problem med sikkerhet. Og man vet hva egentlig et image inneholder. Litt sikkerhetsmessig er det litt mer Mer tvilsomt enn om man installerer systemer og applikasjoner selv. Imagetags kan man også se på i neste... ... gjør det selv. Imagetags er generelt sånn at man kan velge hvilken nasjon Ja, vi tar en pause. For dere som har lyst til å jobbe litt i pausen, så kan dere gå videre og teste ut... Neste slide. Noen slider til. Your turn, running images. Det kan dere gå i gang med. Da tar vi... Da tar vi... ... gutten min. Så kan vi ta dem opp når... Pausen er over. Ja, da starter vi igjen. Det kom et veldig godt spørsmål i chatten i pausen om hvordan dere er nyttige og hvordan. Man bruker det i praksis. Og det er selvsagt ikke absolutt alle som bruker dokker i sine løsninger eller containere, men vi har hatt en enorm vekst i bruken. Spesielt i litt mer moderne områder. F.eks. som finn.no. Da var han overrasket over at de i veldig stor grad brukte dokker. Det mange bruker er kybernetes, som er et system for å orkestrere dokkerbruk. Altså sette opp store systemer med databaser, webservere som regnesatistikk osv. Sette opp det sammen sånn at det kjører og fungerer. Det er kubernettis. Men hver av de elementene vil bestå av konteinere som gjør sine oppgaver. Sånn konkret for en programmerer så er det man typisk gjør, er å skrive kode og så teste den ut i en dockercontainer. Conteineren vil være akkurat den samme som du kjører i produksjon. Det er nettopp det med å teste kode som man lager, helt og nøyaktig i samme miljø, det å forenkle og sette opp det miljøet, at det kan kopieres og så kjøres i produksjon, det er det som er kanskje det aller viktigste med dokker og containere. Vi kommer ikke så langt inn på det i denne uke, men jeg tenkte neste uke, så... så kommer vi mer inn på det.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0014", "start": 2820.02, "end": 3058.52, "token_count": 600, "text": "Conteineren vil være akkurat den samme som du kjører i produksjon. Det er nettopp det med å teste kode som man lager, helt og nøyaktig i samme miljø, det å forenkle og sette opp det miljøet, at det kan kopieres og så kjøres i produksjon, det er det som er kanskje det aller viktigste med dokker og containere. Vi kommer ikke så langt inn på det i denne uke, men jeg tenkte neste uke, så... så kommer vi mer inn på det. Se hvordan vi kan bruke Dockerfiles og definere hvilke biblioteker og hva... Alt som man trenger for å kjøre en viss applikasjon. Det er helt riktig. Den har samme funksjon som Jodhlem, som er Java virtuell maskin. Jodhlem gjør det samme som virtuelle maskiner, som også dere gjør. Den abstraherer bort det underliggende hardwaren. En classfil kan kjøres på forskjellige JVM-er. Du kan ha en JVM på Windows og du kan ha en JVM på Linux. Begge kan kjøre den samme classfilen. På samme måte gjelder det med docker-images. Altså at de kan... ta seg av alle avhengigheter. Sånn at de kan kjøre på forskjellig hardware og også på forskjellige operativstemmer. Likevel får du akkurat det samme miljøet for din applikasjon som du har utviklet. Det er det som er viktig. Hvis man skal utvikle en applikasjon og teste den for ekstremt mange forskjellige miljøer, så blir det veldig vanskelig. Det forenkler lokker for det første med at du kan utvikle i forskjellige containere. Dette er den containeren vi bruker. Alle utviklere og i all drift og all testing brukes nøyaktig dette miljøet. Det miljøet er veldig lett å spre til alle som er innholdet. OK. Your turner and images, ja. Jeg tror egentlig vi har sett på det meste av kjøring. Vi kan kjøre litt flere eksempler. Da kan jeg... Linux-VM-vinduet igjen. Vi kan også kjøre det... f.eks. lukket container... Så kan vi beskrive en melding. Hvis vi kjører den, så ser vi. Den finner ikke alpaen lokalt, altså imaget. Dermed så henter den det fra dokker opp og laster ned.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0015", "start": 2976.26, "end": 3269.72, "token_count": 588, "text": "brukes nøyaktig dette miljøet. Det miljøet er veldig lett å spre til alle som er innholdet. OK. Your turner and images, ja. Jeg tror egentlig vi har sett på det meste av kjøring. Vi kan kjøre litt flere eksempler. Da kan jeg... Linux-VM-vinduet igjen. Vi kan også kjøre det... f.eks. lukket container... Så kan vi beskrive en melding. Hvis vi kjører den, så ser vi. Den finner ikke alpaen lokalt, altså imaget. Dermed så henter den det fra dokker opp og laster ned. Hvis jeg gjør det en gang til, så går det mye fortere. Da kommer det fra alpaen med en gang. Så kan jeg ta igjen og liste... Ja, det var litt rart. Det hadde jeg forventet å... ... det ligge noen... Da ser vi... jeg kan prøve å holde det i den formen så dere ser. Det første som står, er ID-en. Det er også navnet til konteineren. Så ser vi image. Her har vi Alpine, Ubuntu og Low World. Det er de tre imagene vi har lastet ned. Status på alle sammen er exit, altså at vi har kjørt dem ferdig. Ja, det er vel stort sett det vi trenger for å kjøre konteinere. Etter hvert skal vi se litt hvordan man... Hvordan man kobler seg til konteinere som kjører. Det vi har gjort nå hele tiden, er at vi har startet konteinere, og så har vi stoppet igjen. Og da ligger imaget der fortsatt, men konteineren selv er stoppet. Og det er akkurat som om man starter en prosess og kjører en prosess. Og stopper en prosess. Det er ikke verre. Deleting skal ikke brukes av veldig mye tid på det. Men konteinere er en veldig kast å bruke. Det gjelder også virtuelle maskiner. For dere som kjører skytjenester, er dere vant til at dere bare kan starte på en ny VM. Hvis et eller annet galt skjer, så kan man... Ta et nytt image og start en ny VM. Det samme gjelder konteinere, men i enda høyere grad. Det er kast og bruk. Ja, her er det litt om... vekt for å se på... Jeg tror vi hopper over det. Dere kan jo se på det på egen hånd.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0016", "start": 3219.16, "end": 3465.68, "token_count": 585, "text": "Men konteinere er en veldig kast å bruke. Det gjelder også virtuelle maskiner. For dere som kjører skytjenester, er dere vant til at dere bare kan starte på en ny VM. Hvis et eller annet galt skjer, så kan man... Ta et nytt image og start en ny VM. Det samme gjelder konteinere, men i enda høyere grad. Det er kast og bruk. Ja, her er det litt om... vekt for å se på... Jeg tror vi hopper over det. Dere kan jo se på det på egen hånd. Vi kan ta litt på hvordan man sletter konteinere. Generelt, hvis du ikke sletter konteinerne, så ligger alle der når du lister Docker Container LS. Det er ikke noe stort problem, for det tar ikke veldig mye plass. Det er imagene som tar plass. Men det kan bli rotete, så det kan være greit å rydde opp på det. Det sletter da tegnerne. Men Docker Image RM sletter image. Og image kan ta litt plass. Dere har ikke så voldsomt mye plass på VM-ene. Men dere har noen gigabyte. Men hvis dere kjører veldig mange forskjellige docker-imager, og spesielt store, så kan det ta mye plass. Og da kan det være lurt å slette... Du kan ta dokker image proon. Det vil da fjerne alle. I hvert fall de som ikke er aktivt. Vi kan teste litt fjerning. Skal vi se om... Der kommer det. Så ser vi at jeg har en liste med tegnere. Så kan jeg... ta RM på en av de. Den ID-en der, det er faktisk det samme som host name. Men det har også... Vi ser alle har en del sånne rare navn. Man kan også bruke det navnet, som er enklere å huske. Men nå tar jeg bare sletter med ID-en. Hvis jeg lister på nytt nå, så forsvant en av vennene mine. Container, da. Kan jeg ta den Tender Williams, f.eks.? Vi kan prøve Loving Shed. Da forsvant den også. Hvis jeg tar bare dokker, container, LS, så får jeg bare de som kjører. Men det er ingen nå. Minus A gir alle. Så så vi at vi hadde en prun. Jeg kan prøve sånn som det. Da ser vi... Slette alle Stop containers. Da sier jeg ja, og da sier jeg... alle.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0017", "start": 3404.12, "end": 3717.84, "token_count": 591, "text": "så forsvant en av vennene mine. Container, da. Kan jeg ta den Tender Williams, f.eks.? Vi kan prøve Loving Shed. Da forsvant den også. Hvis jeg tar bare dokker, container, LS, så får jeg bare de som kjører. Men det er ingen nå. Minus A gir alle. Så så vi at vi hadde en prun. Jeg kan prøve sånn som det. Da ser vi... Slette alle Stop containers. Da sier jeg ja, og da sier jeg... alle. Så der er alle borte. En gang iblant så kan det være greit å rydde opp. Jeg skrev kommandoen feil. Skal prøve å få øye på hva jeg gjorde feil. Ja, jeg skrev docker images ls, og da fikk jeg ikke opp noen ting. Det kan kanskje være instruktivt, for jeg fikk ikke noen god feilmelding heller. Men det er viktig å ha syntaksen riktig. Docker image LS. Da ser jeg... Disse tar litt mer plass. Men... Så disse imagene kan det være lurt å rydde opp i. Men likevel tar det ikke så voldsomt plass. 64 MB er veldig lite for en ubuntu. Så tar det i hvert fall en white med disk-plass. Så man kan også slette disse... Da forsvant den. Og da betyr det ganske enkelt... Hvis jeg nå starter en ny Ubuntu... Vi kan prøve å starte 14.04, så får vi til det. Det jeg gjorde nå, var at jeg ikke ba om et skjell. Da skal vi si at da får jeg ikke opp noe skjell som jeg kan gjøre noe inni. Jeg ser nå, siden jeg ikke hadde lastet ned 1404 før, så blir den lastet opp. En... Jo, jeg fikk faktisk opp et skjell likevel. Housename er den ID-en som vi får når vi lister opp. Det dere kan se nå, er at... Hvis jeg nå går ut igjen og lister images, så ser vi at nå har jeg fått opp den. Den er litt mindre. Da ser vi igjen. Andre gang jeg kjører, så går det mye fortere. Da skal vi se på ett poeng som er viktig i forhold til å sette opp webservere. Det vi skal prøve nå, er å få til en maskin som gjør en liten webserver, som da kan ta oss fra hvor som helst. I utgangspunktet så har vi ikke noe nettverk", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0018", "start": 3660.0, "end": 3925.5, "token_count": 588, "text": "Hvis jeg nå går ut igjen og lister images, så ser vi at nå har jeg fått opp den. Den er litt mindre. Da ser vi igjen. Andre gang jeg kjører, så går det mye fortere. Da skal vi se på ett poeng som er viktig i forhold til å sette opp webservere. Det vi skal prøve nå, er å få til en maskin som gjør en liten webserver, som da kan ta oss fra hvor som helst. I utgangspunktet så har vi ikke noe nettverk Vi er inne på et privat nettverk, så vi har nett, kan kjøre AppGet, AppDate osv. Her ser vi et eksempel med NGNX, som er dockerinstans som kjører en webserver. Etterpå skal vi prøve oss å bare kjøre Ubuntu og installere Apache2, som tidligere. Vi gjør som tidligere, dere container run. Men det vi har med her, er minus P 80-80 kolon 80. Det betyr at hvis man sender en innkommende forespørsel på port 8080 til hosten, hosten er i vårt tilfelle Linux VM, så... Ved hjelp av såkalt port forwarding, som man sender videre pakkene til port 80 på konteineren. Så man oversetter pakker som kommer inn med PSB-hedder. Det blir oversatt til 80 og så sendt videre til konteineren. På den måten kan man da sette opp en webserver her på konteineren. Som svarer på innkomne forespørsler. Man kunne også hatt port 80 til 80. Da ville du gått rett inn til konteineren. Men på denne måten kan man da ha én webserver som kjører på port 80 på hosten, og så kan man ha en annen som kjører på port 80 på konteineren. Men så kan man da velge hvilken av de to man... Og få dem til å kjøre som en webserver i Linux-VM, som kan nås utenfra. Ja, der var det your turn allerede. Da kan vi hoppe rett til overwarding. Da skal vi dele... da skal vi få opp... Ja... I oppgaven i dag så står det, i eksempelet på slidene til Mike, eller til opplegget til Rahma, så står det port 8080. Og det er et problem. Hvis man kjører port 8080, så får man ikke kontakt med serveren.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0019", "start": 3840.02, "end": 4188.24, "token_count": 584, "text": "Og få dem til å kjøre som en webserver i Linux-VM, som kan nås utenfra. Ja, der var det your turn allerede. Da kan vi hoppe rett til overwarding. Da skal vi dele... da skal vi få opp... Ja... I oppgaven i dag så står det, i eksempelet på slidene til Mike, eller til opplegget til Rahma, så står det port 8080. Og det er et problem. Hvis man kjører port 8080, så får man ikke kontakt med serveren. Nei, vi tar en annen port med en gang, sånn at det virker. Problemet med port 8080 er at den ble stoppet i brannmuren inn til OsloMet. Så hvis man da kommer utenfra og prøver å koble seg til, så funker det ikke. Så hvis vi tar port 7979, sender vi den videre til port 80, og så kjører vi EngineX. Da laster jeg opp... EngineX. Den starter å kjøre. Nå står den her og kjører. Det vi må teste ut da, er hvordan kan vi... Da... trenger jeg et bråsevindu. Sånn. Og nå er jeg... Jeg var jo på OS70. Det går til OS70 v-lab der. Så i dag får jeg den... Den kan ikke nås. Jeg har ikke noen webserver som kjører, men hvis jeg da tar 79, så kommer jeg \". Velkommen til EngineX.\" Da er det den webserveren som står der og kjører. Hva er neste stepp her? Neste steg er da attaching og executing, altså hvordan man setter opp en konteiner som står og kjører i bakgrunnen. Og hvordan man kan gå inn på den og endre den. Så det vi kan... Det vi kan prøve å få til, er å gjøre det tilsvarende med en utgift. Da er det et par måter å koble seg til konteineren som står og kjører på. En er attach og en annen er execute. Da er vi egentlig rett over på neste. Del fem er vel den vi hadde tenkt å... Det er det vi hadde tenkt å få til i dag. Ja, vi kan også prøve å installere Ubuntet, som vi er litt mer kjent med. Og teste hvordan vi kan starte opp Ubuntu og koble oss inn og ut. Da skal jeg først... stoppe EngineX. Jeg bare tok kontroll C, så stoppet den.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0020", "start": 4122.76, "end": 4433.82, "token_count": 593, "text": "En er attach og en annen er execute. Da er vi egentlig rett over på neste. Del fem er vel den vi hadde tenkt å... Det er det vi hadde tenkt å få til i dag. Ja, vi kan også prøve å installere Ubuntet, som vi er litt mer kjent med. Og teste hvordan vi kan starte opp Ubuntu og koble oss inn og ut. Da skal jeg først... stoppe EngineX. Jeg bare tok kontroll C, så stoppet den. Hvis jeg nå prøver å laste websiden, så vil den være borte. For vi kan... Neste konteinere... LS-minus-A. Da ser vi... Jeg har flere konteinere, men alle tre er exitet. Så kan jeg prøve å starte en... Prøve å starte en ubundet konteiner. Dere konteinere. Men så kan jeg ta minus D. Den betyr... Legg den i bakgrunnen. Så kan jeg ta minus IT også. Som et skjell. Så vil jeg la den laste ned. Vi begynte på nytt og starter den opp. Nå hadde jeg opsjonen minus D, så nå er jeg fortsatt i Linux-VM. Da må jeg prøve å liste konteinere. Da ser vi Docky container PS. Jo, her har jeg en container som står og kjører. Men så må vi da prøve å klare å koble oss til den containeren. Hvis jeg tar PS minus A, så ser vi at da får jeg opp alle. Den eneste som har status up, det er den siste. Én måte å koble seg opp til en konteiner på, det er å bruke Execute. Lage en kobling, og så skal vi se. Den konteineren vi kjører, den har den i den der. Bruker den konteineren i den. Så kjører jeg selv litt bæsj. Da ser vi. Nå er jeg inne i Ubuntu-konteineren. Her kan jeg gjøre hva jeg vil. Og hvis jeg nå ønsker å... Lage en webserver av denne konteineren, så kan jeg... Det fungerer. For å installere Apache 2 nå, så er jeg akkurat sånn som man kan gjøre i Linux-VM. Installerer AppGetInstallApache2. Eller som jeg gjorde det nå. Det som skjer nå, er at dette gjøres lokalt i imaget. Imaget vil nå endre seg. Hvis du lister størrelsen på imaget, vil du se at dette er litt større enn det originale buntimaget som vi la inn.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0021", "start": 4380.0, "end": 4667.9, "token_count": 597, "text": "Det fungerer. For å installere Apache 2 nå, så er jeg akkurat sånn som man kan gjøre i Linux-VM. Installerer AppGetInstallApache2. Eller som jeg gjorde det nå. Det som skjer nå, er at dette gjøres lokalt i imaget. Imaget vil nå endre seg. Hvis du lister størrelsen på imaget, vil du se at dette er litt større enn det originale buntimaget som vi la inn. Det er ikke så rart, for alt jeg gjør nå, vil gjøre at dette imaget, De blir forskjellige fra andre imager. Fra det originale imaget. Da trenger det litt mer plass på å... Det trenger litt mer plass for å lagre all den informasjonen. Men man kan ta Apache... Nei. Apache 2, og så start. Gjør jeg det, så vil jeg nå starte en Apache webserie-brett. Og da... Jeg ser at i den dokkerinstansen her nå, så kjører jeg Apache. Hvis jeg tar exit nå, så vil... Så vil hele containeren stoppe. Men det man kan gjøre, er å ta kommandosekvensen kontroll P, kontroll Q. Jeg gjør nå kontroll P, kontroll Q mens jeg holder kontroll inne. Da ser vi... Jeg går ut og... ut av containeren igjen. Mens konteineren med ubunter på, den står fortsatt og kjører. Men... Så nå kjører det en konteiner... Nei, nå kjører det en BEPS-server på port 80 inni denne konteineren. Det jeg ikke gjorde når jeg skulle starte denne, var å lage en port-forwarding. Sånn som jeg gjorde på den andre containeren. Da er det mulig jeg må starte opp den på nytt for å få til port-forwarding. Det er å se litt på en av oppgavene denne uken, som går ut på å lage en... Lage en kopi av en eksisterende konteiner. Hvis jeg nå bare stopper denne konteineren, så... Så kan jeg ikke starte den opp igjen med det samme innholdet. Så... Nå har jeg lagd... jeg lister image der nå... Container image LS. Image. Docker image LS. Så ser vi at jeg har en Ubuntu. Men den Ubuntu-en der, det er en plain Ubuntu uten webserver. Jeg har gjort endringer, så jeg vil lage en kopi av den tegneren. Det jeg kan gjøre da, er å... Bruke kommandoen docken contain commit.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0022", "start": 4604.9, "end": 4900.3, "token_count": 591, "text": "Hvis jeg nå bare stopper denne konteineren, så... Så kan jeg ikke starte den opp igjen med det samme innholdet. Så... Nå har jeg lagd... jeg lister image der nå... Container image LS. Image. Docker image LS. Så ser vi at jeg har en Ubuntu. Men den Ubuntu-en der, det er en plain Ubuntu uten webserver. Jeg har gjort endringer, så jeg vil lage en kopi av den tegneren. Det jeg kan gjøre da, er å... Bruke kommandoen docken contain commit. Commit er sånn generelt det man gjør når man skal commite kode. Hvis man har lagd ferdig kode, så vil man sende til Github eller andre steder. Men i dette tilfellet vil jeg nå committe å lage en kopi av min eksisterende Ubuntu. Da tegner de ID-en til Ubuntu. Det er den her. Der du ser den står og kjører. Så commit, nå vil jeg lage en kopi av den her. Så vil jeg kalle den f.eks. Apache Ubuntu. Det er da en Ubuntu med en Apache-server. Vi ser dette tar litt tid, for den må da kopiere hele imaget. Der var den ferdig, så når jeg lister imaget nå, gjør jeg at jeg har fått et nytt image som heter Apache Ubuntu. Og som er en god del større enn det standard-Ubuntu-imaget. Nå har det fått inn en hel webserver her oppe. Så kan jeg prøve å starte det imaget, og så kan jeg prøve å fortere forwarde det til det imaget. Da kan jeg gjøre omtrent det samme som jeg gjorde her med Ginex. Bare for å se at det er noe annet, så kan jeg ta et annet portnummer her. Innkommende request til port 7878 på Linux-VM-en min nå, det vil jeg sende til port 80. Så vil jeg kjøre det på... ... bakgrunn. Jeg vil sende det nå til Apartsjubuntu. Nå prøver jeg å starte en ny konteiner som inneholder den serveren jeg satte opp. Da kan jeg prøve å koble meg til den med Execute. Da går jeg igjen på den. Kobler meg til den nye kopien, en Apache-bunte. Hvis jeg hadde vanlig Ubuntu-image, så ville jo ikke det gått. Her ser vi. Her fungerer det. Har nå en Apache-server... Hvis jeg nå gjentar kontroll-p, kontroll-q, og har lister, så ser vi...", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0023", "start": 4787.72, "end": 5123.94, "token_count": 593, "text": "... bakgrunn. Jeg vil sende det nå til Apartsjubuntu. Nå prøver jeg å starte en ny konteiner som inneholder den serveren jeg satte opp. Da kan jeg prøve å koble meg til den med Execute. Da går jeg igjen på den. Kobler meg til den nye kopien, en Apache-bunte. Hvis jeg hadde vanlig Ubuntu-image, så ville jo ikke det gått. Her ser vi. Her fungerer det. Har nå en Apache-server... Hvis jeg nå gjentar kontroll-p, kontroll-q, og har lister, så ser vi... Her står den og kjører. Så skulle jeg nå kunne gå inn i et webvindu og prøve å koble meg til. Jeg skal åpne vinduet for dere. Her ser vi den gamle siden med 7979. Hvis jeg nå beholder den, så er det naturlig nok ikke noe der, for der kjører ikke den NGINX-containeren lenger. Jeg prøver 7878. Da ser vi... Jo, her kommer Apache-serveren ut. Den ser ut som en default Apache-server, så det er ikke så lett å se forskjellen på det. Men vi kan prøve å gå inn på... Og bare endre litt på teksten på avanseserveren. Det er også en del av oppgaven denne uken å gjøre akkurat det. Så kan jeg ta app install her på Vemund. For det har jeg tydeligvis ikke gjort før. Nå jobber jeg på to nivåer. Det jeg prøver først her, er å installere Apache-VM på Linux. Da går jeg inn på porten på LinuxV og skal få opp Apache-serveren som kjører her. Men først skal jeg prøve å koble meg opp til konteineren som kjører Apache.  Den konteineren står nå på og kjører Apache til port 80. Men alt som sendes til 7878, vil sendes videre til den konteineren. Men det er ikke særlig nyttig å kjøre webserver hvis du ikke kan endre på innholdet. Det vi gjør i dag, er at vi går direkte inn på konteineren og endrer på innholdet der. Det som er mer vanlig, og som vi skal gjøre neste uke, det er å gå... Ha et volum som er... Som ligger utenfor containeren. Sånn at containeren bare kjører webserveren og leser filer fra det volumet. Men det ser vi på i neste uke. Nå skal vi ta nok Container PS.", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0024", "start": 5084.92, "end": 5359.72, "token_count": 590, "text": "Men det er ikke særlig nyttig å kjøre webserver hvis du ikke kan endre på innholdet. Det vi gjør i dag, er at vi går direkte inn på konteineren og endrer på innholdet der. Det som er mer vanlig, og som vi skal gjøre neste uke, det er å gå... Ha et volum som er... Som ligger utenfor containeren. Sånn at containeren bare kjører webserveren og leser filer fra det volumet. Men det ser vi på i neste uke. Nå skal vi ta nok Container PS. Da ser vi den konteineren som står og kjører. Det er da den der. Så kobler jeg meg inn til den konteineren. Og så går jeg til der hvor webserveren ligger. Så kan jeg skrive f.eks.... Image fra OS70. Sånn. Så kan jeg legge det inn i indeks 1212 der i stedet. Jeg kan altså sjekke det lokalt ved å... be om å bruke køl. Og så be om en side. Nei. Har ikke køl her. Har jeg vegget, da? En applaus fordel med både konteinere og VM-er, er at du kan installere hva du vil. Og styre akkurat som du selv vil. Vi ser også at konteinere er veldig minimalistiske. De skal være så små som bare mulig for å bruke minst mulig ressurser. Og så kan man tilpasse det med hvor flott det er man med. Nå kan jeg gå ut og sjekke webserveren, om den virker. Nå har vi satt på 7878, så skal det fortsatt stå en webserver og kjøre. Nå skal den være endret til det vi... Nei... Skal vi se når den dukker opp hos seere. Da ser vi docker-image fra OS70. Det er den endringen som jeg gikk inn på docker-containeren og endret. Da ser vi med det samme, hvis jeg nå bare går inn på OS70, da får vi den default-pagen. Dette er nå en tjeneste fra webserveren på LinuxV. Med en gang jeg skriver 7878 her nå... Så default for en webserver er å koble seg til på port 80. Så hvis jeg eksplisitt skriver port 80 her, så kommer jeg til den samme siden. Men jeg kan generelt be om hvilken som helst port. Så hvis jeg nå... Det jeg gjør nå, egentlig, det er å be broseren", "source": "lecture"}
{"lecture_id": "linux7", "chunk_id": "linux7_0025", "start": 5321.68, "end": 5557.56, "token_count": 598, "text": "Da ser vi med det samme, hvis jeg nå bare går inn på OS70, da får vi den default-pagen. Dette er nå en tjeneste fra webserveren på LinuxV. Med en gang jeg skriver 7878 her nå... Så default for en webserver er å koble seg til på port 80. Så hvis jeg eksplisitt skriver port 80 her, så kommer jeg til den samme siden. Men jeg kan generelt be om hvilken som helst port. Så hvis jeg nå... Det jeg gjør nå, egentlig, det er å be broseren om å koble seg til webserveren på OS70 på port 7878. Når jeg gjør det, så er docky satt opp sånn at alt som sendes inn til port 78-78, det videresender til docky-imaget til docky-containeren som står og kjører. Og port 80. Og da ser vi. Dermed så får jeg opp den. Dermed så får jeg opp babysurmeren som vi har laget på Docky-inside. Det er bare helt til slutt å se om... Ja, der var Kurl ferdig. Sånn. På den måten så kan man teste... ... teste at webserveren funker. Kurl 127.001, det er... Da får man kontakt med local host. Man kunne vel også gjort noe sånt. Det fungerer også. Så på den måten kan du enkelt teste om WebStore-en funker. Nå er jeg inne i containeren. Dere kan se at på host name er du enda sikrere. Det kan da sjekke om webserveren virker. Hvis den virker, men du ikke kommer inn utenfra, da er det noe med hvordan du har startet... Hvordan du har startet... Skal jeg se... Jeg hadde vel... Nei, det var jo ikke her jeg gjorde det. Da er det kontroll P og Q, og så går jeg ut. Den kommandoen skulle jeg ha frem. Med den kommandoen så startet jeg da Apache Buntu-imaget sånn at det blir portforwarding mellom 78 og 78. Ok. Da har vi tre minutter over den tilmålte tiden. Så da...... skal vi slutte her. Men vi har lab etterpå. Så vi tar en pause. Så kommer vi tilbake... Jeg kommer også tilbake etter pausen. Det jeg hadde tenkt å prøve å få til, som jeg ikke har prøvd før heller, er at jeg åpner Såkalte... hva heter det... Breakout rooms. Lager tre breakout rooms.", "source": "lecture"}
