{"lecture_id": "os1", "chunk_id": "os1_0000", "start": 0.0, "end": 193.84, "token_count": 599, "text": "Ja, så dette er... Her kommer dere inn i Canvas. Det jeg kommer til å bruke i år, det er... Det står en link først i Canvas, og det er en link til en kurs i det. Som ser sånn ut. Og dette er egentlig et... Når dere ser det er litt sånn farger og design fra sent 90-tall... Dette er litt sånn retro websider, men de funker ganske bra, iallfall. Og... ja, så når dere ser opplegget, så er... all informasjon dere trenger, ligger på denne ene siden. Dere ser sånn som i dag, tirsdag 5.1, så er det første OS-forelesning. Og her har jeg lagt ut notater. Også en link til slides. Og her ligger all den infoen jeg kommer til å gå gjennom. Jeg prøver å legge ut det på forhånd, så dere kan se på. Og gjerne forberede dere på denne forelesningen også. Så står det noen F-er og D-er nedover her. Og det F betyr rett og slett forelesning, sånn som i dag. Og den kommer til å gå live hver tirsdag. Etter hvert kanskje i forelesningssalen, hvis smittetallene tillater det. Men så ser du at det også står en D, og det står for digital. Og det vil på en måte være en slags digital forelesning. Der kommer jeg til å gå gjennom det som er pensum for dette området. Praktisk programmering osv. Det kommer jeg til å legge ut som videoer. Relativt korte videobiter for de forskjellige delene. Da er tanken at dere i løpet av denne uka går gjennom og ser på de videoene, eventuelt leser notatene som står der. Det som da står her, det er... De vil komme som oppgaver i neste uke igjen. Her er uke to, og da er det introduksjon til Linux' kommandolinje. Så det er oppgaver for neste uke. Men så er det hele tiden ukens oppgaver, det er fokus i dag. Så det er ikke så veldig mye oppgaver i dag. Vi starter ganske rolig. Det er jo rett etter nyttår, så ja. Alle trenger litt tid på å komme i gang, det gjør jeg også. Så vi har en relativt forsiktig start, men som Ine sa, det er ganske omfattende kurs.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0001", "start": 161.1, "end": 335.24, "token_count": 592, "text": "Så det er oppgaver for neste uke. Men så er det hele tiden ukens oppgaver, det er fokus i dag. Så det er ikke så veldig mye oppgaver i dag. Vi starter ganske rolig. Det er jo rett etter nyttår, så ja. Alle trenger litt tid på å komme i gang, det gjør jeg også. Så vi har en relativt forsiktig start, men som Ine sa, det er ganske omfattende kurs. Så det er veldig lurt å prøve å ligge litt tidlig an i løypa. Og jobb gjerne med oppgavene for neste uke allerede nå. Vi kan se veldig kort på planen. Den... Du ser det er noen obligatoriske oppgaver her. De består rett og slett av å legge sammen enkeltoppgaver fra de første ukene. Fra uke 1, 2, 3, 4 typisk, blir den første obligatoriske innleveringen. Da kan dere se her i dag. I dag er det bare tre oppgaver, men vi ser at alle er obligatoriske. Så det betyr at da skal dere, når dere skal levere obligg én, så skal dere levere en rapport hvor det er svart på alle de spørsmålene som er merket obligger. Og det jeg håper du oppnår på med det der, at ikke obliggene nødvendigvis blir en sånn stor skjev, men at dere ved å jobbe... Jevnt og trøtt. Så kan dere plukke ut her det som er obliger. Sånn som her er det neste uke. De første ni oppgavene kanskje er mer sånn øve og komme i gang. Og så kommer det noen obliger etter hvert nedover her. Så det er hovedsakelig strukturen på kurset. Vi møttes her hver tirsdag. Og da er det også fire timer mellom. Så det blir en veldig én intensiv dag, men dere må også regne med å jobbe mer med kurset, spesielt med det som ligger i Linux 1, 2, 3 osv. Hvor det står onsdag, men det betyr da kan dere se eller jobbe med det når som helst. Men det er viktig at dere begynner å jobbe med det denne uken, sånn at dere neste tirsdag er klare til å jobbe med det. Med disse oppgavene. Og det som også kan være veldig nyttig,", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0002", "start": 300.0, "end": 485.1, "token_count": 597, "text": "Så det blir en veldig én intensiv dag, men dere må også regne med å jobbe mer med kurset, spesielt med det som ligger i Linux 1, 2, 3 osv. Hvor det står onsdag, men det betyr da kan dere se eller jobbe med det når som helst. Men det er viktig at dere begynner å jobbe med det denne uken, sånn at dere neste tirsdag er klare til å jobbe med det. Med disse oppgavene. Og det som også kan være veldig nyttig, er at dere da kan komme opp med spørsmål som dere lurer på fra dette stoffet. Så kan vi også ta opp det på forelesningen sånn direkte. Jeg syns det fungerer veldig mye bedre hvis dere kommer med spørsmål. Og det er ofte ting som jeg ikke tenker på i det hele tatt, som dere brenner inn med. Så... Det er litt lavere terskel å spørre studentassistenter, så gjør gjerne det på laben. Men enda bedre hvis dere spør nå når vi møtes hver tirsdag. Ja... Kurset består... Ja, jeg ser... Jeg får et sterkt spørsmål i chatten om pensum. Om det er det som ligger på denne nettsiden. Ja. I utgangspunktet så er det det som ligger på nettsiden. Men det er også en anbefalt lærebok som... Ja, jeg har en slide om det, så jeg kan si litt om det etterpå. Men det er bare anbefalt. I utgangspunktet så får dere all... Alt dere trenger av pensum, det får dere i to compendier. Jeg kan vise det med det samme. Er det noen... en liten meny? Herunder forelesninger så ser dere at jeg legger ut notater etter hver forelesning. Men så ligger det også da her forelesningsnotater fra 2020 som ett PDF-dokument, og Linux-forelesninger fra 2020 som ett PDF-dokument. Så hvis dere går inn på det, så vil dere se... Notatene fra i fjor. Og da vil du se at dette er etter hvert et kompendium på 160 sider. Så dette fungerer da i praksis som en lærebok. Det er litt... Jeg legger ofte til å trekke fra noe stoff, så det kan variere litt. Men totalt sett til våren så vil ikke disse dokumentene være Veldig forskjellig. Så disse ligger ute.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0003", "start": 437.26, "end": 647.24, "token_count": 594, "text": "som ett PDF-dokument, og Linux-forelesninger fra 2020 som ett PDF-dokument. Så hvis dere går inn på det, så vil dere se... Notatene fra i fjor. Og da vil du se at dette er etter hvert et kompendium på 160 sider. Så dette fungerer da i praksis som en lærebok. Det er litt... Jeg legger ofte til å trekke fra noe stoff, så det kan variere litt. Men totalt sett til våren så vil ikke disse dokumentene være Veldig forskjellig. Så disse ligger ute. I tillegg er det en lærebok som vi kan ta... jeg kan si noen år om senere. For øvrig, når vi er inne på forelesninger, så ser vi her også ligger det emnevalueringer. Det pleier Lorence, instituttlæreren min, å si at det må jeg alltid si fra om. Det kan være nyttig å lese for dere fra hva studentene sa i fjor. Her står det litt om tilbakemelding fra emne-evalueringen. Og det som ja, kanskje mange sier er at 54 % mener at pensumet er for stort. Så dette kurset er nok litt... litt omfattende. Men samtidig så tenker jeg at man... Det er veldig mye matnyttig. Det er også en del sånne tilbakemeldinger på at de søker på sommerjobb eller jobb, for den saks skyld. At de sitter igjen med mye som er konkret. Så derfor har nok kurset blitt relativt omfattende, men det er jo ikke alt som er like viktig. Det som er viktig, er at dere sitter igjen med de vesentlige delene av kurset. Og det er ikke nødvendigvis så omfattende. Det var litt om foreløpninger og foreløpingsnotater. Når vi er inne... Vi kan se øvingstimer... Jo, det er det viktig å ta med. Dette er da Ine som dere har hilst på. Og så er det Rune Bakken som kommer på lab etter forelesning i dag. Og de kan dere også nå på e-poset her. Så hvis det er noen spørsmål spesielt relatert til øvingsoppgavene, så gå inn. Foreløpig blir det øvinger på Zoom. Etter hvert håper vi å komme inn i PO51 på datalaben. Men det ser ikke så veldig bra ut foreløpig.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0004", "start": 608.36, "end": 830.2, "token_count": 587, "text": "Dette er da Ine som dere har hilst på. Og så er det Rune Bakken som kommer på lab etter forelesning i dag. Og de kan dere også nå på e-poset her. Så hvis det er noen spørsmål spesielt relatert til øvingsoppgavene, så gå inn. Foreløpig blir det øvinger på Zoom. Etter hvert håper vi å komme inn i PO51 på datalaben. Men det ser ikke så veldig bra ut foreløpig. Så vi får se hvordan det går. Ja... Timeplaneksamen er kanskje viktig å si noe om. I utgangspunktet så er det avsluttende tre timers eksamen i Inspera. Men så har det, pga. eksamensavviklingen, at den ikke kan gjøres i lurveien. I hvert fall i utgangspunktet, så er det ikke helt bestemt ennå om det blir som i fjor, hvor det ble bestått eller ikke bestått med tre timers Inspera-eksamen. Dette er som sagt ikke avgjort ennå, men det er noe dere kan ha en innflytelse på. Jeg tenker jeg etter hvert kan legge ut en poll og spørre dere litt om hva dere ønsker. Det er mange som syns det er kjedelig å ha en CV med bare bestått eller ikke bestått. Det er noen problemstillinger rundt det, men der er det ikke bestemt hva årets løsning blir. Men her under eksamen ser dere en mengde løsningsforslag. Vår 2020 er den forrige fra 2020. Det kan være fornuftig å ta en titt på vår, høst, 2019. Spesielt de siste eksamensoppgavene. For å se hvordan de ser ut. Da får man et godt inntrykk av hva vi ønsker at dere skal lære i kurset. Ja. Det... Hva er vel det meste av sånn praktisk... informasjon rundt kurset? Vi kan... Ja, igjen... Hiv av gårde spørsmål i chatten, så svarer vi forhåpentligvis fortløpende. OK. Da tenkte jeg å gå gjennom noen slider om kurset. Bare for å dobbeltsikre at jeg har fått med det jeg har sagt. Eller at jeg har fått med det viktigste. Så skal vi se... Da skal vi se på en slide her. Den. Ser dere en slide om operativstemmer nå?", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0005", "start": 780.02, "end": 983.14, "token_count": 589, "text": "Hva er vel det meste av sånn praktisk... informasjon rundt kurset? Vi kan... Ja, igjen... Hiv av gårde spørsmål i chatten, så svarer vi forhåpentligvis fortløpende. OK. Da tenkte jeg å gå gjennom noen slider om kurset. Bare for å dobbeltsikre at jeg har fått med det jeg har sagt. Eller at jeg har fått med det viktigste. Så skal vi se... Da skal vi se på en slide her. Den. Ser dere en slide om operativstemmer nå? Ine, ser du det? Ja, den er oppe. I hvert fall for meg. Supert. Ja... Jeg har pratet lenge, har ikke presentert meg ennå. Dere ser kanskje navnet mitt også, men jeg heter Hårek Haugerud. Jeg sitter... Jeg pleide å sitte i P35, men nå har jeg flyttet opp til AI-laben, siden jeg jobber en del med de som jobber der. Så jeg sitter fysisk i P52. Så langt har jeg hjemmekontor, men når jeg kommer tilbake til campus, så sitter jeg i P52. Det jeg kanskje ikke har gjort så klart hittil, er at kurset består av to relativt uavhengige deler. Den ene er operativsystemer, OS. Og denne delen er mer teoretisk om hvordan et operativsystem... Hvordan Linux og Windows og kjente operativsystemer er bygd opp. Og hvordan alt dette her henger sammen helt fra grunnen. Og vi bruker en god del tid på også å se på hardware, datamaskinarkitektur. For målet er at dere etter å ha tatt kurset, skal vite alt som skjer i en datamaskin. Nullvolt, femvolt spenninger og bitte små, de aller minste delene i datamaskinen. Helt opp til operativsystemet og dokker og virtuelle maskiner og alt som skjer på toppen. Så tradisjonelt er operativsystemet veldig spesifikt om schedulere og minnebruk og CPU-er og hvordan alt dette er. Det jeg har prøvd å legge inn etter hvert, er å ta med hva som skjer på høyere nivå. Spesielt det vi har gjort de siste årene, er å se på dokker. Altså se på konteinere, og bruke og kjøre og lage konteinere.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0006", "start": 944.08, "end": 1127.42, "token_count": 587, "text": "og virtuelle maskiner og alt som skjer på toppen. Så tradisjonelt er operativsystemet veldig spesifikt om schedulere og minnebruk og CPU-er og hvordan alt dette er. Det jeg har prøvd å legge inn etter hvert, er å ta med hva som skjer på høyere nivå. Spesielt det vi har gjort de siste årene, er å se på dokker. Altså se på konteinere, og bruke og kjøre og lage konteinere. Og også har vi sett på virtuelle maskiner. Sånn at dere... Når dere går ut i arbeidslivet og begynner å bruke dette her, så vet dere hva en container er, og dere vet hva operativsystem er, og hvordan ting henger sammen. Så dette er en slags sånn... For å si det veldig fint, en dannelsesreise innen data. Dere skal kjenne til hvordan alt henger sammen. Og det er ikke nødvendigvis noe som dere får... Men jeg håper dere skal sitte med en dypere og grundigere forståelse av hvordan alt henger sammen. Sånn at når dere møter på et problem som ikke jeg vet om, og som ikke dere vet om eksisterer engang, som kanskje kommer i fremtiden, så har dere en dypere forståelse. Og da er det alltid lettere å takle problemene deres. Det er mange problemer å forstå hva som skjer der oppe på overflaten. Men sånn i praksis, hvis du er utvikler og jobber som konsulent, så tenker du ikke hele tiden på hva som skjer i operativsystemet, men noen ganger så blir det plutselig viktig å vite hva som foregår. Så det er den første delen. Den mer teoretiske delen. Den andre delen er mer praktisk bruk av operativstemmer. Det vi først og fremst jobber med da, er kommandolinje. Og spesielt Linux-kommandolinje. Men vi kommer også til å drive noe med Windows og PowerShell, og skrive PowerShell-skript. I Linux-delen kommer vi til å skrive såkalte Bæsj-skript. Linux-kommandolinjeskript, som egentlig består av bare Sette sammen kommandoer til et systematisk program. Dette blir da sånne små systemskript som brukes til å styre operativstemme og til å snakke med operativstemme.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0007", "start": 1088.08, "end": 1276.48, "token_count": 597, "text": "Og spesielt Linux-kommandolinje. Men vi kommer også til å drive noe med Windows og PowerShell, og skrive PowerShell-skript. I Linux-delen kommer vi til å skrive såkalte Bæsj-skript. Linux-kommandolinjeskript, som egentlig består av bare Sette sammen kommandoer til et systematisk program. Dette blir da sånne små systemskript som brukes til å styre operativstemme og til å snakke med operativstemme. Jeg nevner også dere her. Og vi kommer til å holde på noen uker med dere. Det som er nytt av året, er at... Jo, tidligere... Dere har blitt delt inn i grupper, og da har hver studentgruppe en virtuell maskin. VM, som dere logger inn på. Nytt av året er at serverne har blitt så gamle og dårlige som kjørte disse. Så de har begynt å bryte sammen. Derfor har vi lagd et nytt system. Men i virkeligheten så er dette dokkecontainere som ved litt ekstra detaljer ser ut som selvstendige virtuelle maskiner. Dere får da tilgang til en sånn dokkecontainer som har en offentlig IP, og som dere kan installere og kjøre f.eks. webservere på osv. Og som dere kan bruke og teste og eksperimentere med sånn som dere vil. Så dere kommer vi til å bruke og jobbe en god del med i den praktiske delen. Ja, mer om kurset. Dette har jeg vist fram, kurssiden. Som Ine også sa, det er veldig viktig å jobbe med oppgaver. Det er derfor jeg også har gjort en endring på hele... I fjor og tidligere så har jeg pleid å ha fire timer forelesninger, altså to deler. En mer teoretisk om OUS, en om Linux og praktisk bruk. Den delen med praktisk bruk tror jeg det er aller viktigst å jobbe hands on. Altså jobbe med oppgavene. Og da tror jeg det kanskje er like bra å bruke... Starte med oppgavene, sette deg ned, prøve å løse oppgavene og gjøre det. For ofte er det ikke noe ekstremt vanskelig med hvert enkelt delspørsmål, men det er mye, det er mange detaljer å holde styr på. Og da tror jeg man får det beste inn i fingrene, bokstavelig talt,", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0008", "start": 1243.6, "end": 1432.44, "token_count": 587, "text": "Den delen med praktisk bruk tror jeg det er aller viktigst å jobbe hands on. Altså jobbe med oppgavene. Og da tror jeg det kanskje er like bra å bruke... Starte med oppgavene, sette deg ned, prøve å løse oppgavene og gjøre det. For ofte er det ikke noe ekstremt vanskelig med hvert enkelt delspørsmål, men det er mye, det er mange detaljer å holde styr på. Og da tror jeg man får det beste inn i fingrene, bokstavelig talt, ved å sette seg ned ved tastaturet og jobbe gjennom oppgaven. Ja, et par ting med dette kurset er også at det er et grunnlag for et valgfag vi har Administrasjon, som det er veldig nyttig å kunne linje godt for å ta det. Vi har også en mastergrad som jeg også underviser på i parallell dette semesteret. Crowd-based services and operations, noe som tidligere het Network and system administration. Men dette handler om infrastruktur og hvordan... Sette opp virtuelle maskiner, containere, sette opp systemer for utviklere og alle andre til å bruke. Og hvis... Hvis dere tenker på å ta en massegrad, spesielt denne massegraden, så er dette kurset veldig nyttig. Hvis dere liker dette kurset, spesielt den praktiske delen, så burde dere absolutt ta en titt på den. På den ACIT-massegraden. Ja... Vesentlig mål for kurset. Det første mest praktiske er å kunne lære å bruke kommandolinje. Og skrive systemskript. Vi bruker mest Linux og dokker, men også noe Windows. Det er den første praktiske delen. Den andre er, som jeg sa, å lære hvordan en datamaskin virker på alle nivåer. Helt fra transistorer, kanskje som jeg ser litt på i dag, og helt opp til operativstemme og applikasjonene som sitter på toppen av operativstemme. Det ble spurt om pensumlitteratur, og svaret var da at to compendier dekker pensum. De ligger ute, de som er fra i fjor, men de blir fortløpende oppdatert. Men så er det også en anbefalt støttelitteratur, Tan Baum. Det er en veldig god bok, men den er veldig omfattende og stor og dyr.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0009", "start": 1392.24, "end": 1580.84, "token_count": 599, "text": "og helt opp til operativstemme og applikasjonene som sitter på toppen av operativstemme. Det ble spurt om pensumlitteratur, og svaret var da at to compendier dekker pensum. De ligger ute, de som er fra i fjor, men de blir fortløpende oppdatert. Men så er det også en anbefalt støttelitteratur, Tan Baum. Det er en veldig god bok, men den er veldig omfattende og stor og dyr. Så jeg vil ikke forlange at dere alle skal gå og kjøpe og lese hele den. Men spesielt for de som liker dette kurset og er interessert, så er det en veldig dyptpløyende og god bok. Men den er nok i overkant omfattende. Det er kanskje på 1000 sider. Overkant omfattende for et kurs som dette her. Ja... Eksamen nevnte jeg også. Igjen så avhenger dette av koronasituasjonen. Men dere kan gjerne komme med innspill til hva dere ønsker. Obligatoriske gruppeinnleveringer. Jeg kommer til å legge ut til Kanvas-grupper, sånn at dere kan lage egne grupper. Jeg tror jeg pleide å ha maks på fire. Men hvis det er noen som ønsker å være enda større enn det, så går det an. Og det går også an å være alene på grupper. Men det er et krav at alle de tre obliggene må være godkjent for å kunne meldes opp til eksamen. Så kommer det også til å være noen multiple choice-tester som er obligatoriske. Nå har det vært en del trøbbel med det systemet der også pga. autentisering Men hvis vi får det opp å kjøre, så kommer opplegget til å fungere som dette her. Hvis ikke, så blir det noen Canvas multibeshare-tester med omtrent samme opplegg. Men det kommer vi tilbake til. Men uansett så er ikke disse veldig omfattende. Det er sånn man gjør på ti minutter. Hvis man har jobbet bra med kurset, så bør disse her gå ganske så greit. Hovedtanken med disse er at jeg skal gi en feedback til dere. Hvor står dere, hva har dere fått med dere av det som er pensel. Viktigste grunn til at jeg begynte med dette, var at det var mange studenter som først når de kom på eksamen, oppdaget at dette har de ikke fått med seg.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0010", "start": 1548.42, "end": 1737.96, "token_count": 582, "text": "Men uansett så er ikke disse veldig omfattende. Det er sånn man gjør på ti minutter. Hvis man har jobbet bra med kurset, så bør disse her gå ganske så greit. Hovedtanken med disse er at jeg skal gi en feedback til dere. Hvor står dere, hva har dere fått med dere av det som er pensel. Viktigste grunn til at jeg begynte med dette, var at det var mange studenter som først når de kom på eksamen, oppdaget at dette har de ikke fått med seg. Så dette er en viktig tilbakemelding til dere også. Ikke bare en sånn oblig... Å, jeg må gjøre det. Men dette er en tilbakemelding til dere. Nyttepersoner. Jeg viste frem studentassistentene. I tillegg har vi Taiba, som jobber med Linux-drift. Her på vårt institutt. På Institutt for informatikk. Og hun styrer spesielt med Linux-drift. Stud.SSH, for eksempel. I neste uke, eller gjerne allerede nå, skal logge dere inn på. Der vet jeg det har vært en del trøbbel med studiesesong. Så det er egentlig fint om vi kan teste ut i laben. Det vil jo da være oppgang til neste uke, men test gjerne ut allerede nå om dere klarer å logge inn på studiesesong, om det er noen problemer rundt det. Hvis det er store problemer med det, så skal vi prøve å sette opp disse virtuelle maskinene. Sånn at dere kan bruke dem allerede nå de første ukene. OK. Da var jeg egentlig ferdig med alt det praktiske. Så med mindre det er noe dere brenner inne med og lurer på... Det ser ikke ut fra chatten som det er noe spesielt. Så da skal vi begynne helt på toppen og snakke om hva et operativsystem er. Hva er et operativsystem? Jo, som dere ser av dette bildet, så sitter operativsystemet mellom hardware. Her nede på hardware er det CPU. Så sitter operativsystemet mellom den hardwaren og brukerprogrammene. Og så har vi deg eller flere som en bruker her på toppen, som bruker disse brukerprogrammene. Det operativsystemet gjør, det er å sørge for at brukerprogrammene får tilgang til den hardwaren som er her nede.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0011", "start": 1692.48, "end": 1904.52, "token_count": 591, "text": "Hva er et operativsystem? Jo, som dere ser av dette bildet, så sitter operativsystemet mellom hardware. Her nede på hardware er det CPU. Så sitter operativsystemet mellom den hardwaren og brukerprogrammene. Og så har vi deg eller flere som en bruker her på toppen, som bruker disse brukerprogrammene. Det operativsystemet gjør, det er å sørge for at brukerprogrammene får tilgang til den hardwaren som er her nede. Det er også veldig viktig at operativstemme er et software-grensesnitt. Det er ikke noe hardware i operativstemme. Riktignok så bruker det ofte helt spesielle funksjoner i hardware som vanlige programmer ikke bruker. Men OS er i bunn og grunn et svært... Det er bare et digert program. Hvor stort er et operativsystem? Det er egentlig ganske enormt. Hvis man ser på kildekoden til operativsystemer som Linux eller Windows, så kan det være noe sånt som fem millioner linjer med kode. Og disse linjene med kode er bare operativsystemkjernen. Altså den viktigste delen av operativsystemet. Med GUI og biblioteker og system software osv. så blir det enda større enn dette. Men bare kjernen er så stor sånn at hvis man skriver ned dette i bøker, den koden, så får du noe sånn som 100 tannbarnbøker. Den er svær, 1000 sider. Stabler de opp hverandre, får du en fem meter høy stabel med kildekode. Og det er omtrent det største... Man har ikke særlig mange andre program som er større der ute, heldigvis. Det er veldig omfattende å generelt styre en hel datamaskin. Og det første man må tenke på når man ser dette, er at dette gjør også at... Et sånt system vil ikke fungere akkurat som det skal, hele tiden. Moderne operativsystemer er ganske så stabile. Det er relativt sjelden det skjer feil, men det er i praksis umulig å programmere et perfekt operativsystem sånn at det alltid virker som det skal. Man skulle jo tro at det var mulig å få til, men... Når noe er så komplekst, så... så er det ikke mulighet for å gjennomteste et operativsystem. Man kan ikke forutse absolutt alle muligheter for input", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0012", "start": 1863.18, "end": 2064.6, "token_count": 592, "text": "Moderne operativsystemer er ganske så stabile. Det er relativt sjelden det skjer feil, men det er i praksis umulig å programmere et perfekt operativsystem sånn at det alltid virker som det skal. Man skulle jo tro at det var mulig å få til, men... Når noe er så komplekst, så... så er det ikke mulighet for å gjennomteste et operativsystem. Man kan ikke forutse absolutt alle muligheter for input og for hva som skjer samtidig. For mindre programbiter, f.eks. hvis du har en klasse med noen metoder, så kan du teste. Denne koden får absolutt alle muligheter, rett og slett alle mulige input. Så sjekker du om dette virker, for den gir alltid riktig kode, den krasjer aldri. Men i praksis er et operativsystem så stort at det aldri kan gjøres helt perfekt. Her prøver vi å gå litt dypere inn på hvor operativsystemet sitter. Fortsatt har vi hardware her nede, men oppå der sitter det masse software. Og på toppen sitter det applikasjoner, webbrosere osv. Men så ser vi her på venstre side, så ser vi use and mode. Dette er da programvare som kjører i såkalt user mode. Og det som er spesielt med user mode, er at da har man ikke alle rettigheter. Det er f.eks. ikke lov til å aksessere alle deler av ram eller internminne. Og da er det ikke alle instruksjoner som kan utføres. En viktig instruksjon som ikke kan utføres i user mode, det er å be datamaskinen hardware her Og det ville vært kjedelig, for da kunne den som skrev en webbok, liksom bare velge... Hvis brukeren lastet en spesiell side, så kunne en skru av datamaskinen. Så use mode er en ganske sterkt begrenset modus, hvor programmene ikke har lov til å gjøre alle instruksjoner som Harvard kan. Derimot, i corner mode, der er alle instruksjoner mulig. Man kan aksessere alle deler av hardware. Og operativsystemet må da naturlig nok kjøre i corner mode. For det må kunne aksessere alle deler av hardware. Og må kunne gjøre absolutt alle operasjoner. Så dette kommer vi masse tilbake til.", "source": "lecture"}
{"lecture_id": "os1", "chunk_id": "os1_0013", "start": 2021.78, "end": 2130.88, "token_count": 327, "text": "Så use mode er en ganske sterkt begrenset modus, hvor programmene ikke har lov til å gjøre alle instruksjoner som Harvard kan. Derimot, i corner mode, der er alle instruksjoner mulig. Man kan aksessere alle deler av hardware. Og operativsystemet må da naturlig nok kjøre i corner mode. For det må kunne aksessere alle deler av hardware. Og må kunne gjøre absolutt alle operasjoner. Så dette kommer vi masse tilbake til. Det var én del, altså det å styre hardware. Men vi kan også si en annen viktig del, som OS da gjør, er å forenkle. Og vi ser applikasjonsprogrammene her på toppen. De trenger et... De har et vakkert brukergrensenett mot operativstemme. Alt er pent og enkelt. De har enkle operatører. Så leser de en fil fra disk. Og da sørger operativsystemet for å snakke med hardware. Her er en skikkelig ugly interface. Dette er veldig grisete saker når du skal snakke med hardware. Ikke minst fins det en masse forskjellige harddisker. Sånn at når du snakker med hardware, Så er det en masse grums. Og alt dette grumset, det må operativt stemme.", "source": "lecture"}
