{"lecture_id": "os10time1", "chunk_id": "os10time1_0000", "start": 0.0, "end": 194.04, "token_count": 591, "text": "Ja, aller først så er det veldig hyggelig. Fortsatt veldig hyggelig å se at det er så mange som står opp tidlig om morgenen. Dessverre så ser det jo ikke så lyst ut med tanke på fysiske forløsninger. Og i hvert fall ikke noe før påske. Så kanskje først blir det noe vi tar noen, så en sånn... Prøveeksamen... i mai. Da kan vi kanskje få til... Det ser litt dårlig ut nå foreløpig, men vi får bare prøve å holde ut, alle sammen. Temaet i dag er plattformavhengighet og treads. Plattformavhengighet er ganske morsomt, og det er veldig sånn konkret. Vi skal bare se på hvordan tar det seg ut når man... Kopierer programmer mellom forskjellige plattformer. Stort sett så skal vi se det praktisk an. Jeg har en litt større demo hvor jeg kopierer masse programmer og på en masse plattformer. Og plattformer er typisk et gitt operativsystem på en gitt type CPU. Linux på Intel eller Windows på AMD, f.eks. Det er én plattform. Og plattformuavhengige programmer, det skal man ha. Man kunne da kopiere fra en plattform til en annen, og så skal de kunne kjøre uten videre. I tillegg så skal vi se på treads, eller tråder. Spesielt så skal vi se på javatråder i dag. Men vi skal ha en generell innledning, sånn teoretisk, om tråder og hva det er. Og så skal vi som vanlig gjøre en del praktisk. Det er det samme prinsippet bak Petrads tråder. Ja, så det er planen. Jeg tenkte aller først å se litt på det som er på en måte litt... Eldre notater, som er fra et eksperiment som jeg kjørte for noen år siden. Men i prinsippet så ligner det på det vi skal gjøre nå. Men det kan være greit å få en litt bredere forståelse for... En litt bredere forståelse for plattformavhengighet. Men kanskje aller først det vi holdt på med sist. Da så vi på... Ja, det siste vi så på, var systemkald. Og hvordan det i praksis ser ut... Når man måler tiden på programmer, så kjøres en god del instruksjoner i curl-mode.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0001", "start": 150.0, "end": 333.5, "token_count": 586, "text": "Men i prinsippet så ligner det på det vi skal gjøre nå. Men det kan være greit å få en litt bredere forståelse for... En litt bredere forståelse for plattformavhengighet. Men kanskje aller først det vi holdt på med sist. Da så vi på... Ja, det siste vi så på, var systemkald. Og hvordan det i praksis ser ut... Når man måler tiden på programmer, så kjøres en god del instruksjoner i curl-mode. Og da spesielt med systemcall. En default, hvis det ikke er noe spesielt som skjer, hvis du bare regner, f.eks., så kjøres alt i use-mode. Og det kan vi se med time. Så så vi på prioritet, og spesielt på nice. Hvordan man da... Da kan man prioritere ved å tildele tics til prosesser. Og nice kunne gjøre sånn at man var veldig snill med andre og tildelte... Bare si 'Jeg vil ha veldig få tics'. Og det kan f.eks. være nyttig sånn... Ja, når jeg editerer videoer på laptopen min, så den har åtte super-UR, Og kjører kanskje 16 sånne videoredigeringsjobber i parallell. Da kan det være nyttig å sette 'nice' på de, for da fungerer laptopen fortsatt ok. Og de prosessene som står og heltingen skal jobbe, de bare tar seg selv på utid når ingen andre ber om det. Og da fungerer systemet fortsatt bra. At alle prosesser som kjører, de skal få sippe ut dit når de trenger det. Så så vi også litt på prosessforløp, som vi begynner å bli ganske gode på nå. Hva som skjer med prosesser i et system. Og til slutt på OS-arkitektur. Hvordan selve arkitekturen av et operativsystem ser ut. Selve operativsystemprogrammet. I dag så skal vi... I første omgang så tenkte jeg bare å vise hvordan det ser ut når man mer teoretisk kjører JavaC og Bæsj-programmer under forskjellige OS. Og de eksemplene jeg har i utgangspunktet, er da Linux på vanlig PC, eller en laptop, som kjører X86-institusjoner. Den kjører... det er kanskje ikke en pency man kjører,", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0002", "start": 291.8, "end": 475.64, "token_count": 599, "text": "Hvordan selve arkitekturen av et operativsystem ser ut. Selve operativsystemprogrammet. I dag så skal vi... I første omgang så tenkte jeg bare å vise hvordan det ser ut når man mer teoretisk kjører JavaC og Bæsj-programmer under forskjellige OS. Og de eksemplene jeg har i utgangspunktet, er da Linux på vanlig PC, eller en laptop, som kjører X86-institusjoner. Den kjører... det er kanskje ikke en pency man kjører, det er vel en Seon som jeg har på laptopen nå. Men uansett, den kjører og forstår Exo 86-instruksjoner. Akkurat som det vi har sett på heltiden. I dag skal vi se på noen andre instruksjonssett. Men i tillegg har jeg en Windows-maskin som kjører på i dette tenkte eksperimentet, Og kjører den på akkurat den samme Intel-PC-en. Det er bare sånn dual-boot. Så en booter da opp på den helt samme Intel-PC-en, og har de samme X86-institusjonene sånn underliggende. Men det tredje eksempelet er operativsystemet Solaris. Og det er et Sun operativsystem. Sun var et Unix-firma som da, som typisk Unix-firmaer flest på 90-tallet og 2000-tallet, de bygde sin egen hardware og hadde sitt eget operativsystem som de kjørte alle institusjonene på. Og da hadde Sun kjørt på en Spark-prosessor, og den... Den maskinen hadde da bare Spark maskininstruksjoner, som var helt forskjellige fra X86-maskininstruksjoner. Like forskjellige som X86 er fra de maskininstruksjonene som vi hadde i det simulerte ZPU. Etterpå, når vi skal kjøre en demo av plattformen uavhengig, så skal vi da se på et tredje instruksjonssett, nemlig ARM-instruksjonssettet. Som er verdens vanligste institusjon sett, for det er det som kjører på alle mobiltelefoner. Men det kan også brukes på servere. Vi skal kjøre på noen servere og sammenligne med hvordan det ser ut i forhold til Intel. Men det viktigste å ha med her er at dette er institusjoner som er helt forskjellige fra X86-institusjoner, som er det vi er vant til.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0003", "start": 439.6, "end": 623.96, "token_count": 597, "text": "så skal vi da se på et tredje instruksjonssett, nemlig ARM-instruksjonssettet. Som er verdens vanligste institusjon sett, for det er det som kjører på alle mobiltelefoner. Men det kan også brukes på servere. Vi skal kjøre på noen servere og sammenligne med hvordan det ser ut i forhold til Intel. Men det viktigste å ha med her er at dette er institusjoner som er helt forskjellige fra X86-institusjoner, som er det vi er vant til. Hvis du logger inn på laptoper eller servere, så finner du X86-institusjoner i CPU-en. Men det kan da være forskjellig operativstemme på toppen av det. Og den sammenkoblingen kaller vi en plattform. Så... Dette er det samme eksempelet som vi skal bruke senere. Hello.java. Det er bare et javaprogram som skriver ut Hello World. Og når vi kompilerer det på Linux, så kompilerer vi sånn... Og da lages en Java class-fil. Og den inneholder da Java bite-kode. Og det er kode som er for en JVM eller en Java virtuell maskin. Så vi kan se på bildet her nede. Det ser ut som noe sånt som dette. Så vi kompilerer, og så får vi en hello.class-fil. Og da er det helt essensielt at dette er helt forskjellig fra A.out, som vi har sett på tidligere, som inneholder maskinkode. Som er da instruksjoner for X86. X86-instruksjoner... A.out kjører på en måte direkte på X86. Men Hello.class kjører inne i en JVM, en Java-virtuell maskin. Og da er hele poenget som gjør Java plattform uavhengig, at på Linux er det en egen Linux-JVM, på Windows er det en annen Windows-JVM, og på Solaris er det en Solaris-JVM. Så på den måten så kan Hello.class kjøres på alle disse plattformene,  Og man kan til og med ta Hello Let Class herfra, kopiere over på en Windows-maskin og få den til å kjøre. Og så kan den kopiere over på en sparkmaskin. Og så kjører den likevel fordi den har en JVM som tolker instruksjonene. Det blir litt overhead. Ting går litt saktere. Men Java er veldig god på overhead. Opp gjennom årene så er den klar...", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0004", "start": 585.46, "end": 779.16, "token_count": 597, "text": "og på Solaris er det en Solaris-JVM. Så på den måten så kan Hello.class kjøres på alle disse plattformene,  Og man kan til og med ta Hello Let Class herfra, kopiere over på en Windows-maskin og få den til å kjøre. Og så kan den kopiere over på en sparkmaskin. Og så kjører den likevel fordi den har en JVM som tolker instruksjonene. Det blir litt overhead. Ting går litt saktere. Men Java er veldig god på overhead. Opp gjennom årene så er den klar... Og har klart å optimalisere veldig, sånn at det faktisk går nesten like raskt å kjøre Java som å kjøre kopilert C-kode. Det skal vi se på senere. Det er det en del om i onsdagsforelesningene, de digitale forelesningene, og noen oppgaver denne uken som går på akkurat det, å sammenligne tider. Og se hvor fort ting går. Med Java og Python og andre produksjoner. Men igjen, det vesentlige her... Hello, the class... Det er en helt egen... Man kan si at det er et maskinspråk, dette også, men det er for en virtuell maskin. Så vi skal se på det i detalj senere, hvordan instruksjonene i Bite-koden til Java ser ut. Og det er faktisk mulig å lage hardware... Java virtuell maskin, men man kaller det Java reell maskin. Det har blitt laget reell hardware som kjører Class-kode direkte. Med prinsippet er det samme. Dette med virtuelle maskiner gjelder også sånn som Python og Csharp og Pearl. De kjører på virtuelle maskiner på denne måten. En tradisjonell, sånn som C og C pluss, kompileres det, så kjører man direkte på hardware. Så plattformuavhengighet er at man kan ta Hello.class-filer og kopiere over til andre plattformer og kjøre de der som om ingenting skulle ha skjedd. Så kom vi til hello.c, og dette er da et program som er i høyeste grad plattform avhengig av. For når vi komplerer hello.c, sånn som vi har gjort mange ganger, så ser vi at så får vi en adopt-out, og den vil inneholde X86-instruksjoner. Sånn som denne her. Move X til X. Og det er klart. Instruksjonene forstås bare av en X86-CPU.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0005", "start": 740.04, "end": 924.24, "token_count": 592, "text": "som om ingenting skulle ha skjedd. Så kom vi til hello.c, og dette er da et program som er i høyeste grad plattform avhengig av. For når vi komplerer hello.c, sånn som vi har gjort mange ganger, så ser vi at så får vi en adopt-out, og den vil inneholde X86-instruksjoner. Sånn som denne her. Move X til X. Og det er klart. Instruksjonene forstås bare av en X86-CPU. Altså en CPU som har innebygd, brent inn X86-instruksjoner fra bunnen av. Den kan ikke forstå spark-instruksjoner, f.eks. Så her, med object dump fra en ADA-doktal, så kan du se hvilke instruksjoner som... Det Object Dump gjør her, er på en måte det motsatte av Assembly. I tillegg har vi sett på en Assembly hvor vi går fra Assembly-kode til maskinkode. Men denne her på en måte viser hva maskinkodene inneholder. Og hvis vi gjør dette her på Solaris... Dette er et eksperiment vi gjorde det på Solaris. Så vil vi rett og slett se at her er det andre institusjoner. Det har faktisk ad og sub, men du ser... Ad har tre argumenter. Her oppe har det to. Så fins det en del andre... Det fins noen andre instruksjoner også, sånn som TST og LOD. Så dette er helt fundamentalt forskjellige maskininstruksjoner. ... så fungerer det dårlig. Så hvis jeg tar adopt-out, som er komplert for en Linux-maskin, og flytter over på Windows og prøver å kjøre det, så enten så skjer det ingenting, eller så får man en feilmelding om wrong binary eller et eller annet sånt. Og det til tross for at X86-institusjonene i bunnen er akkurat de samme. Så her er det move i, x, b, x osv. X86-institusjoner. Men et program må også snakke med operativsystemet. Og hvis du flytter over adopt-out hit, så kommer du inn på Windows, og så begynner du å snakke med Linux-biblioteket for å printe ut noe. Og da er det klart at det fungerer dårlig. Da vil programmet ikke virke. Hvis vi tar adopt-out og så flytter over hit på Solaris, så...", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0006", "start": 887.52, "end": 1060.52, "token_count": 597, "text": "Og det til tross for at X86-institusjonene i bunnen er akkurat de samme. Så her er det move i, x, b, x osv. X86-institusjoner. Men et program må også snakke med operativsystemet. Og hvis du flytter over adopt-out hit, så kommer du inn på Windows, og så begynner du å snakke med Linux-biblioteket for å printe ut noe. Og da er det klart at det fungerer dårlig. Da vil programmet ikke virke. Hvis vi tar adopt-out og så flytter over hit på Solaris, så... Vil dobbelt ikke fungere. Først prøver du å snakke med Linux-operativsystemet. Det går veldig dårlig. I tillegg prøver du å utføre X86-institusjoner på en helt annen arkitektur. Det er dømt til å mislykkes å prøve å kjøre alt og tapt på en plattform som har både et annet operativsystem og et annet instruksjonssett. For at man kan oppnå plattformuavhengighet ved å bruke virtuelle maskiner som da tolker koden her. Men det har også en pris, at ting går litt saktere. Men veldig mange programmeringsspråk har valgt det. Men hvordan kan man kjøre et C-program på Windows eller Solaris? Jo, det som da er clouet, er at da må du gjøre ett stepp til. Du må kompilere. Du må ha en kompulator for den plattformen. Og da kan vi kompulere og få en A.xe, og så kan den kjøre på Windows. Eller en s.out, som man fikk til folk med GCC på Spark, på Solaris. Og da kan man kjøre C-programmet på denne plattformen. Men da er hele forskjellen... Du må kompilere og laste inn maskinkoden, og så kan du kjøre den. Og dermed er det da... Og dermed sier vi da at C-kode er ikke plattformavhengig. Nei, hva sier jeg nå? C-kode ER plattformavhengig. Viktig forskjell. Ikke der. Det finnes ikke lenger, og det er en ganske utdøende rase, sånn de gamle typen Unix-maskiner. Det kjører sikkert en del sånne rundt omkring, akkurat som det fortsatt kjører i BEM stormaskiner,", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0007", "start": 1019.78, "end": 1217.98, "token_count": 600, "text": "Og dermed er det da... Og dermed sier vi da at C-kode er ikke plattformavhengig. Nei, hva sier jeg nå? C-kode ER plattformavhengig. Viktig forskjell. Ikke der. Det finnes ikke lenger, og det er en ganske utdøende rase, sånn de gamle typen Unix-maskiner. Det kjører sikkert en del sånne rundt omkring, akkurat som det fortsatt kjører i BEM stormaskiner, men de blir færre og færre. Det meste nå går på X86. Men det fins også servere som kjører på Arm. Det går også med Hello.bæsj. Altså kjøre et bæsjprogram på de forskjellige plattformene her. Det går fint på Linux og Spark, men da igjen... Da må du installere bæsj, og så kjøre det. Det ligner jo litt på en virtuell maskin, det også, for da må du tolke det. På Window går det ikke i utgangspunktet. Men hvis du f.eks.... Du kan installere Linux på Windows. Og da kjører Linux rett på X86. Og i tillegg så kan du da installere et bæsjel. Det kan du på andre måter òg. Så det er mulig å installere Vers på Windows. Sånn at du kan kjøre skript der. Det var en lang innledning om plattformavhengighet. Og så skal vi se på dette i praksis. Da skal jeg gjøre en demo hvor jeg kjører på de følgende fem plattformer her. For det første så har jeg laptopen min, som er en Linux ubundet 1804. Det har jeg kjørt eksempler på i hele vår. Og den har da X86-institusjoner. Så det er viktig å ha klart for seg. Intel og AMD, de CPU-ene, begge de har X86-institusjoner. Så har jeg noen forskjellige Java-versjoner. Java 11 og Python 36 på denne. Og det er et viktig poeng etter hvert, når vi kjører på andre Java-versjoner. Java er til dels avhengig av versjoner. Så spesielt så er det noen ganger gamle Java-programmer ikke virker på... Eller eldre Java-programmer virker på nyere, men hvis man kompilerer på en nyere Java-versjon, så virker det ikke alltid på de gamle. Men det skal vi se på.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0008", "start": 1180.18, "end": 1380.32, "token_count": 595, "text": "Så har jeg noen forskjellige Java-versjoner. Java 11 og Python 36 på denne. Og det er et viktig poeng etter hvert, når vi kjører på andre Java-versjoner. Java er til dels avhengig av versjoner. Så spesielt så er det noen ganger gamle Java-programmer ikke virker på... Eller eldre Java-programmer virker på nyere, men hvis man kompilerer på en nyere Java-versjon, så virker det ikke alltid på de gamle. Men det skal vi se på. Så neste plattform jeg har, er en gammel Mac, en gammel Macbook Pro. Med Darwin-kjerne. Den ligner litt på... Det er en Unix av art. Men det er en variant av Unix. Derfra har man typisk et bachel i Pine Mac. Men det er samtidig en del forskjeller. Men... CPU-en er... En Intel-korduo som da også kjører X86-institusjoner. Så er Java6 og Python26... Python er en forskjell på Python3 og Python2, men vi skal se at Python er i større grad uavhengig av versjoner. Og så har jeg en DelServer med en AMD-CPU. Det er en svær server med 48 CPU-er. Men den også kjører på X86. Altså i tillegg er jeg vant til Python 2.7. Så kom vi inn noe som er faktisk en nyhet av året, selv om det ikke er helt nytt, og det er... Dette er en Linux ubundet 2004, men den kjører på en Arm CPU. Det er en Arm CPU som er lagd for servere. Vanligvis brukes Arm i mobiler. Derfor er de konstruert sånn at de bruker mindre strøm. Er ganske sånn lettvekt når det gjelder drift. Men tradisjonelt så har man alltid kjørt Exo 86, ikke alltid, de siste 10-15 årene har Exo 86 vært dominerende i serverrommet. Har det også begynt å komme arm-baserte servere. Dette er en sånn arm-basert server. Den kjører i Amazon... Elastic Cloud. Så dette er en cloud-server. Som jeg har kjøpt en VM på. Så dette er VM-er som man betaler per måned. Koster ikke veldig mye for én, men kjøper du en stor en, så koster det en del. Plattformen er en Windows Server 2019, som også er S2.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0009", "start": 1338.48, "end": 1567.76, "token_count": 600, "text": "de siste 10-15 årene har Exo 86 vært dominerende i serverrommet. Har det også begynt å komme arm-baserte servere. Dette er en sånn arm-basert server. Den kjører i Amazon... Elastic Cloud. Så dette er en cloud-server. Som jeg har kjøpt en VM på. Så dette er VM-er som man betaler per måned. Koster ikke veldig mye for én, men kjøper du en stor en, så koster det en del. Plattformen er en Windows Server 2019, som også er S2. Også Amazon Cloud. Men den kjører på en Intel Zeon Sippu. Altså den samme Sippuen som her oppe. Ikke helt samme, men samme Sippu-familie og igjen X86, Java 8 og Python 39. Så dette er de forskjellige plattformene, og så skal jeg nå prøve å gå inn på de. Så jeg kompilerer alt på denne. Fire programmer. Hello.c, hello.java, hello.python og hello.bash. Så kopierer jeg de til alle fire plattformene. Og så skal vi se hva som fungerer hvor. Jeg håper du har fått til en... Etter pause altså få til en liten... Så det er viktig å følge godt med hva som skjer. Men da skal vi gå over og se på... Håper dere er i stand til å se dette. Her er jeg nå i en mappe som heter Hello. Og i denne mappen har jeg... For det første så har jeg de fire programmene. Skal ta de først. Hello.c. Det er da et c-program. Hello.java. Det er et Java Hello World. Og så har jeg hello.python. Og til slutt hello.special. Så tanken er nå å kopiere disse. Over til de andre plattformene. For å gjøre det har jeg et skjedskrift som heter dist.shell. Og det det gjør, er å kopiere hele denne mappen som jeg nå står i, den hello, til de andre plattformene. Dette er AMD-serveren. Dette er MacWoodson. De to siste kjører da på Amazon Cloud. Men før jeg gjør det, så er da hele ideen at jeg skal kompilere og kjøre programmene her. Og da har jeg et lite skrift som heter Compile. Det er bare C-programmet og Java-programmet som må kopieres først. Det har vi sett mange ganger. Java er sånn man kompilerer... Java-filler på Linux.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0010", "start": 1513.04, "end": 1743.88, "token_count": 599, "text": "den hello, til de andre plattformene. Dette er AMD-serveren. Dette er MacWoodson. De to siste kjører da på Amazon Cloud. Men før jeg gjør det, så er da hele ideen at jeg skal kompilere og kjøre programmene her. Og da har jeg et lite skrift som heter Compile. Det er bare C-programmet og Java-programmet som må kopieres først. Det har vi sett mange ganger. Java er sånn man kompilerer... Java-filler på Linux. Og når man gjør det, så lages det en hello.class. Så det er den vi da sender over. Så hvis jeg kjører compile, så kompilerer jeg altså hello.c. Så jeg får en ny versjon. Adopt-adt her. Og tanken nå er at nå skal jeg kopiere alle disse over til de andre plattformene. Der har jeg satt opp SSO-nøkler, sånn at du ser at de kopierer over til alle plattformene. Også på Windows har jeg satt opp SSO-nøkler. Det går an. Så gå inn på Windows med SSO også. Vi skal se på det senere. Det er litt mer knot å sette opp SSO-nøkler på Windows, men det er mulig å få til. Og så kan vi gå rundt på de andre plattformene og se hvordan det ser ut å kjøre de fire programmene. Da hopper vi først ned hit til... AMD-serveren. Altså det er en server som kjører Linux buntus 1604 på en AMD Oppdron. Ops. Skal vi prøve å få det vinduet... Nei. Ikke gjør noe helt galt her. Oi. Ja, forklar meg med det lille vinduet. Jeg trodde jeg skulle ha fått litt større. Nei, OK. Jeg skal kjøre i... Jeg kan ta det én av gangen. Jeg kan først starte med Adopt. Nå har jeg kompilert her oppe på Linux med Intel. Så har jeg kopiert det over hit. Og så kjører jeg det her på AMD-serveren. Og... og... ja... eh... dette var ikke så rart. For her kjører jeg out and out, men jeg står jo i... Jeg har ikke gått inn i mappen, så jeg må inn i Hello. Så dette beviser ikke så veldig mye. Men nå er jeg inne i mappen. Alt er kopiert over hit. Så nå kan jeg prøve å kjøre av dataet. Og da så jeg faktisk... Det fungerer.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0011", "start": 1699.52, "end": 1924.6, "token_count": 585, "text": "Og så kjører jeg det her på AMD-serveren. Og... og... ja... eh... dette var ikke så rart. For her kjører jeg out and out, men jeg står jo i... Jeg har ikke gått inn i mappen, så jeg må inn i Hello. Så dette beviser ikke så veldig mye. Men nå er jeg inne i mappen. Alt er kopiert over hit. Så nå kan jeg prøve å kjøre av dataet. Og da så jeg faktisk... Det fungerer. Det betyr ikke at C er plattform uavhengig. For hele poenget er at dette er samme plattform. Det er Linux på X86. Så selv om det er en annen Ubuntu-versjon og det er en annen prosessor, AMD, i stedet for Intel... Så vi har begge X86-institusjoner. Og da fungerer det å bare kopiere over alltid-og-talt på den måten. Ja, jeg kan kjøre eksplisitt, så vi kan ta JavaHello også. Når jeg kjører JavaHello, så ser vi at jeg får noen feilmeldinger. Man skulle tro dette fungerte, men det er en sånn... Et versjonsproblem. Denne versjonen av Java RunTime gjenkjenner bare ClassFives versjoner opp til 52.0. Uavhengig. Litt plattformavhengighet ser vi at det er. Men jeg kan kjøres og teste Python. Det fungerer fint. Og... Og Bæsj fungerer også fint. Det er ikke så overraskende. Så oppsummert, hvis jeg kjører... Python og Bæsj og AdultOut fungerer, men ikke... OK, da. Da kan vi hoppe til MacOS. Så kan jeg prøve å huske å gå inn her. Nå er jeg inne i riktig mappe i MacOS. Jeg har kopiert over alle de samme filene. Så kan jeg prøve å kjøre Adataut her. Og det går dårlig. Jeg får cannot execute binary file. Og det er ikke så rart når man tenker seg om, fordi... Selv om dette er en Intel-CPU med X86-institusjoner, så er det et annet operativstem. Det er MacOST. Og A.out prøver å snakke med Linux-tjernen. Og dermed så går dette dårlig. Og så har vi samme problemet. Dette er Java 6, en eldre Java-versjon,", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0012", "start": 1878.78, "end": 2114.26, "token_count": 597, "text": "Så kan jeg prøve å kjøre Adataut her. Og det går dårlig. Jeg får cannot execute binary file. Og det er ikke så rart når man tenker seg om, fordi... Selv om dette er en Intel-CPU med X86-institusjoner, så er det et annet operativstem. Det er MacOST. Og A.out prøver å snakke med Linux-tjernen. Og dermed så går dette dårlig. Og så har vi samme problemet. Dette er Java 6, en eldre Java-versjon, så den kjenner ikke igjen den nyere Java 11-klassfilm. Python derimot... Den går fint. Men hva så med bæsjere? Ikke så helt opplagt. Det er bare en standard kommandolinje. Jo, Macbook har bæsjer installert, så den kjører helt fint. Ok. Da skal vi over på ARM. Etter pausen kan vi kanskje se litt mer på ARM i detalj, men hovedpoenget her er at de underleggende maskininstruksjonene her... CPU-ene som vi kjører på, den er helt forskjellig. Et helt annet instruksjonssett. Så hvis jeg prøver å kjøre adat der, så ser vi at jeg får en... I serven så kjører ikke ADOT-AT. Og det er rett og slett fordi her er det ARM-instruksjoner. Det er helt annerledes. Jeg har et eksempel på hvordan disse hører ut i mappen over her. En SUM.s som er kompilert her. Her er en institusjon. Det er ikke så veldig forskjellig... Dette er bare én institusjon. Men vi har andre navn på registeret. Og det er andre institusjoner. Dermed er det umulig å ta en ADAT-fil. Eller hvilket som helst annet program som er kompilert med CSR++. Det kan man ikke bare kopiere over og kjøre på en maskin som har en arm-plattform. Derimot så kan vi prøve Java. Og Java funkerer fint her. Og det er fordi at her er det Java 14, så den er såpass ny at den... Den er faktisk nyere enn Java 11, så den tolker fint. Og... det er jo upuntu, så... hva heter det... Nei... jeg har holdt opp bæsj. Og bæsjgreitet kjører også fint. Så til slutt skal vi over på vindoss.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0013", "start": 2057.12, "end": 2282.86, "token_count": 586, "text": "Det kan man ikke bare kopiere over og kjøre på en maskin som har en arm-plattform. Derimot så kan vi prøve Java. Og Java funkerer fint her. Og det er fordi at her er det Java 14, så den er såpass ny at den... Den er faktisk nyere enn Java 11, så den tolker fint. Og... det er jo upuntu, så... hva heter det... Nei... jeg har holdt opp bæsj. Og bæsjgreitet kjører også fint. Så til slutt skal vi over på vindoss. Og her har vi også kopiert over alle fillene. Eller har dere merket at jeg kjører... Det er fordi dette er Windows PowerShell, som vi skal se på etter påske. Her fins alias for veldig mange Linux-kommandoer, sånn at man kan bruke Linux-kommandoer når man jobber med PowerShell. Så her har vi sammen med Love og Udre alt er kopiert over. Men da kan jeg prøve å kjøre Odd-out. Prikk, backslash... er det i stedet for prikk, slash? Prøver jeg å kjøre det, så ser jeg... Jeg får ingenting. Men jeg får i hvert fall ikke ut... Hello, Word. Jeg kunne prøvd å gjøre noe sånt som... Kalad.exe, for Windows er veldig sånn... I institusjonsnett... Nei, avhengig av extension på fillene. Men... Det eneste jeg får beskjed om, er at Adolt.exi ikke filtrer den... Man kan ikke kjøre den... Man klarer ikke å kjøre den filen. Og det er da fordi Adolt.no snakker med Linux-operativsystemet. Så da er det ikke så rart at den ikke kjører. Det er da ikke så rart at... ... at dette ikke fungerer. Og det til tross for at det er akkurat samme CPU. Det er en Intel CON CPU. Så maskininstitusjonene er de riktige. Her er problemet igjen at A.no prøver å snakke med Linux-åpnet tidsstemme, så treffer den Windows-server, og da fungerer ingenting. Så dermed vil det ikke fungere. Java, derimot, kunne man i prinsippet tenke fungerte, men igjen så er det den run-time-problemet. Når vi går fra versjon 11 ned til versjon 8, så fungerer det. Pyton, derimot... Den fungerer fint.", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0014", "start": 2236.52, "end": 2495.88, "token_count": 596, "text": "Det er en Intel CON CPU. Så maskininstitusjonene er de riktige. Her er problemet igjen at A.no prøver å snakke med Linux-åpnet tidsstemme, så treffer den Windows-server, og da fungerer ingenting. Så dermed vil det ikke fungere. Java, derimot, kunne man i prinsippet tenke fungerte, men igjen så er det den run-time-problemet. Når vi går fra versjon 11 ned til versjon 8, så fungerer det. Pyton, derimot... Den fungerer fint. Den kjører på... ja, er det Pyton 3936, så det er ikke så rart at den kjører, men den oppfører seg fint. Så helt til slutt... hva med LOL-dukt-bæsj? Det skjer ikke noe der, men hvis jeg eksplisitt kjører sånn som... ... så ser vi at det faktisk fungerer. Men det er fordi her har jeg isolert den Linux-modulen. Sånn at jeg har... sånn at jeg har et perser. Så jeg kan starte perser her og kjøre Linux-kommandoer som LS-minus. Men det som er interessant nå, er hva om jeg prøver... Det har jeg faktisk ikke testet. Hva om jeg prøver å kjøre a.alt her? Inne i Linux-modulen. Jo, det fungerer faktisk. Så her er det på en måte native Linux som kjører direkte på X86. Når jeg starter perset her inne, så får jeg opp et ekt... Eller... Det er faktisk en Linux-kjerne som kjører. Det er vel en... Jeg er ikke sikker på detaljene, om det er en virtuell maskin, men det er iallfall en ekte Linux-kjerne som kjører, sånn at man kan kjøre native Linux-programmer på denne videoen. Spørsmål i 17. Begge Linux-serverne. Hvis vi oppsummerer, så... Den fungerte her... Og her. Og også på Mac fungerte den. Ja, her kjørte jeg opp. Så... Ingen har forstått spørsmålet? Hei, heter du så. Jeg tenkte jeg skulle si ifra. Flott. Nei, det var denne her. Det var bare at jeg skrev feil. Så det var ikke Linux sin feil. Det var min feil som skrev noe feil. Kjørte Adotat mellom dem? Skal vi se... Ja, faktisk. Det var jeg litt...", "source": "lecture"}
{"lecture_id": "os10time1", "chunk_id": "os10time1_0015", "start": 2447.32, "end": 2552.28, "token_count": 276, "text": "Og også på Mac fungerte den. Ja, her kjørte jeg opp. Så... Ingen har forstått spørsmålet? Hei, heter du så. Jeg tenkte jeg skulle si ifra. Flott. Nei, det var denne her. Det var bare at jeg skrev feil. Så det var ikke Linux sin feil. Det var min feil som skrev noe feil. Kjørte Adotat mellom dem? Skal vi se... Ja, faktisk. Det var jeg litt... Det er ikke helt opplagt. Men her har vi bare tatt en Adotat, så kopiert rett over fra Linux-sipput på Intel, komplert for Intel Sipput, og så kopiert over hit. Det er fordi alt er likt. Så om du kopierer her og kopierer tilbake, så får du også en samme effekt. Ja, det er riktig konkludert. Begge er X86-prosesser. Ok, da tar vi et kvarters pause. Og så skal vi legge opp en liten pause, sånn at vi med spørsmål... Så kan vi se litt mer på dette etter pause før vi begynner på tråder.", "source": "lecture"}
