{"lecture_id": "os10time2", "chunk_id": "os10time2_0000", "start": 0.0, "end": 220.08, "token_count": 586, "text": "Før vi begynner å se på tråder og trets generelt, så tenkte jeg at vi skulle ta en poll. Jeg hadde egentlig tenkt å ta ett spørsmål av gangen, men vi kan ikke gjerne ta alle på en gang. Så jeg loungerer en poll nå. Den kommer opp. Flott. Da er det bare å svare. Og så er det viktige poenget at dette er multiple choice også. Som det første - hvor vil Adot, outcomplert med GSSI, kjøre? Og da kan man velge flere alternativer. Så hvis du så før pausen, så var det ikke bare ett sted det fungerte. Prøv å huske hva som skjedde, og de forskjellige forskjellene. Og start å svare. Det er noen gjenhold som er i gang allerede. Mens dere holder på, kan jeg gå gjennom spørsmålene ett for ett. Det første er hvor Vil-ah.out kjøre uten ferdigmeldinger. Så kopierer jeg det med KSUSR på Linux med Interm. Det vil da være Exo til seks instruksjoner. Så kopierer jeg det over til alle de andre plattformene. Så er spørsmålet hvor... På hvilke av disse plattformene vil faktisk Adolt Alt kunne kjøre? Spørsmål nummer to er det tilsvarende med Lodoto? Og så er det poeng at den er komplett med Java 11. Og som ikke er kompatibel med alle eldre versjoner av Java. Så her er Java-versjonen viktig. Hvis det ikke var for det, så er Java helt plattformuavhengig. Og så er det Pyton. Han kjører... Man kopierer 1.02.pi til alle plattformene, og hvor kjører de uten feilmelding? Og til slutt er det tilsvarende med 1.02.pi. Hvor kjører den uten feilmelding? Og da er det et poeng at... I chatten i pausen om Python... Ja, om spesifikke Python-versjoner. Og da svarte jeg at... Ja, som dere ser... Det ble sånn som at Javar kompileres av en lager, en klassefil. Men i Python så kompileres den ikke eksplisitt. Med Python blir programmet kompilert all the flies. Når du kjører et Python-program, så kompileres det til bitekode,", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0001", "start": 167.24, "end": 444.76, "token_count": 594, "text": "Og da er det et poeng at... I chatten i pausen om Python... Ja, om spesifikke Python-versjoner. Og da svarte jeg at... Ja, som dere ser... Det ble sånn som at Javar kompileres av en lager, en klassefil. Men i Python så kompileres den ikke eksplisitt. Med Python blir programmet kompilert all the flies. Når du kjører et Python-program, så kompileres det til bitekode, sånn som Java, men man ser ikke hvem mellomleddet. Det først kompileres, og så kjøres det i en Python-virtuell maskin. Så det er i prinsippet det samme som skjer på Java, men der har man en eksplisitt kopilering til Java bitekode. Og dermed kan du få den typen problemstillinger med alltid forskjellige versjoner hvor det da ikke fungerer. Ja... Skal vi se hvordan det går med Pollen her... Vi kan godt gi det et par minutter til, så dere får tenkt dere om. Det er generelt veldig viktig å prøve å være litt aktive på forelesningene. Uansett... Når du leser om oppletissemsof, så prøv å tenke gjennom problemstillingene, og først og fremst prøv å teste det ut selv. Hvis du lurer på et eller annet, så kan man alltids teste det ut. Det tar tid. Så... Men derfor... Vi bruker gjerne litt tid på et poll som dette her, for det er viktig å prøve å tenke over hva var det som egentlig skjedde når han kjørte alle disse programmene. Og da er det altså lettere å komme litt mer under utenpå hva som egentlig skjer. Og så kan du, hvis det er noen spørsmål som dukker opp her, så kunne vi jo... Så kan vi teste det ut og se hvordan det fungerer. Eksplosivt... kjøre... Pyton. Pyton 2, f.eks. Så det vil da ikke være noen forskjell på å kjøre med Pyton 2 eller jo, kanskje. Skal vi se... Så skjønner jeg hva du mener. Her står det Jussebien Python. Og det er Python 2, ja. Så... Så det er vel egentlig det som står her, som er litt... ... litt feilaktig. Det er jo ikke feil.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0002", "start": 360.0, "end": 654.92, "token_count": 582, "text": "Eksplosivt... kjøre... Pyton. Pyton 2, f.eks. Så det vil da ikke være noen forskjell på å kjøre med Pyton 2 eller jo, kanskje. Skal vi se... Så skjønner jeg hva du mener. Her står det Jussebien Python. Og det er Python 2, ja. Så... Så det er vel egentlig det som står her, som er litt... ... litt feilaktig. Det er jo ikke feil. Python 3 er versjonen Python 3. Men... Vi ser at... Vi ser at dette er akkurat den institusjonen her og er faktisk avhengig av Python 3. Og når jeg kjører jusbilen Python, så må jeg vite... Og her nede er det piten 2. Så det ser faktisk ut som det var piten 2 overalt. Skal vi se hvordan det var her. Her er piten 3. Så når man har kopiert den nye piten der, så vil vel da... Men det ser da ut som... Det opprinnelige jeg hadde, var med permittenser, og da fungerer det både på Python 2 og Python 3. Igjen, det er et eksempel på hvordan Python også ikke fungerer. Helt fullstendig plattformuavhengig. Her har vi en... eller ikke plattform, men versjonsuavhengig. Men i prinsippet er både Java og Python plattformuavhengig på den måten at de har virtuelle maskiner for begge plattformene som de kjører bytekode i. Men forskjellen er at Python kompilerer underfly. Da kan vi kanskje stoppe... Pollingen. Jeg tenkte jeg bare skulle ta et... En screenshot av den. Så dette er en anonym poll, så... Så ingenting blir lagret om hvem som svarer hva osv. Men da stopper jeg pollingen. Og så deler jeg resultatene. Sånn, Ine, ser du resultatene da? De kommer opp. Flott. Da kan vi se litt på resultatene. Den første er avdådt alt, komplert med gisselser. Skal vi se, da må vi prøve å huske hva som egentlig skjedde her. Jo, adopt... Den kjørte i hvert fall på en AMD med AMD-opptråd. Og de aller fleste har svart at den gjorde det. Det er riktig.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0003", "start": 613.2, "end": 802.78, "token_count": 598, "text": "Sånn, Ine, ser du resultatene da? De kommer opp. Flott. Da kan vi se litt på resultatene. Den første er avdådt alt, komplert med gisselser. Skal vi se, da må vi prøve å huske hva som egentlig skjedde her. Jo, adopt... Den kjørte i hvert fall på en AMD med AMD-opptråd. Og de aller fleste har svart at den gjorde det. Det er riktig. Men jeg ser det er mange som har svart at den kjørte på Arm Linux i bunk til morgen. Det gjorde den faktisk ikke. Den her... Skal vi se... Altså her borte... Dere ser en av skjermene nå, gjør dere ikke det? Alt synes. Ja, flott. Jo, Adopt-Alt her... På Arm så kjører ikke Adopt-At. Og det er rett og slett fordi... Det er ARM-instruksjoner som ligger i bunnen, så CPU-en forstår ikke hvilke instruksjoner som ligger i ADAT når den er kompilert for en X86-prosessor. Så den er ikke viktig. På Windows-server kan du si at den både kjørte og ikke kjørte. I utgangspunktet kjører den ikke fordi det er en Windows-operativsted. Men når du da kjører en ekte Linux-kjerne... På Mac så kjørte den heller ikke. Det er en del som har svart at den kjørte der. Til tross for at det er en del likheter, Adolf kjører ikke fordi den prøver å snakke med lingvistjernen, og så treffer den MacOS. Og da fungerer det ikke. Så det er bare den her, som de aller fleste svarte, som er riktig. Hallo...! Her har de fleste fått med seg hva som skjedde. På eldre Java-versjoner så kjørte ikke den helodo-plass. Men den kjørte bare her, som 90 % har sagt, på Linux-sekundtur. På ARM, fordi den hadde en nyere Java-versjon. Python... Ja, det vi har sett, så kjørte vel Python egentlig overalt. I hvert fall når vi ikke tok med det med... Når vi hadde med parenteser, som på en måte var plattformuavhengig... Da... Det er jo Python-versjoner, da, men Python kjørte overalt. Og var veldig plattformuavhengig.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0004", "start": 762.72, "end": 1048.34, "token_count": 594, "text": "Men den kjørte bare her, som 90 % har sagt, på Linux-sekundtur. På ARM, fordi den hadde en nyere Java-versjon. Python... Ja, det vi har sett, så kjørte vel Python egentlig overalt. I hvert fall når vi ikke tok med det med... Når vi hadde med parenteser, som på en måte var plattformuavhengig... Da... Det er jo Python-versjoner, da, men Python kjørte overalt. Og var veldig plattformuavhengig. Det samme kan man vel egentlig si at LOD-bæsj gjorde. Og på Mac... Og det kjørte nesten selvfølgelig på disse Linux-punktene. Her igjen så er det både ja og nei. På en standard Windows-server, så kjører du ikke et bæsjer. Men hvis du installerer Linux subsystem... Så kjører... Så installerer du også bæsj, og da kan du få det... Men det... ja, det er på en måte litt... Litt juks for å installere en ny plattform. Eller juks... Man må ta med det i beregningen. Men default vil verken et kjeldeskreft eller adotat kjøre på Windows. Skal vi se... Det er spørsmål... Spørsmål 1, så skal vi begynne å se på... Tror... Eller et lite... Et lite blikk. Det var... Vi så kanskje på det, ja. Skal vi se... Men hva kan vi gjøre? Bare for å gjøre det eksplisitt, så kan vi bare søy raskt på... her. Her er det armfrektor. Så det kan være interessant å se på... Men med den aksjonen minus stor S, så er det... sånn. Da får jeg en sum.s som inneholder... Vi ser at dette er ganske forskjellig fra de X86-institusjonene vi er vant til. Men noen av de heter de samme, sånn som AD. Men her er det AD med tre argumenter og... ja... Elderøster... Jeg kjenner ikke de institusjonene. Men prinsippene er de samme. Her har vi en compere, f.eks. Og vi har løkker som hopper rundt. Hvis man studerte disse institusjonene, så vil du se at dette er det summeprogrammet som legger sammen tall fra 1 pluss 2 pluss 3 pluss 4. I prinsippet så fungerer maskinkoden på samme måte.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0005", "start": 1004.76, "end": 1210.34, "token_count": 584, "text": "Men her er det AD med tre argumenter og... ja... Elderøster... Jeg kjenner ikke de institusjonene. Men prinsippene er de samme. Her har vi en compere, f.eks. Og vi har løkker som hopper rundt. Hvis man studerte disse institusjonene, så vil du se at dette er det summeprogrammet som legger sammen tall fra 1 pluss 2 pluss 3 pluss 4. I prinsippet så fungerer maskinkoden på samme måte. Men det er andre institusjoner. Så de vil se helt forskjellige ut. Og disse institusjonene her... Hvis man kopierer dem over til en X86-maskin, så fungerer det opplagt ikke i det hele tatt. Fordi disse institusjonene er totalt uforståelige for en X86-maskin. Ok. Da skal vi opp til tråder. Tråder er en måte å findele prosesseringen av en prosess på. Tidligere har vi sett på prosesser som bare har én tråd. Alle prosesser har en tråd, og tråden er på en måte den... Veien gjennom et program. Det er den veien som følges når man utfører et program. Jeg har en... Jeg har en litt senere sløyd her som... ... som viser disse trådene. Det er sånn man tenker seg en tråd. At det er veien som... Man snor seg gjennom når man kjører kode. Her er det en sånn tradisjonell singeltradisjonsprosess. Når vi er oppe i data her, så kanskje vi har en kommando som lagrer noe til data. Og så gjør den noen instruksjoner. Og så hopper den frem og tilbake. Den følger da en tråd gjennom kode og data. For én prosess vil dette bare være én tråd som følges. Hele tiden vet man nøyaktig hvilken institusjon prosessen utfører. Det er denne rekken av institusjoner som vi kaller en tråd. Så kommer den nye når vi snakker om begrepet tråder, og det er at man innenfor den samme prosessen har flere tråder.  Man utfører den samme koden i parallell. Samtidig så kjøres denne koden her. Den har altså noen fellesdata, men den har også noen data", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0006", "start": 1170.0, "end": 1357.14, "token_count": 582, "text": "For én prosess vil dette bare være én tråd som følges. Hele tiden vet man nøyaktig hvilken institusjon prosessen utfører. Det er denne rekken av institusjoner som vi kaller en tråd. Så kommer den nye når vi snakker om begrepet tråder, og det er at man innenfor den samme prosessen har flere tråder.  Man utfører den samme koden i parallell. Samtidig så kjøres denne koden her. Den har altså noen fellesdata, men den har også noen data som er spesielle for hver tråd. PCB, f.eks. Det er registerverdier for trådene. De er forskjellige. Så man har da... Når man har flere tråder i... Inni en prosess har man flere utførelser av det samme programmet. Og det er det jeg prøver å lage en analogi om. Jeg tror det var denne analogien som inspirerte meg til å lage vafler og forelese samtidig. Og det er et bilde av hva tråden er. Vi har en prosess som er at en kokk lager én porsjon middag i et kjøkken. Da er CPU-en selve kokken. Hjernen min, hvis jeg er kokken. Så har man masse ressurser, som et kjøkken med kniver og føll og matvarer. Og eksplisitt oppskriften. Som er den oppskriften på den porsjonen med middag som kokken skal lage. Tråden er den sammenhengende serien av hendelser som skjer når kokken lager en porsjon. Når jeg lagde vafler, så var det å følge oppskriften punkt for punkt. Tråden var den veien jeg fulgte oppskriften. Jeg skulle sjekke om noe var nok pisket, og da er det avhengig av andre forhold hvor tråden hopper. Det kan være input fra brukere, det kan komme noen inn på kjøkkenet... Tråden kan endre seg. Og når den porsjonen med mat er ferdig, da er den prosessen avsluttet. Men man kan gjøre dette på forskjellige måter, spesielt hvis man... Hvis man ønsker å lage vafler eller... Lage en rett fortere... Ønsker du å lage to retter...", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0007", "start": 1319.54, "end": 1491.14, "token_count": 582, "text": "og da er det avhengig av andre forhold hvor tråden hopper. Det kan være input fra brukere, det kan komme noen inn på kjøkkenet... Tråden kan endre seg. Og når den porsjonen med mat er ferdig, da er den prosessen avsluttet. Men man kan gjøre dette på forskjellige måter, spesielt hvis man... Hvis man ønsker å lage vafler eller... Lage en rett fortere... Ønsker du å lage to retter... Da er det to måter man kan gjøre det på. Enten kan man ha to uavhengige prosesser. Det er sånn vi har sett på prosesser helt til nå. Uten tråder. Da har vi to helt uavhengige prosesser som jobber hver for seg. Det tilsvarer i kokkeanalogien... Vi har to kjøkken, men så har vi fortsatt bare én CPU. Vi gjør en multitasking ved at kokken løper fram og tilbake mellom de to kjøkkenene. Så lager den én porsjon i hvert kjøkken. Så har du en oppskrift i hvert kjøkken, og så følges den oppskriften. Det er sånn som vi har gjort med multitasking. Da har vi kanskje gitt 100 sekunder. Da kan de to rettene vi har laget, være to rene jobber. De gjør jo samme jobben, men Superhund løper langt tilbake mellom kjøkkenet og lager mat. Så kommer den nye, store måten å gjøre dette på, og det er med treds. Det koster litt mye å ha to hele kjøkken, og så skal denne kokken løpe fram og tilbake... Det er jo akkurat den samme koden som utføres. Hvorfor kan vi ikke reise oss da? To tråder... Og da forenkles dette med at vi har bare ett kjøkken, og så bytter kokken på å jobbe med de to porsjonene. Da kan kokken lage to porsjoner fra samme oppskrift. I mitt tilfelle med vafler kunne jeg hatt den samme vaffeloppskriften. Men så kunne jeg kanskje hatt to forskjellige boller. Og så kunne jeg hente egg fra det samme... Fra det samme eggbrettet, og melk som melkemann kommer...", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0008", "start": 1456.24, "end": 1643.12, "token_count": 589, "text": "Og da forenkles dette med at vi har bare ett kjøkken, og så bytter kokken på å jobbe med de to porsjonene. Da kan kokken lage to porsjoner fra samme oppskrift. I mitt tilfelle med vafler kunne jeg hatt den samme vaffeloppskriften. Men så kunne jeg kanskje hatt to forskjellige boller. Og så kunne jeg hente egg fra det samme... Fra det samme eggbrettet, og melk som melkemann kommer... Det kunne jeg bruke på begge porsjonene. Men så kunne jeg da... Ha en del ting som har felles. F.eks. oppskriften vil være den samme. Da vil det være kjøpere for meg å hoppe fra den ene til den andre enn om jeg måtte gå ut av kjøkkenet, inn på et annet kjøkken, og så fortsette med en vaffeloppskrift på det kjøkkenet. En prosess er ganske tung å starte opp. Den har en masse ressurser. Da benytter man de ressursene bedre. I den tradisjonelle prosessen er det kun én kokk som jobber i et kjøkken av gangen. Da kan det være samme kokken som hopper fram og tilbake. Men vi har også sett på SMP at vi kan ha én kokk i hvert kjøkken. Men SMP, det er ikke tråder. Da har man i utgangspunktet to helt forskjellige prosesser, og så er det bare én CPU som jobber med hver sin prosess. Da er det fortsatt én tråd i hver prosess. Men med to år så kan man da ha flere kokker inne i hvert kjøkken. Man kan ha flere tråder i hver prosess. Da kan man ha flere CPU-er som jobber innenfor den samme prosessen. Og kjører den samme koden. F.eks. kan gjøre regneoppgaver i paralleller. Vi hadde et eksempel hvor vi skulle regne summen fra 1 til 2000. Og så kunne en annen tråd som rev ut summen fra 1000 til 2000, gjøre dette til parallell. Og når de skreduleres som to uavhengige enheter, så da kunne faktisk den ene tråden kunne kjørt på SMPU, og den andre på NAH, og faktisk i parallell kjøre helt samtidig.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0009", "start": 1597.42, "end": 1781.4, "token_count": 597, "text": "Og kjører den samme koden. F.eks. kan gjøre regneoppgaver i paralleller. Vi hadde et eksempel hvor vi skulle regne summen fra 1 til 2000. Og så kunne en annen tråd som rev ut summen fra 1000 til 2000, gjøre dette til parallell. Og når de skreduleres som to uavhengige enheter, så da kunne faktisk den ene tråden kunne kjørt på SMPU, og den andre på NAH, og faktisk i parallell kjøre helt samtidig. Ja, så... Det var en intro om tråder. Det finnes noen forskjellige definisjoner av tråder. Den som jeg har brukt her, er på sammenheng i rekken av helser, institusjoner som utføres når et program kjøres. Og den neste er tråden som følges når et program utføres. Når det hopper fra institusjon til institusjon. Det er på en måte det vi har prøvd å lage et bilde av hele veien. Det er også brukt om tråder, men det er kanskje litt mer upresist fordi... Fordi en tråd ikke inneholder alle de begrepene som en prosess har. Så man kan ha flere tråder innenfor samme prosess. Noe som er veldig viktig, er at det er programmereren som vet hva som skal gjøres. Det så vi på tidligere... Hvis vi hadde en kopilert versjon av en regneprosess som summerer fra 1 til 2000, så er det umulig for operativsystemet å vite at... ... her kan jeg gjøre så smart. Jeg kan la én CPU legge seg sammen fra 1000 til 2000, og så kan jeg la en annen CPU legge seg sammen Det er det umulig for operativsystemet å forstå. Operativsystemet ser bare enkeltinstitusjonene i programmet. Så det er helt opp til programmereren å gjøre den type vurderinger og tenke sånn at dette kan parallelliseres. Ok, her går jeg inn med to tråder. Så sånn som JA-tråder og Petreds trådbiblioteket det legger til rette for at programmereren Kan styre hele prosessen sånn at flere uavhengige tråder jobber samtidig med oppgavene som skal gjøres. Programmereren kan også fordele arbeidsoppgaver mellom troene.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0010", "start": 1743.74, "end": 1933.86, "token_count": 595, "text": "Så det er helt opp til programmereren å gjøre den type vurderinger og tenke sånn at dette kan parallelliseres. Ok, her går jeg inn med to tråder. Så sånn som JA-tråder og Petreds trådbiblioteket det legger til rette for at programmereren Kan styre hele prosessen sånn at flere uavhengige tråder jobber samtidig med oppgavene som skal gjøres. Programmereren kan også fordele arbeidsoppgaver mellom troene. Men så overlater programmereren til operativsystemet å skredulere troene. Standard er at trådene skreduleres uavhengig av hverandre. Dette er det første bildet vi begynte med med en singeltreddert prosess, som er sånn vi har sett det til nå. Én tråd følges, og hvis vi bare har én CPU hver, så vil en CPU-en følge denne tråden. Med multitreddert prosess så ser vi at vi har tre samtidige trådere. Hvis man har et system med tre CPU-er eller flere, så vil typisk operativstema skruddelere dette, sånn at disse trådene jobber på hver sin CPU og kan jobbe reelt samtidig. Men hvis denne prosessen kjører på én enkel CPU, som kjører TaskSet f.eks., tvinger den til å være på samme CPU, så vil operativstema skruddelere disse trådene helt uavhengig. Så dette ble helt tilsvarende som om man multitasker med flere prosesser. Men i tilfelle med tråder så sparer man en del ressurser, for man har felles data, felles kode, og så går det raskere å switche mellom tråder enn mellom prosesser. Og her er en oppsummering av fordelene med Teretz. Som vi har nevnt mange ganger, så er det ressursdeling. Man trenger ikke å duplisere koden mellom hver prosess. Hvis jeg kjører 100 rene jobber og starter med et dotter-r, så vil det være 100 kopier av denne koden og av dataene. Men hvis man har flere tråder innenfor samme prosess, så kan man kjøre på samme. Og lagre i de samme dataene. Respons er en viktig fordel. F.eks. hvis du har et program som står og regner og kverner på et eller annet,", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0011", "start": 1890.98, "end": 2065.64, "token_count": 591, "text": "Man trenger ikke å duplisere koden mellom hver prosess. Hvis jeg kjører 100 rene jobber og starter med et dotter-r, så vil det være 100 kopier av denne koden og av dataene. Men hvis man har flere tråder innenfor samme prosess, så kan man kjøre på samme. Og lagre i de samme dataene. Respons er en viktig fordel. F.eks. hvis du har et program som står og regner og kverner på et eller annet, og så skal gi tilbakemelding, så... Så vil det være veldig kjedelig hvis du da må vente på at utregningen skal bli ferdig, Hvis man da har én tråd som regner... Den kunne til og med nices, altså ligge pent i bakgrunnen og jobbe. Og så kunne man ha en annen tråd som svarer på henvendelser. Og da får du veldig god respons for den applikasjonen. Effektivitet - jeg nevnte så vidt at det går mye raskere å switche mellom enn å switche mellom to prosesser. En hel context switch kan ta fem ganger så lang tid som å switche mellom tråder. Så tar det lengre tid å starte prosesser også. Rett og slett fordi det er tyngre med mer ressurser og mer som skal settes opp. Multiprosessor-gangenett er opplagt veldig niktig. Hver tråd kan tildeles en egen SIPU. Så hvis du har en selv om du har ført den opp til SIPU, så kan du da... Jobbe 48 ganger så raskt hvis prosessen din er mulig å paradenisere. Felles variabler... Det er ikke så lett å sette opp mellom prosesser. Det går an, men det kan være ganske tungvint. Altså felles deler av ramm som to forskjellige prosesser snakker til. Men med tre år så er det trivielt å sette opp. Java-tråder. Jeg tror ikke jeg rekker å se så veldig mye på det i praksis nå. Men det er veldig rett fram, og der er et par av oppgavene denne uken som går ut på å komplere en Java-regnejobb og så kjøre den med flere tråder. Men det er noen sånne... Ja, når man lager Java-dretts, som vi skal se på nå, så må man arve klassen.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0012", "start": 2026.48, "end": 2259.56, "token_count": 594, "text": "Men med tre år så er det trivielt å sette opp. Java-tråder. Jeg tror ikke jeg rekker å se så veldig mye på det i praksis nå. Men det er veldig rett fram, og der er et par av oppgavene denne uken som går ut på å komplere en Java-regnejobb og så kjøre den med flere tråder. Men det er noen sånne... Ja, når man lager Java-dretts, som vi skal se på nå, så må man arve klassen. Da får man noen tredje metoder. Den første er start... Som liksom setter av plass for alt på stack osv. Men den begynner ikke å kjøre tråden. Det er først når startmetoden nesten er ferdig, så kaller den rund. Som da setter i gang tråden til å jobbe med første institusjon. Så har vi også en metode som heter gi opp. Det er ikke så vanlig å gjøre. Stort sett overlater man til operativsystemet å skredulere. Det er sjelden et poeng at tråden gir fra seg CPU-en på den måten. Prioritet kan man sette for tråder. Det skal vi se på senere i neste uke. Skrutinering... JVM måtte da skredulere tronene selv. Det var egentlig et ganske rart opplegg. Da måtte man bruke yield osv. for å gi fra seg CPU-en. Men da overlot man på en måte alt til brukeren. Så det som er standard, er native trends. Da vil Java-tronene skreduleres av å protestere. Da kan vi sette i gang ti... Så forventer du at operativsystemet skredulerer mellom dem. Hvis du har ti CPU-er, så får du en CPU hver. Hvis ikke, så multitasker operativsystemet. I Javar-tellemaskinen er det ikke helt spesifisert hvordan prioritet skal implementeres. Her vil du se noen store forskjeller mellom Linux og Windows. Det er et AT-eksempel på at... Java er ikke helt plattformuordninger. Ja... På Linux-vemmene skal dere kunne installere JDK og kompilere Java-filler med Java C, kalt et Java, og så kjøre med Java Talk. Og jeg tror... Jeg har ikke sjekket hvilke nasjoner du får... Men det kan dere sjekke ut og isolere defoldt JTK. Helt til slutt... Det er én ting som er viktig å være klar over", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0013", "start": 2213.6, "end": 2471.86, "token_count": 600, "text": "Det er et AT-eksempel på at... Java er ikke helt plattformuordninger. Ja... På Linux-vemmene skal dere kunne installere JDK og kompilere Java-filler med Java C, kalt et Java, og så kjøre med Java Talk. Og jeg tror... Jeg har ikke sjekket hvilke nasjoner du får... Men det kan dere sjekke ut og isolere defoldt JTK. Helt til slutt... Det er én ting som er viktig å være klar over for variabler i Java-trådet. Hvis man definerer en tråd, en variabel som static... Static in count... Så vil den variabelen være felles for alle tråder. Så da har man en fellesvariabel. Hvis man ikke evakuerer den som static, bare som int id, så vil denne eksistere i hver tråd. Det ser omtrent ut som dette her. Vi har nå én java-prosess som inneholder to tråder. ID vil være en egen variabel for hver tråd som du starter. Da kan man gi tråder av ID like én i den første tråden og like to i den andre tråden. Men den felles variabelen som ble deklarert som static, collective, den kan brukes til å telle opp antall tråder. Man kan ha en løkke og starte tråden, og så kommer colten igjen. Bære de trådene. Ok... Jeg tenker vi... Vi stopper der. Vi kan bare veldig kjapt vise... Hva oppgavene går ut på. Sånn. Oppgaven her går ut på å bare ta en kopi av dette programmet her. Et Java-program med et trådeksempel. Og så kompilere og kjøre dette programmet, og så... Det er egentlig som at man ser hva som foregår der, er å kompilere og kjøre, og så se på koden hva som foregår. Hovedideen er at vi har en tellerkont som teller opp fra 0, 1, 2 og oppover. Den variabelen her vil da være lokal for hver tråd. Hver tråd vil ha sin egen id, men count vil være felles. Så når vi da... Her nede... Her er på en måte main hvor du starter to tråder. Så først lager en tråd S. Så starter den seg. Og så startes det. Når den starter, så utfører den utføreren. Så sier den tråd nummer ID is started.", "source": "lecture"}
{"lecture_id": "os10time2", "chunk_id": "os10time2_0014", "start": 2416.14, "end": 2560.0, "token_count": 395, "text": "Hovedideen er at vi har en tellerkont som teller opp fra 0, 1, 2 og oppover. Den variabelen her vil da være lokal for hver tråd. Hver tråd vil ha sin egen id, men count vil være felles. Så når vi da... Her nede... Her er på en måte main hvor du starter to tråder. Så først lager en tråd S. Så starter den seg. Og så startes det. Når den starter, så utfører den utføreren. Så sier den tråd nummer ID is started. Det aller første som skjer når det starter, det er dette her. Da ser vi colt. Den felles havnen økes med én. Så først blir colt lik én. Så ID settes lik 1. I den første tråden lar ID være lik 1, og i neste tråd vil den være lik 2. På den måten har du startet av to tråder, og så gjør det et arbeid, og arbeidet består av å stå her og regne. Og da vil du kunne se hvordan de kjører på hver sin CPU. Men det kan vi se på mer neste gang. La oss se... Oi, jeg har gått langt inn. Dere trenger sikkert en pause, så... Da stopper vi der. Og så kan dere jobbe mer med lov og tro i oppgavene. Ok, Ine? Hallo? Der var det noen spørsmål i... Som du har fått i chatten, som vi burde ta opp? Nei, jeg har ikke tatt noen. Ikke noen private meldinger i chatten? Nei, ikke nå.", "source": "lecture"}
