{"lecture_id": "os10del8", "chunk_id": "os10del8_0000", "start": 0.0, "end": 215.18, "token_count": 594, "text": "Tråder er en måte å findele prosesseringen av en prosess på. Tidligere har vi sett på prosesser som bare har én tråd. Alle prosesser har en tråd, og tråden er på en måte den veien gjennom et program, eller den veien som følges når man utfører et program. Jeg har en litt senere sløyd her som viser disse trådene. Det er sånn man tenker seg en tråd. At det er veien som man snor seg gjennom når man kjører kode. Her er det en sånn tradisjonell... Da... Når vi er oppe i data her, så kanskje vi har en kommando som lagrer noe til data. Og så gjør den noen instruksjoner. Og så hopper den frem og tilbake. Den følger en tråd gjennom kode og data. Men for en prosess vil dette bare være én tråd som følges. Hele tiden vet man nøyaktig. Hvilken institusjon prosessen utfører. Det er denne rekken av institusjoner som vi kaller en tråd. Så kommer den nye når vi snakker om begrepet tråder. Det er at man innenfor den samme prosessen har flere tråder. Man utfører den samme koden i parallell. Samtidig så kjøres denne koden her. Men den har også noen data som er spesielle for hver tråd. PCB, f.eks. Det er registerverdier for trådene. De er forskjellige. Så man har da... Når man har flere tråder inni en prosess, så har man flere utførelser av det samme programmet. Lage en analogi om. Det var denne analogien som inspirerte meg til å lage vafler og forelese samtidig. Og det er et bilde av bateråret som tar utgangspunkt i at vi har en prosess som er at en kokk lager én porsjon middag i et kjøkken. Det er litt som selve kokken. Hjernen min - hvis jeg er kokken. Og så har man masse ressurser, som et kjøkken med kniver og fjøl og matvarer. Og eksplisitt oppskriften. Som er den oppskriften på den porsjonen med middag som kokken skal lage. Serien av hendelser som skjer når kokken lager en porsjon.", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0001", "start": 163.0, "end": 355.94, "token_count": 593, "text": "Og det er et bilde av bateråret som tar utgangspunkt i at vi har en prosess som er at en kokk lager én porsjon middag i et kjøkken. Det er litt som selve kokken. Hjernen min - hvis jeg er kokken. Og så har man masse ressurser, som et kjøkken med kniver og fjøl og matvarer. Og eksplisitt oppskriften. Som er den oppskriften på den porsjonen med middag som kokken skal lage. Serien av hendelser som skjer når kokken lager en porsjon. Da jeg lagde vafler, var det å følge oppskriften punkt for punkt. Tråden går den veien jeg fulgte oppskriften. Den tråden kan hoppe rundt. I tilfelle skulle jeg sjekke om noe er nok pisket. Da er det avhengig av andre forhold hvor den tråden hopper. Tråden kan endre seg. Når den porsjonen med mat er ferdig, da er den prosessen avsluttet. Men man kan gjøre dette på forskjellige måter. Spesielt hvis man ønsker å lage vafler eller... Lage en rett fortere. Jeg skulle laget to retter. Enten kan man ha to uavhengige prosesser... Det er sånn vi har sett på prosesser helt til nå, uten tråder. Da har vi to uavhengige prosesser som jobber hver for seg. Det tilsvarer i kokkeanalogien at vi har to kjøkken. Men så har vi fortsatt bare én CPU. Så vi gjør en multitasking Den lager én porsjon i hvert kjøkken. Så har du en oppskrift i hvert kjøkken, og så følges den oppskriften. Det er sånn som vi har gjort med multitasking. Da har vi kanskje gitt 100 sekunder til sepunien i én prosess, og så 100 sekunder til sepunien i en annen prosess. Da kan de to rettene vi har laget, være den samme. De gjør jo samme jobben, men Superhunden løper mellom kjøkkenet og lager mat. Så kommer den nye måten å gjøre dette på, og det er med treds. Da tenker vi... Ok, det koster litt mye å ha to hele kjøkken og så skal denne kokken løpe fram og tilbake.", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0002", "start": 314.64, "end": 486.5, "token_count": 595, "text": "Da har vi kanskje gitt 100 sekunder til sepunien i én prosess, og så 100 sekunder til sepunien i en annen prosess. Da kan de to rettene vi har laget, være den samme. De gjør jo samme jobben, men Superhunden løper mellom kjøkkenet og lager mat. Så kommer den nye måten å gjøre dette på, og det er med treds. Da tenker vi... Ok, det koster litt mye å ha to hele kjøkken og så skal denne kokken løpe fram og tilbake. For det er så veldig mye som er likt, f.eks. Med sånn regnejobb... Den samme koden som utføres. Hvorfor kan den ikke da... Hvorfor kan den ikke reise? Den har to-tre år. Og da forenkles dette med at vi har bare ett kjøkken, og så bytter kokken på å jobbe med de to porsjonene. Og da kan den kokken f.eks. lage to porsjoner fra samme oppskrift. Så i mitt tilfelle med vafler, så finner jeg da at den samme vaffeloppskriften... Men så kunne jeg kanskje hatt to forskjellige boller. Og så kunne jeg hente egg fra det samme... Fra det samme eggbrettet. Og melk som melkemann kommer med. Det kunne jeg bruke på begge porsjonene. Men så kunne jeg da... Ha en del ting som har felles. F.eks. oppskriften vil være akkurat den samme. Enn om jeg måtte gå ut av kjøkkenet, inn på et annet kjøkken, og så fortsette med en vaffeloppskrift på det kjøkkenet. Så det er det som er prinsippet. En prosess er ganske tung å særte opp. Den har en masse ressurser, så med tråder så utnytter man de ressursene bedre. Jobber i et kjøkken av gangen. Da kan det være samme kokken som løper fram og tilbake. Men vi har også sett på SMP at vi kan ha én kokk i hvert kjøkken. Ellers kan kokken hoppe fram og tilbake og multitaske. Men SMP, det er ikke tråder. Da har man i utgangspunktet to forskjellige prosesser. Og så er det bare én CPU som jobber med hver sin prosess.", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0003", "start": 435.4, "end": 610.74, "token_count": 591, "text": "Den har en masse ressurser, så med tråder så utnytter man de ressursene bedre. Jobber i et kjøkken av gangen. Da kan det være samme kokken som løper fram og tilbake. Men vi har også sett på SMP at vi kan ha én kokk i hvert kjøkken. Ellers kan kokken hoppe fram og tilbake og multitaske. Men SMP, det er ikke tråder. Da har man i utgangspunktet to forskjellige prosesser. Og så er det bare én CPU som jobber med hver sin prosess. Da er det fortsatt én tråd i hver prosess. Men med tråder så kan man da ha flere kokker inne i hvert kjøkken. Og tilsvarende - man kan ha flere tråder i hver prosess. Og da kan man ha... Da kan man ha flere CPU-er som jobber innenfor den samme prosessen. Vi kjører den samme koden. For eksempel kan en gjøre regneoppgaver i parallell. Vi hadde et eksempel med at vi skulle regne ut summen fra 1000 til 2000. I dette tilfellet kunne du ha en tråd som regnet ut summen fra 1000 til 1000, og så kunne du ha en annen tråd som regnet ut summen fra 1000 til 2000. Gjorde dette i parallell. Og når det skeduleres en sånn prosess, så skreduleres det som to uavhengige enheter. Da kunne faktisk den ene tråden kjøre på en SPU, og den andre på en A. Og faktisk i parallell kjøre helt samtidig. Ja, så... Det var en intro om tråder. Det finnes noen forskjellige definisjoner av tråder. Den som jeg har brukt her... Sammenhengen, rekken av helser, institusjoner som utføres når et program kjøres. Og den neste er tråden som følges når programmet utføres. Når det hopper fra institusjon til institusjon. Det er det vi har prøvd å lage et bilde av hele veien. Lettvektsprosess er også brukt om tråder. Men det er kanskje litt mer uprosist fordi... fordi en tråd ikke inneholder alle de begrepene som en prosess har. Så man kan ha flere tråder innenfor samme prosess.", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0004", "start": 577.04, "end": 759.38, "token_count": 596, "text": "Og den neste er tråden som følges når programmet utføres. Når det hopper fra institusjon til institusjon. Det er det vi har prøvd å lage et bilde av hele veien. Lettvektsprosess er også brukt om tråder. Men det er kanskje litt mer uprosist fordi... fordi en tråd ikke inneholder alle de begrepene som en prosess har. Så man kan ha flere tråder innenfor samme prosess. Noe som er veldig viktig, er at det er programmereren som vet hva som skrives i programmet, og ikke operativsystemet. Det så vi på tidligere, at hvis vi hadde en adoptatkopiert versjon som summerer fra 1 til 2000, så er det umulig for operativsystemet å vite at... Oi, her kan jeg gjøre så smart. Jeg kan la én CPU legge seg sammen fra 1000 til 1000, og så kan jeg la en annen CPU legge seg sammen fra 1000 til 2000. Det er det umulig for operativsystemet å forstå. For operativsystemet ser bare enkeltinstitusjonene i programmet. Så det er helt opp til programmereren og... Gjøre den type vurderinger og tenke at dette kan parallelliseres. Ok, her går jeg inn med to tråder. Sånn som JA-tråder og Petreds trådbiblioteket... Det legger til rette for at programmereren kan styre hele prosessen, sånn at flere uavhengige tråder jobber samtidig med oppgavene som skal gjøres. Fordele arbeidsoppgaver mellom troene. Men så overlater programmereren til operativsystemet å skredulere troene. Standard er at troene skreduleres uavhengig av hverandre. Det skal vi se på litt i praksis etter hvert. Dette er det første bildet vi begynte med, med en singeltreddert prosess. Én tråd følges, og hvis vi bare har én CPU her, så vil den CPU-en følge denne tråden. Med multitreddingsprosess så ser vi at vi har tre samtidige tråder. Og da kan det være sånn at hvis man har et system med tre CPU-er eller flere, så vil typisk at et system med screedileyer dette her, Og kan jobbe reelt samtidig. Men hvis denne prosessen kjører på én enkel SPU...", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0005", "start": 711.78, "end": 893.08, "token_count": 590, "text": "Dette er det første bildet vi begynte med, med en singeltreddert prosess. Én tråd følges, og hvis vi bare har én CPU her, så vil den CPU-en følge denne tråden. Med multitreddingsprosess så ser vi at vi har tre samtidige tråder. Og da kan det være sånn at hvis man har et system med tre CPU-er eller flere, så vil typisk at et system med screedileyer dette her, Og kan jobbe reelt samtidig. Men hvis denne prosessen kjører på én enkel SPU... Hvis vi kjører task-sett og tvinger den til å være på samme SPU... Så vil operativstønaden skruddelegge disse trådene helt uavhengig. Men da ville man multitaske mellom trådene. Så dette ble helt tilsvarende som om man multitasker med flere prosesser. Men i tilfelle med tråder så sparer man en del ressurser. Man har felles data, felles kode, og så går det raskere å switche mellom tråder enn mellom prosesser. Her er en oppsummering av fordelene med Tourettes. For det første, som vi har nevnt mange ganger, så er det ressursdeling. Man trenger ikke å duplisere koden mellom hver prosess. Hvis jeg kjører 100 regnejobber og starter med.1, så vil det være 100 kopier av denne koden og av dataene. Men i tråder så... Hvis man har flere tråder innenfor samme prosess, så kan man kjøre på samme kode og lagre i de samme dataene. Respons er en viktig fordel. F.eks. hvis du har et program som står og regner og kverner på et eller annet, og så skal gi tilbakemelding, så... Så vil det være veldig kjedelig hvis du da må vente på at utregningen skal bli ferdig, før programmet gir respons. Og hvis man da har én tråd som regner... Den kunne til og med nices. Og så kunne jeg ha en annen tråd som svarer på henvendelser. Og da får du veldig god respons for den applikasjonen. Effektivitet - jeg nevnte så vidt at det går mye raskere å switche mellom to tråder enn å switche mellom to prosesser.", "source": "lecture"}
{"lecture_id": "os10del8", "chunk_id": "os10del8_0006", "start": 857.22, "end": 943.6, "token_count": 314, "text": "før programmet gir respons. Og hvis man da har én tråd som regner... Den kunne til og med nices. Og så kunne jeg ha en annen tråd som svarer på henvendelser. Og da får du veldig god respons for den applikasjonen. Effektivitet - jeg nevnte så vidt at det går mye raskere å switche mellom to tråder enn å switche mellom to prosesser. Altså en hel context-switch kan ta fem ganger så lang tid som å switche mellom tråder. Så tar det lengre tid å starte prosesser også. Rett og slett fordi det er tyngre. Det er mer ressurser og mer som skal settes opp. Multiprosessor og -nett, det er opplagt at du hver tråd kan tilhøres en egen CPU. Så hvis du har en cellebrød med 48 CPU, så kan du da jobbe 48 ganger raskt hvis prosessen din er mulig å parademisere. Det er ikke så lett å sette opp mellom prosesser, det går an, men det kan være ganske tungvint. Altså felles deler av ramm, som to forskjellige prosesser snakker til. Men etter et år så er det trivielt å sette opp.", "source": "lecture"}
