{"lecture_id": "os10del6", "chunk_id": "os10del6_0000", "start": 0.0, "end": 225.88, "token_count": 584, "text": "Da kan vi se litt på... resultatene. Den første er Adopt-alt, komplert med GCC. Skal vi se... Da må vi prøve å huske hva som egentlig skjedde her. Jo, Adopt-alt... Den kjørte i hvert fall på den AMD med AMD-opptråd. Alt synes. Jo, Adopt-Alt her... På Arm så kjører ikke Adopt-Alt. Og det er rett og slett fordi det er Arm-instruksjoner som ligger i bunnen. Så den CPU-en forstår ikke hvilke instruksjoner som ligger i Adopt-Alt når den er kompilert for en Exo86-prosessor. Så den er ikke riktig. På Windows-server kan du si at den både kjørte og ikke kjørte. I utgangspunktet så kjører den ikke. Men når du da kjører en ekte Linux-kjørne på Windows, så kjør den. På Mac så kjørte den heller ikke, det er en del som har svart at den kjørte der. Til tross for at det er en del leacuper, Adolf kjører ikke fordi den prøver å snakke med Linux-kjørnen, og så treffer den MacOS. Så det er bare den her, som de aller fleste svarte, som er riktig. Ja, den... Hello... Her har de fleste fått med seg hva som skjedde. På eldre Java-versjoner så kjørte ikke den Helado-plass. Men den kjørte bare her, som 90 % har sagt, på Linux i bunntur på ARM. Python... Ja, det vi har sett, så kjørte vel Python egentlig overalt. I hvert fall når vi ikke tok med dem... Når vi hadde med parenteser, som på en måte var plattformuavhengig. Da... Eller Python-versjoner er bra, men Python kjørte overalt. Det samme kan man vel egentlig si at LOD-bæsj gjorde. Det kjørte på Mac, og det kjørte nesten selvfølgelig på disse Linux-punktene. Her igjen så er det både ja og nei. Jeg har tatt på en standard Windows-server, så kjører ikke et Bæsj her. Men hvis du installerer Linux subsystem... Så kjører... Så installerer du også bæsj, og da kan du få bæsjskrittet til å kjøre. Men det... Ja, det er på en måte litt...", "source": "lecture"}
{"lecture_id": "os10del6", "chunk_id": "os10del6_0001", "start": 180.0, "end": 243.0, "token_count": 185, "text": "Det samme kan man vel egentlig si at LOD-bæsj gjorde. Det kjørte på Mac, og det kjørte nesten selvfølgelig på disse Linux-punktene. Her igjen så er det både ja og nei. Jeg har tatt på en standard Windows-server, så kjører ikke et Bæsj her. Men hvis du installerer Linux subsystem... Så kjører... Så installerer du også bæsj, og da kan du få bæsjskrittet til å kjøre. Men det... Ja, det er på en måte litt... Litt juks, for da installerer du en ny plattform. Eller juks... Man må ta med det i beregningen. Men defolt vil verken et skjellskrift eller Adopt... Kjøre på vinduene.", "source": "lecture"}
