{"lecture_id": "os10del9", "chunk_id": "os10del9_0000", "start": 0.0, "end": 215.08, "token_count": 596, "text": "Så... Jeg skal begynne å se på Java-tråder. Tror ikke jeg rekker å se så veldig mye på det i praksis nå. Men det er veldig rett fram. Og det er et par oppgaver denne uken som går på å komplere en Java-regnejobb, og så kjøre den med flere tråder. Men det er noen sånne... Når man lager ja-adretts, som vi skal se på nå, så må man arve klassen til rett. Da får man noen tredje metoder. Den første er start, som liksom setter av plass for alt. På stack osv. Men den begynner ikke å kjøre tråden. Det er først når startmetoden nesten er ferdig, så kaller den rund. Som da setter i gang tråden til å jobbe med første institusjon. Så har vi en metode som heter GIO. Gi fra seg CPU-en. Det er ikke så vanlig å gjøre, for stort sett overlater man til operativsystemet man skal drivere, så at... Det er sjelden et poeng at tråden gir fra seg CPU-en på den måten. Prioritet kan man sette på tråden. Det skal vi se på senere i neste uke. Skrudderløsning... Der. Javar ble betraktet av OUS som bare én prosess. Og JVM måtte da skridulere til rådene selv. Og det var egentlig et ganske rart opplegg. For da måtte man bruke HIL og så videre for å gi fra seg SPU. Men da overlot man på en måte alt til brukeren. Så det som er standard, er native trends. Da vil Javar-trådene skriduleres av. Da kan vi sette i gang ti tråder, og så forventer du at operativsystemet skredulerer mellom dem. Hvis du har ti CPU-er, så får du en CPU hver. Hvis ikke, så multitasker operativsystemet. Jeg har hørt hele maskinen, så er det ikke helt nøyaktig spesifisert hvordan prioritet skal implementeres. Her vil du se noen store forskjeller mellom Linux. Det er et AT-eksempel på at Java ikke er helt plattformuavhengig. På Linux-hjemmene så skal dere kunne installere JDK og kompilere Java-filer med java.calt.java, og så kjøre med Java-talk. Jeg har ikke sjekket hvilke nasjoner du får...", "source": "lecture"}
{"lecture_id": "os10del9", "chunk_id": "os10del9_0001", "start": 160.28, "end": 308.24, "token_count": 398, "text": "så får du en CPU hver. Hvis ikke, så multitasker operativsystemet. Jeg har hørt hele maskinen, så er det ikke helt nøyaktig spesifisert hvordan prioritet skal implementeres. Her vil du se noen store forskjeller mellom Linux. Det er et AT-eksempel på at Java ikke er helt plattformuavhengig. På Linux-hjemmene så skal dere kunne installere JDK og kompilere Java-filer med java.calt.java, og så kjøre med Java-talk. Jeg har ikke sjekket hvilke nasjoner du får... Men det kan dere sjekke ut. Hva Isalem default jobber på. Rett til slutt... Det er én ting som er viktig å være klar over for variabler i Java-trådet. Og det er... Hvis man definerer en tråd, en variabel som static... Så vil den være den variabelen vi har felles for alle trådene. Så da har man en fellesvariabel. Hvis man ikke vedklarer den som static, bare som int id, så vil denne eksistere i hver tråd. Det ser omtrent ut som dette her. Vi har nå én java-prosess som inneholder på... Id vil være en egen variabel for hver tråd som du starter. Da kan man gi tråder av id like én i den første tråden og like to i den andre. Men den felles variabelen som ble deklarert som static kollektiv, den kan brukes til å telle opp antall tråder. For hver gang i løkka kommer konten igjen, og så skal man gi en ID til bære de trådene.", "source": "lecture"}
