{"lecture_id": "os11del10", "chunk_id": "os11del10_0000", "start": 0.0, "end": 190.44, "token_count": 588, "text": "Problemstillingen er at... Hvis man jobber med felles data, så må man serialisere. Hvis ikke, som vi skal se, så kan det gå veldig galt. Da kan man slåss om å bruke en felles variabel og ødelegge hele datagrunnlaget. Resultatene kan bli helt feil. Et enkelt eksempel på dette er... Hvis vi tenker oss at vi har en webside som skriver ut billetter... Og da er det ofte en database som holder på antallet billetter. Så det vil jo kanskje gjøre dette enda mer komplisert. Men da vil vi alltid tenke på at vi må ha en trådsikker database. Det er da en database som er serialisert, hvor dette er tatt hensyn til. Men vi kan også tenke oss at vi bare har én webserver, hvor det er to prosesser som står og kjører. Og begge må da ha tilgang til antall billetter. Ellers kan de ikke dele ut billetter i det hele tatt. Så i dette tilfellet tenker vi oss at vi har én variabel, ledigbilletter, som sier hvor mange ledige billetter som finnes. Så kan vi tenke at koden for webserveren er noe sånt som dette her. Hvis ledige billetter er større enn null, jo, da trekker vi fra ledigbilletten med én og skriver ut en billett. Og det ser jo enkelt og greit ut. Men vi kan da få et mulig problem. Det problemet er... Hva skjer hvis man er litt uheldig og Prosess1 står og kjører og sjekker at det er ledigbilletter? Den felles variabelen ledigbilletter, den er én. Men så vet vi at en sånn if-test, den utføres ikke i én instruksjon. Det er først en if. Først så vil det være en compare av ledigbilletter. Og se om den er større enn null. Og i dette tilfellet så vil dette slå til. Men før Prosess 1 har rukket å minske ledigbillett med én, så skjer det en Context-witch. Så hopper jeg over til Prosess 2, og så utfører den den samme. Den sjekker at ledigbilletter er større enn null. Og så ser vi... Så gjør... Så kommer den Context Switch-en tilbake. Ledig billett til minus-minus.", "source": "lecture"}
{"lecture_id": "os11del10", "chunk_id": "os11del10_0001", "start": 150.0, "end": 268.44, "token_count": 371, "text": "Og se om den er større enn null. Og i dette tilfellet så vil dette slå til. Men før Prosess 1 har rukket å minske ledigbillett med én, så skjer det en Context-witch. Så hopper jeg over til Prosess 2, og så utfører den den samme. Den sjekker at ledigbilletter er større enn null. Og så ser vi... Så gjør... Så kommer den Context Switch-en tilbake. Ledig billett til minus-minus. Og den blir ned i minus én, og så skriver den ut enda en billett. Og det er klart det er to stykker som har fått billetter. Og her er det noe som går helt galt. Så på denne måten kan man ikke ha det. Og man må sørge for at noe sånt som dette her ikke kan skje. I dette tilfellet så er det kanskje logisk å tenke seg at... Og lett å forestille seg at dette kan skje, siden det er flere kodeoperasjoner involvert. At man først sjekker LED-billetter, og så trekker man fra. Her er det en kontekstfetch. Det tilfellet man også har, er at P1 og P2 kjører på hver sin CPU. Og da vil det være enda mer problematisk, for da vil ikke de kunne sjekke seg imellom. Da vil de hente ned lederbilletter til sin CPU uten å sjekke om den andre da har gjort det. Så da er det enda vanskeligere å serialisere.", "source": "lecture"}
