{"lecture_id": "os11time1", "chunk_id": "os11time1_0000", "start": 0.0, "end": 179.98, "token_count": 596, "text": "Oppgavene denne uken... er ikke sånn veldig mange. Vi tar det litt forsiktig denne uken. Vi har kommet ganske langt i pensum, sånn at vi har råd til å ta det litt rolig nå før påske. Så det er ikke sånn veldig mange obligatoriske oppgaver. Noen litt teoretiske, og det er mer... Det kan være veldig nyttig å gjøre de også, sånn at du tenker igjennom hva det egentlig er vi holder på med. Disse kan man da også se løsningsforslag på. Men jeg anbefaler veldig ikke å gå rett på løsningsforslaget når du jobber med de oppgavene her. Prøv å komme opp med svar, og så sammenlign med løsningsforslaget. Det er absolutt å anbefale. Og så er det noen oppgaver etter hvert om det vi skal se på nå. I forelesningen prioritering Java og kjøring av Java-tråder. Og ikke minst så kommer det etter hvert en oppgave her med Java-tråder og synkronisering. Og vi skal se hvor viktig det er å synkronisere når du har en felles variabel. Men det er det som egentlig er hovedtemaet i dag. Spørsmål? Et par ukens nøtter. Ja. Om eksamen blir med karakter eller ikke, vet du om det er avklart ennå? Ja, kjempebra. Det har jeg fått avklaring på nå, at det blir med ATLF-karakterer. Så bra. Jeg kan legge ut en kunngjøring om det etterpå også, kanskje. Så alle får det med seg. Jeg bare glemte det. Så kjempefint. Det kommer et par dokkeroppgaver. Det er litt endring på planen her. Vi syns det passer fint å starte med Windows PowerShell etter påske. Så blir det i hvert fall to runder med PowerShell digitalt. Så kommer det litt om dokker og DokkerHub denne uken. Det blir en sånn påskespesial med bare litt innhold. En kvarter-halvtime innhold, så ikke så veldig mye. Og oppgaver til dette vil da komme etter påske. Men uansett, jeg kan prøve å kanskje få lagt ut dette om Windows og Poshell og oppgaver, sånn at de som ønsker å ligge litt foran, vi kan jobbe.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0001", "start": 137.88, "end": 316.22, "token_count": 585, "text": "Så blir det i hvert fall to runder med PowerShell digitalt. Så kommer det litt om dokker og DokkerHub denne uken. Det blir en sånn påskespesial med bare litt innhold. En kvarter-halvtime innhold, så ikke så veldig mye. Og oppgaver til dette vil da komme etter påske. Men uansett, jeg kan prøve å kanskje få lagt ut dette om Windows og Poshell og oppgaver, sånn at de som ønsker å ligge litt foran, vi kan jobbe. Og har lyst til å jobbe litt i påsken. De kan jobbe med jobb med det. Ok, andre spørsmål eller karakterer... Nei, eller karakterer! Kommentarer! Jeg har ikke fått noen hos meg, i hvert fall. Nei. Ok... Ja, oi... Og jeg hadde helt glemt å si at det er veldig hyggelig å se så mange av dere. Det er kjempebra. Vi har 75 stykker i chatten her nå. Veldig godt at dere står opp og jobber videre. Jeg skjønner at det kan være veldig tungt for mange av dere som sitter alene og jobber og ikke får besøke venner osv. Og ikke minst det jeg tror dere savner, er å kunne sitte sammen med andre studenter og samarbeide. Prøv gjerne, spesielt hvis dere jobber i gruppe, å få til litt jevnlig kontakt. Lag SOM-møter osv. Bruk screen når dere jobber med kommandolinje. Det er mulig å få til å samarbeide, også om dere sitter på hvert deres sett. Så prøv mest mulig å få til det. Hvor mange forsøk har vi på MC2? Dere har flere forsøk. I praksis så kan dere få... Ikke uvennlige forsøk, men dere kan få mange forsøk. Men... Og det er også derfor vi har lagt opp opplegget, sånn at man ikke bare kan få nye og nye forsøk hele tiden. For da er det mange som bare klikker i vei. Så tanken er at hvis du ikke får det til første gang, Så må du ta kontakt med en studentassistent, ikke minst... eller meg. Og så må du få diskutere... Finn ut hva det var du gjorde feil. Og kanskje hva må du jobbe litt mer med før du tar et nytt forsøk.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0002", "start": 284.3, "end": 463.02, "token_count": 599, "text": "Men... Og det er også derfor vi har lagt opp opplegget, sånn at man ikke bare kan få nye og nye forsøk hele tiden. For da er det mange som bare klikker i vei. Så tanken er at hvis du ikke får det til første gang, Så må du ta kontakt med en studentassistent, ikke minst... eller meg. Og så må du få diskutere... Finn ut hva det var du gjorde feil. Og kanskje hva må du jobbe litt mer med før du tar et nytt forsøk. Så jobb skikkelig med den responsen du får først, og så tar du et nytt forsøk. Men dette er ikke noen sånn straffedom. Det er først og fremst ment som et tilbud. Altså at dere skal få tilbakemeldinger på... Det er også viktig at MC2 er nok litt vanskeligere enn MC1. Og du kan også være litt uheldig. Det trekkes fra 30 spørsmål kanskje. Så du kan være litt uheldig og få noen som er spesielt vanskelig, som ikke er så lett å ta på ett minutt. Men fristen er, som det står her... Det blir vel litt vanskelig. 9. april, som er fristen for MC2. Så prøv absolutt å få gjort den denne uken, sånn at du får flere sjanser. Hvis dere ikke klarer den. Ok... Forrige gang så så vi på Plattformaget, aller først. Hva som skjedde når man flytter programmet rundt på plattformer. Hovedkonklusjonen er at programmer som er kopilert, sånn som C og C++, som kopieres til maskinkode, er helt plattformavhengig. Det betyr at de kan bare kjøre der på den plattformen de er kopilert. De fleste moderne språk, sånn som... Java og Python, CSharp også, de kjører virtuelle maskiner. Sånn at da komplerer man til en eller annen type bytekode. Og så kjøres det i en virtuell maskin. Det betyr at det er en virtuell maskin for hver plattform. Så da går det an i prinsippet å flytte kompliert kode fra en plattform til en annen. Men det kan ha litt avhengighet av versjoner, som vi så sist. Så begynte vi å se på tråder. Vi så litt teoretisk på tråder, men vi fikk ikke sett så veldig mye på det rent praktisk.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0003", "start": 434.58, "end": 639.26, "token_count": 589, "text": "Og så kjøres det i en virtuell maskin. Det betyr at det er en virtuell maskin for hver plattform. Så da går det an i prinsippet å flytte kompliert kode fra en plattform til en annen. Men det kan ha litt avhengighet av versjoner, som vi så sist. Så begynte vi å se på tråder. Vi så litt teoretisk på tråder, men vi fikk ikke sett så veldig mye på det rent praktisk. Så vi skal ta en kjapp rekapitulering av Java-tråder, og så se på spesielt mange samtidige tråder. Så vi kan starte med det. Det var eksempelet. Trådprogram implementert i Java, som implementerer en rekke tråder... Jeg tror jeg kjører noe sånt som 20 tråder i det eksempelet her. Det var noen oppgaver i forrige uke som gikk ut på at man skulle se på hvor mange tråder som kjøres av operativsystemet når man kjører to tråder. Og da var det overraskende nok veldig mange tråder. Borti 20 tråder. Og det var en masse sånne workertreads som operativsystemet setter opp. Oi! Eller som JVM starter opp, og som operativsystemet skredulerer. Så det er hjelpetråder som står klare til å gjøre alle slags forskjellige oppgaver. Det koster ikke så mye å ha disse ekstra trådene, så derfor er det veldig mange programmer, sånn som Java... Chrome og andre applikasjoner som kjører en rekke tråder. Det koster ganske lite for operativseiere å ha de trådene kjørende når de ikke bruker CPU. Men her er da et eksempel på... Et eksempel som kjører med mange tråder. Så vi kan gå ned til klassen Calcmanny her, som er main. Og det som skjer her, er at vi definerer en intreds som er 20. Så det vi skal gjøre, er å starte 20 uavhengige tråder. Og her så kalles... Er opprettet et nytt trådobjekt, med new. Så her opprettes en ny tråd.  Og så skriver jeg bare ut at vi starter... At vi starter 20.30. Og så går jeg inn i forløkket.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0004", "start": 591.08, "end": 793.1, "token_count": 588, "text": "Så vi kan gå ned til klassen Calcmanny her, som er main. Og det som skjer her, er at vi definerer en intreds som er 20. Så det vi skal gjøre, er å starte 20 uavhengige tråder. Og her så kalles... Er opprettet et nytt trådobjekt, med new. Så her opprettes en ny tråd.  Og så skriver jeg bare ut at vi starter... At vi starter 20.30. Og så går jeg inn i forløkket. Ja, og her starter jeg da tråd nummer null. A new caltred. Og så når collegue 1, så starter jeg tråd nummer 1, osv. Så bare skriver jeg ut at jeg starter tråd nummer 1. Og så kaller jeg på startmetoden for tråden. Så dette skjer da 20 ganger. Og hvis vi går opp her, så ser vi hva som skjer når calc3d kalles. Da... Når calc3d startes opp, så kjøres denne in-hit-metoden her. Count pluss pluss... Da er det viktig å huske at... Count er definert som static. Og det betyr at det finnes bare én av den for alle trådene. Vi har 20 tråder, men bare én enkelt count-variabel. Mens en variabel som ikke blir deklarert som static, sånn som int id... Den har vi da 20 stykker av. Når vi har en maks her, så kunne også den vært static. For den skal være den samme for alle. Men her lager vi også 20 maks. Men det viktigste her er konto ID. Så hver gang vi øker konto, så økes den felles variabelen. Og dermed så teller den opp fra 1 og opp til 20. Og så setter ID en leak count, så da får vi en ID på hver. Og så sier jeg 3d nummer først 1 i starting... Så 3d nummer 1 Calculated Work. Og her ser vi at den tråden gjør et arbeid. Men det som skjer inneni work, er at 15 ganger så regner det ut en kjempelang løkke. Java er såpass rask at selv om man står og regner sånn som dette her, så kan man gjøre det... Hvor mange ganger kjører vi det her? 900 millioner ganger. Det er så mange ganger...", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0005", "start": 746.86, "end": 949.68, "token_count": 597, "text": "Og så sier jeg 3d nummer først 1 i starting... Så 3d nummer 1 Calculated Work. Og her ser vi at den tråden gjør et arbeid. Men det som skjer inneni work, er at 15 ganger så regner det ut en kjempelang løkke. Java er såpass rask at selv om man står og regner sånn som dette her, så kan man gjøre det... Hvor mange ganger kjører vi det her? 900 millioner ganger. Det er så mange ganger... Så blir det høyere enn en int. Så da får man trøbbel. Så dette er ekstremt mange ganger den går, men likevel så regner det mange ganger. Og det som er hovedpoenget her nå, med tråder, er at når vi setter i gang de, så kjører de samtidig. Så vi kan... Vi kan kompilere. Og så kjører vi her, kanskje. I sidevinduet, så vi kan se på trådene mens vi kjører. Jeg ser det starter veldig kjapt, så startes det opp 20 tråder. Så kan vi se på det i topp. I utgangspunktet så ser vi at det er én prosess som kjører. Men hvis vi legger på... Hvis vi velger ut 'number of threads', så ser vi at den ene prosessen som kjører, den har 37 tråder. Vi ser også at faktisk de fleste andre prosesser også har en rekke tråder. Sånn som Zoom har 64 tråder. Ops, har 27. Men det som er spesielt med våre tråder nå, er at 20 av de er de regnetrådene som vi har startet. Så kan vi også, hvis vi taster H, så får vi se alle trådene. Og da ser vi at det er 20 tråder som står og kjører. Så kunne vi også ta og se på Last Use CPU. Hvis jeg velger den... Så ser vi da at trådene er skredulert på forskjellige CPU-er. Noen er da så klart på mange, for her er det bare 0 til 7 av CPU-er. Men vi ser da hvordan det er operativsystemet som skredulerer alle trådene. Java bare setter i gang en masse tråder, og så blir det skredulert av OS. Og akkurat det samme er det med alle de andre programmene.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0006", "start": 906.36, "end": 1143.62, "token_count": 579, "text": "Så kunne vi også ta og se på Last Use CPU. Hvis jeg velger den... Så ser vi da at trådene er skredulert på forskjellige CPU-er. Noen er da så klart på mange, for her er det bare 0 til 7 av CPU-er. Men vi ser da hvordan det er operativsystemet som skredulerer alle trådene. Java bare setter i gang en masse tråder, og så blir det skredulert av OS. Og akkurat det samme er det med alle de andre programmene. De starter en rekke tråder, men de blir skredulert som helt uavhengige enheter. Ok... Da skal vi se på et annet eksempel. Og prioritet i Java er... Det vi skal se, er at prioritet er litt merkelig implementert, på en måte, i Java. Det er implementert forskjellig i Linux og i Windows, f.eks. Men i dette eksempelet skal vi se at det faktisk ikke er det. Men før vi diskuterer det, så kan vi se på... Skal vi se... Jeg har et Java-program som heter Prior.java. Dette programmet implementerer da prioritet. Det ligner ganske på de andre programmene vi har sett på. I dette tilfellet så startes det to tråder. Prioritredd én som jeg kaller S1, og én som jeg kaller S2. Jeg kaller det prioritredd fordi jeg bruker prioritering. Og så setter jeg prioriteten til S1 til 5. Det er faktisk default-prioritet, så hvis jeg ikke hadde gjort det, så ville den likevel vært 5. Og så er det noen variabler. SN Norm Priority. Jeg skriver ut den for å få frem hva som er normal prioritet, eller standard. Og så skriver jeg ut maks prioritet og min prioritet. Maksprioritet er ti, hvis jeg husker riktig, og min er én. Så dette er motsatt av nice, for nice er jo hvor snill man er med andre. Så det er ti prioritetsklasser. Ja, min er null. Vi starter på null, og så er maks ti. Så... Nei... Sorry, glem det jeg sa. Dette er ikke prioriteten. Det som jeg sender med der, er antall millisekunder som tråden skal sove før den starter. Vi ser begge starter med en gang. Men jeg setter prioriteten for tråd nummer to. Den setter jeg til 10.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0007", "start": 1103.54, "end": 1282.96, "token_count": 588, "text": "Så dette er motsatt av nice, for nice er jo hvor snill man er med andre. Så det er ti prioritetsklasser. Ja, min er null. Vi starter på null, og så er maks ti. Så... Nei... Sorry, glem det jeg sa. Dette er ikke prioriteten. Det som jeg sender med der, er antall millisekunder som tråden skal sove før den starter. Vi ser begge starter med en gang. Men jeg setter prioriteten for tråd nummer to. Den setter jeg til 10. Så vi starter én tråd med prioritet 5 og én med prioritet 10. 10 er det aller høyeste, så da burde man forvente at et eller annet... Det skjer sånn at tråd nummer to kjører mer. Vi har jo bedt om at den skal få høyere prioritet. Vi kan se kjapt øverst her hva vi gjør. Det vi gjør, ligner veldig på det vi gjorde tidligere. Vi har en tellecount og en ID, så de får ID 1 og 2. Og så i tillegg så er det millisekunder. Det skal vi bruke på Windows etterpå når vi skal kjøre det der. Gi tråden noen millisekunder før den starter. Men vi gir den null millisekunder her, sånn at det er lettere å se hva som skjer i vårt tilfelle. Så vi kan jo også se hvordan vi behandler to forskjellige tråder. For de kjører i utgangspunktet samme kode, men så ser vi... Her er Rønn-metoden, som sier tråd nummer én sover først, null millisekunder, og så starter den. Men så ser vi... Her har jeg en if-test hvor jeg da tester hvis Ida er lik to, så setter jeg prioritet til én. Så på den måten kan man da behandle tråder og gjøre forskjellige ting, selv om trådene i utgangspunktet er like. Så vi kan se... Hvordan dette ser ut når vi kompilerer og... ... kjører denne tråden. Så da ser vi. Vi starter default prioritet fem. Vi starter nummer én med prioritet fem. Og så starter nummer to med prioritet... ti. De kjører annenhver gang. Det går akkurat like fort med nr. 1 som med nr. 2. Så går vi ned her og setter prioriteten for tråd nr. 2.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0008", "start": 1236.06, "end": 1460.86, "token_count": 593, "text": "selv om trådene i utgangspunktet er like. Så vi kan se... Hvordan dette ser ut når vi kompilerer og... ... kjører denne tråden. Så da ser vi. Vi starter default prioritet fem. Vi starter nummer én med prioritet fem. Og så starter nummer to med prioritet... ti. De kjører annenhver gang. Det går akkurat like fort med nr. 1 som med nr. 2. Så går vi ned her og setter prioriteten for tråd nr. 2. Den setter vi til 1, så da burde den ha minst prioritet. 1 er da det minste. Men likevel så ser vi at disse to jobber akkurat like fort. Hvis vi prøver å se på topp når de jobber, så... Så får begge 100 % CPU. Vi har ikke noe nice eller noe sånt der. Men vi har jo også sett tidligere at hvis man har nice-prosesser, så... Så vil de ikke være nice i forhold til hverandre. Det jeg kunne prøve å gjøre, var å starte trådene med TaskSet. Det har jeg faktisk ikke tenkt på tidligere, men vi kan gjøre et forsøk. Hvis jeg nå ser på Last Use TPU... Og så kan jeg prøve å starte Java med TaskSet minus 1.0. Sånn. Og så H. Da ser vi begge trådene kjører på tråd 0. Men vi ser at de deler helt broderlig. Selv om den ene tråden nå har prioritet 5. Og den andre har prioritert 10. Så tråd nr. 2 har prioritert 10, men dette gir ikke utslag på hvor mye CPU de får. Og vi kan ikke annet enn konkludere med at Linux faktisk ikke bryr seg om den prioriteten. Om du setter prioritet 1 eller 10, spiller ingen rolle. Men vi overlater til oppgavene. I oppgavene denne uken så blir dere bedt om å... Prøve å få Linux til å ta hensyn til Java-prioriteten. Og det er mulig hvis du kjører Java på en spesiell måte med et spesielt flagg. Men det virker ikke da hvis du kjører som vanlig bruker. Du må faktisk kjøre som Ruth, og i tillegg må du ha et spesielt flagg. Implementerer JVM dette her med NICE? At man setter NICE på Java-trådene,", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0009", "start": 1420.54, "end": 1642.98, "token_count": 584, "text": "I oppgavene denne uken så blir dere bedt om å... Prøve å få Linux til å ta hensyn til Java-prioriteten. Og det er mulig hvis du kjører Java på en spesiell måte med et spesielt flagg. Men det virker ikke da hvis du kjører som vanlig bruker. Du må faktisk kjøre som Ruth, og i tillegg må du ha et spesielt flagg. Implementerer JVM dette her med NICE? At man setter NICE på Java-trådene, sånn at de har prioritet i forhold til hverandre. For å se dette eksplisitt, så må du gjøre sånn som jeg gjorde nå, og bruke tastet ditt, sånn at de eksplisitt kjører på samme CPU. Hvis ikke, så ser du ikke effekten, med mindre du har veldig mange... Har veldig mange tråder. Flere tråder enn Sepur. Ok. Da tenkte jeg å... Ja, jeg tenkte egentlig også å kjøre trådene på... Kjøre trådene på Windows. Men skal vi se... Ja, det tar litt tid å sette opp de Windows-trådene. Hvis vi gjør det etter pausen, så kan vi heller se på... Nå gå til litt flere slides om tråder. Så vi skal se litt mer teoretisk på tråder. Og aller først skal vi se på blokkerende systemkall. Men før vi avslutter demoen her... Vi skal se etter pause at hvis vi gjør dette samme på Windows... kjører det samme programmet, så vil vi se at Windows faktisk tar hensyn til prioriteten. Og den tar kraftig hensyn. Så hvis du er i tråd med prioritet 4, så får den mye lavere prioritet enn en tråd med prioritet 5. Mens Linux da ikke tar hensyn i det hele tatt. Ok... At man ønsker å lese noe fra en disk. Og da er det jo naturlig at programmet ikke går videre før den har lest det som den har på disken. Og i alle denne type systemkall hvor man må vente på resultatet før programmet kan gå videre, det er da representert ved et blokkerende systemkall. For da gjør man et systemkall, og så blokkerer det prosessen. Og det kan være veldig uheldig. For du ønsker gjerne at en applikasjon skal være responsiv,", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0010", "start": 1600.54, "end": 1792.96, "token_count": 589, "text": "At man ønsker å lese noe fra en disk. Og da er det jo naturlig at programmet ikke går videre før den har lest det som den har på disken. Og i alle denne type systemkall hvor man må vente på resultatet før programmet kan gå videre, det er da representert ved et blokkerende systemkall. For da gjør man et systemkall, og så blokkerer det prosessen. Og det kan være veldig uheldig. For du ønsker gjerne at en applikasjon skal være responsiv, selv om den leser noe fra disk eller gjør noe annet som krever IO. Og derfor så... Det var på en måte en av hovedideene for å få inn tråder. Nemlig at programmereren kan da... Ved hjelp av IO... Programmet trenger da ikke å vente på blokkerende systemkall. Noen eksempler på den type systemkall er sånn som read and write, await og opplagt når du venter på andre til to år, og sleep er også opplagt blokkerende, for der venter du eksplisitt. Det mest typiske er sånn som read, hvor du leser noe fra disk, Og vente på å få resultatet før du kan kjøre videre. Så fins en del ikke-blokkerende systemkall også, eller veldig mange, sånn som GetPayDay og GetTimeOfDay f.eks. De eksekverer ferdig veldig raskt, og de blokkerer da ikke prosessen. Trådmodeller. Det finnes mange implementasjoner av tråder, og dette er de tre vanligste og mest brukte trådmodellene. Og den som er aller vanligst med en gang, det er én til én. Det er denne modellen her, hvor for hver tråd brukeren starter, f.eks. vi starter et Java-program, JVM starter 20 tråder... Tilsvarende være 20 kjernetråder. Det betyr i praksis at du har 20 tråder som skreduleres som 20 uavhengige enheter. 20 uavhengige regneoperasjoner. I tillegg så har vi én til mange. Vi kan se litt på neste slide hvor disse blir beskrevet. Én til mange, det... Betyr at alle trådene skeduleres som én prosess. Det er ikke så veldig vanlig lenger. Tidligere fantes en del sånne implementasjoner. Det kalles ofte green threats.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0011", "start": 1756.62, "end": 1945.3, "token_count": 600, "text": "som skreduleres som 20 uavhengige enheter. 20 uavhengige regneoperasjoner. I tillegg så har vi én til mange. Vi kan se litt på neste slide hvor disse blir beskrevet. Én til mange, det... Betyr at alle trådene skeduleres som én prosess. Det er ikke så veldig vanlig lenger. Tidligere fantes en del sånne implementasjoner. Det kalles ofte green threats. Den aller første implementasjonen på Linux av JVM var til green threats. Men det er jo litt upraktisk, for det som skjer da, er at programmeren selv må skedulere. Vi har f.eks. en metode som kalles yield, som sier OK, nå vil jeg gi fra meg SFP-en. Og GIL er en sånn... Er ikke så mye i bruk når man overlater til operativsystemet å skredulere. Men dette er da den trådmodellen. Så har vi 1-1, som er den mest vanlige, hvor alle tråder skreduleres uavhengig av hverandre av operativsystemet. Det er det som vi har i Java, og etter pausen skal vi se på noe Post-X-Treads. De skreduleres også på denne måten. Så har man en tredje måte, mange-til-mange. Og da skreduleres de som én-til-én, hvis det ikke er altfor mange tråder. Men så har det vært en del operativsystemer som har man implementert mange-til-mange for tilfeller hvor det er ekstremt mange tråder. Altså mange hundre eller mange tusen tråder. Kan det være uheldig at alle disse trådene skreduleres hver for seg? Så lager man grupper, sånn at én kjernetråd tar hånd om et sett av tråder. Når det er snakk om mange, kan det være 50 tråder som skreduleres av denne, og 50 av denne tråden. Da får de en intern skredulering seg imellom. Synkronisering. Ja, da er vi over på et helt nytt tema, men som ligger tett opp til dette med tråder og problemer man kan få når man kjører tråder samtidig. Kommunikasjon og kommunikasjon er generelt viktig når man har felles ressurser eller felles data som flere prosesser samtidig behandler. Og dette kommer til å være tema resten av dagen.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0012", "start": 1892.38, "end": 2093.94, "token_count": 588, "text": "som skreduleres av denne, og 50 av denne tråden. Da får de en intern skredulering seg imellom. Synkronisering. Ja, da er vi over på et helt nytt tema, men som ligger tett opp til dette med tråder og problemer man kan få når man kjører tråder samtidig. Kommunikasjon og kommunikasjon er generelt viktig når man har felles ressurser eller felles data som flere prosesser samtidig behandler. Og dette kommer til å være tema resten av dagen. Vi skal se på noen konkrete eksempler på hva som kan gå galt hvis prosesser prøver å endre på felles data samtidig. Da kan det bli en skikkelig krasj. Og de prinsippene vi følger, er at prosesser må ikke endre felles data samtidig. Vi har et eksempel med et billettsystem. Og hvis den ene prosessen da tar en billett og oppdaterer... Og deler ut den billetten samtidig som en annen gjør det samme... Da kan vi få problemer. Det er en såkalt race condition. Det har noe å si hvem som kommer først frem. Databasen kan ødelegges. Den variabelen kan få en feil verdi hvis man ikke synkroniserer. Det er derfor synkronisering er så viktig. Og dette er altså noe som praktisk dukker opp med en gang man har prosesser som jobber mot noe felles. Og det er veldig vanlig. Nå som man har masse distribuerte systemer som kobler seg opp mot samme database, så er det veldig viktig å synkronisere disse tilgangene til data. Et andre prinsipp vi har, er at en prosess ikke bør lese fellesdata mens en annen endrer dem. Den må også kunne vente på resultater fra en annen prosess. Det er en annen måte å synkronisere på, som vi skal se på senere. Da må prosessene seg imellom synkroniseres. Serialisering er det temaet vi først og fremst skal se på i dag. Da ser vi på prosesser eller tråder som aksesserer felles data. Det kan være bare én enkelt variabel. Men det som er viktig, er at de har felles. Med jawatråder vil det være en static... Når vi definerer en variabel som static, så er den felles.", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0013", "start": 2052.98, "end": 2233.42, "token_count": 595, "text": "Det er en annen måte å synkronisere på, som vi skal se på senere. Da må prosessene seg imellom synkroniseres. Serialisering er det temaet vi først og fremst skal se på i dag. Da ser vi på prosesser eller tråder som aksesserer felles data. Det kan være bare én enkelt variabel. Men det som er viktig, er at de har felles. Med jawatråder vil det være en static... Når vi definerer en variabel som static, så er den felles. Vi skal se noen eksempler med at dette er en saldo. Det er opplagt at når man gjør endringer på saldo, så må det gjøres systematisk. Og da må én av gangen jobbe på de dataene. Problemet er typisk at man leser av en saldo. Det kan være fra en database, men det kan også være fra en felles variable ramm. Men som vi har sett tidligere, når SEP 1 skal regne på det, så vil den verdien lastes inn i registrene. Og der kan det fort bli krøll hvis to prosesser ikke er synkronisert, eller serialisert, når de gjør dette. Det vi selv realiserer, er at vi sier at én av gangen får tilgang til denne fellesvarerabelen. Hele denne problemsiden kalles 'of the race condition', altså konkurranse om en felles ressurs. Den race condition vil da være sånn at utfallet av å kjøre programmene er forskjellig avhengig av hvilken prosess som kommer først fram til den felles ressursen. Og sånn kan det absolutt ikke være. Alt programmet bør være sånn at... Hvis du kjører de med akkurat samme randbetingelser, akkurat samme forutsetninger, så bør resultatet bli det samme. Men det skal vi se. Hvis man ikke serialiserer, så skal vi se flere eksempler på at da går det virkelig galt, og data ødelegges. Så er det også et viktig poeng at det er programmereren selv som må serialisere prosesser. Men som vi skal se, operativsystemet legger til rette for det. Muligheter som programmereren har for å selvrealisere. Ja, men da tar vi en pause der. Men jeg skal bare først ta... Det var et interessant spørsmål i chatten her. Hvis det ikke har så mye å si hvordan prosessene kjøres...", "source": "lecture"}
{"lecture_id": "os11time1", "chunk_id": "os11time1_0014", "start": 2183.26, "end": 2333.14, "token_count": 419, "text": "og data ødelegges. Så er det også et viktig poeng at det er programmereren selv som må serialisere prosesser. Men som vi skal se, operativsystemet legger til rette for det. Muligheter som programmereren har for å selvrealisere. Ja, men da tar vi en pause der. Men jeg skal bare først ta... Det var et interessant spørsmål i chatten her. Hvis det ikke har så mye å si hvordan prosessene kjøres... Jeg antar tanken her da... Sånn som Java. Java på Linux, hvis den ikke tar hensyn til prioriteten... Vel, det... Vanligvis så har alle tråder samme prioritet. Og det fungerer i de aller fleste tilfeller helt greit. Fordi operativsystemet er så bra. De fordeler ressurser, og operativstemme er veldig bra til å gi respons til prosesser som ønskerespons fra et tastetrykk f.eks. Så får den lynraskt den responsen. Hovedgrunnen til at man ikke har tatt så nøye på implementering av prioritet, som i Java, er at operativstemme gjør den jobben veldig bra. Likevel mange fordeler. En av de største er at prosessen slipper å vente. Du kan ha en tråd som står og venter på input og oppputt, og ikke minst så kan du utnytte flere CPU-er. Hvis du har en server med 48 CPU-er, så er det helt strålende å kunne sette i gang 48 tråder som jobber i parallell på dem og utnytter ressursene. Ja, OK. Men da tar vi en pause der. Og så tar vi et kvarters pause til... hva blir det? 9.35 kan vi ta en pause.", "source": "lecture"}
