{"lecture_id": "os11del13", "chunk_id": "os11del13_0000", "start": 0.0, "end": 203.88, "token_count": 579, "text": "Det som kan være interessant da, er å se på... Hvordan er det egentlig Javakoden som... Hvordan ser Javakoden som kjører dette her? Hvordan ser den ut? Og da er det en egen... En egen applikasjon, Javap, som kan vise... Javabyte-kode. Men hvis vi tar på Minus Private, så får man se akkurat den koden som kjører saldotråden. Vi kan kjøre den kommandoen. Så det jeg gjorde, var Javap Minus Private på saldotredd. Og det vi ser her, det er Java Bite-kode. Så jeg... Det kan jo minne litt om Assembler-kode. Den eneste forskjellen er at Assembler-kode er for X86 fysiske maskiner. Mens denne Java Bite-koden, den er for en Java virtuell maskin. Og... Da kan vi prøve oss å finne ut... Jo, her er den Update saldo. Det er den metoden som oppdaterer saldoen. Da kan vi se at det er to områder her. Her er det en e-ad, og her er det en e-sub. Og dette er de to områdene som saldoen blir oppdatert i. Og hvis vi konsentrerer oss om den delen som gjør... Dette er da tråd 1, som gjør saldo pluss, pluss. Og da skal jeg ikke gå så veldig inn på dette i detalj, men JVM er en såkalt stackmaskin. Det vil si at den legger variabler på stacken, og så opererer den på stacken. Så det som faktisk foregår her, er... Her er det getstatic. Det betyr hente inn saldoen. Så hvis saldoen er 50, så legges... Og så icons1. Den sier... Den legger tallet 1 på stacken. Og eadd, den legger sammen de to tallene. Så da tar den 50 pluss 1 får 51. Og så gjør den put static og legger verdien ut. Og helt tilsvarende skjer med sub her nede. Da ser vi med en gang at dette tar litt tid. Først så hentes verdien inn og legges på sekken. Og dette implementeres jo da igjen av JVM, som så kjører maskinkode som gjør dette her. Så det som er tydelig, er at saldo blir lagt inn og så legges i registeret som bare denne prosessen eier.", "source": "lecture"}
{"lecture_id": "os11del13", "chunk_id": "os11del13_0001", "start": 162.44, "end": 293.52, "token_count": 462, "text": "Så da tar den 50 pluss 1 får 51. Og så gjør den put static og legger verdien ut. Og helt tilsvarende skjer med sub her nede. Da ser vi med en gang at dette tar litt tid. Først så hentes verdien inn og legges på sekken. Og dette implementeres jo da igjen av JVM, som så kjører maskinkode som gjør dette her. Så det som er tydelig, er at saldo blir lagt inn og så legges i registeret som bare denne prosessen eier. Og den aner da ikke noe om hva som skjer her nede. Så når dette kjøres samtidig, Så er det helt kaos. Saldo hentes inn, men det er ikke noe kontroll på hvor mange ganger det gjøres. Det er ingen kontroll på at det ikke kan bli et avbrudd akkurat her. Og så overføres CPU-en til den andre tråden, og så trekker den fra. Og på en måte enda verre blir det når disse trådene opererer på hver sin CPU. For da jobber de helt uavhengig av hverandre. Og henter inn og ut saldo hele tiden uten å kontrollere hva den andre gjør i mellomtiden. Så det er helt klart at for at dette skal virke, så må man serialisere. Nøyaktig hvordan det gjøres, skal vi se på neste gang, etter påske. Men det er en metode som heter synchronized, som man kan bruke. Som da synkroniserer trådene i forhold til hverandre. Det som uansett er sikkert, er at hvis man ikke tar hensyn til dette her, hvis man ikke gjør programmene trådsikre, ikke tenker på race conditions, så kan ting som dette her oppstå. At man kjører samme programmet to ganger, og så er det helt vilkårlig hva man får ut som resultat.", "source": "lecture"}
