{"lecture_id": "os11del4", "chunk_id": "os11del4_0000", "start": 0.0, "end": 215.76, "token_count": 591, "text": "Da skal vi se på prioritet i Java. Da skal vi se på et annet eksempel. Og prioritet i Java er... Det vi skal se, er at prioritet er litt merkelig implementert på en måte i Java. I Linux og i Windows, f.eks. Java burde være helt plattformuavhengig. Men i dette eksempelet skal vi se at det faktisk ikke er det. Men før vi diskuterer det, så kan vi se på... Skal vi se... Jeg har et Java-program som heter prio.java. Dette programmet implementerer da prioritet. Og det ligner ganske på de andre programmene vi har sett på. I dette tilfellet så startes det to tråder. Prioritredd én som jeg kaller S1, og én som jeg kaller S2. Først starter jeg tråd nummer 1, S1, og så setter jeg prioriteten til 5. Det er faktisk default-prioritet, så hvis jeg ikke hadde gjort det, så ville den likevel vært 5. Og så er det noen variabler. SN Norm Priority, jeg skriver ut den. Eller standard. Og så ser vi... Jeg skriver ut maks prioritet og min prioritet. Maks prioritet er ti, hvis jeg husker riktig, og min er én. Så dette er motsatt av nice, for nice er jo hvor snill man er med andre. Så det er ti prioritetsklasser. Ja, min er null. Vi starter på null, og så er jeg maks ti. Så... Nei... Sorry. Glem det jeg sa. Dette er bare en... Dette er ikke prioriteten. Det som jeg sender med der, er antall millisekunder som tråden skal sove før den starter. Vi ser begge starter med en gang. Men jeg setter prioriteten for tråd nummer to. Den setter jeg til ti. Så vi starter én tråd med prioritet fem og én med prioritet ti. Ti er det aller høyeste, så da burde man forvente at et eller annet skjer sånn at tråd nummer to kjører mer. Vi har jo bedt om at den skal få høyere prioritet. Vi kan se kjapt øverst hva vi gjør, og det vi gjør, ligner veldig på det vi gjorde tidligere. Vi har en telle-count og en ID, så de får ID 1 og 2. Og så i tillegg har jeg millisekunder. Det skal vi bruke på Windows etterpå, når vi skal kjøre det der.", "source": "lecture"}
{"lecture_id": "os11del4", "chunk_id": "os11del4_0001", "start": 180.0, "end": 368.6, "token_count": 581, "text": "Ti er det aller høyeste, så da burde man forvente at et eller annet skjer sånn at tråd nummer to kjører mer. Vi har jo bedt om at den skal få høyere prioritet. Vi kan se kjapt øverst hva vi gjør, og det vi gjør, ligner veldig på det vi gjorde tidligere. Vi har en telle-count og en ID, så de får ID 1 og 2. Og så i tillegg har jeg millisekunder. Det skal vi bruke på Windows etterpå, når vi skal kjøre det der. Der skal vi gi tråden noen millisekunder før den starter. Men vi gir den null millisekunder her, sånn at det er lettere å se hva som skjer i vårt tilfelle. Så vi kan jo også se hvordan vi behandler to forskjellige tråder. For de kjører i utgangspunktet samme gode, men så ser vi... Her er Rønn-metoden, som sier tråd nummer én sove først, null millisekunder, og så starter den. Men så ser vi... Her har jeg en if-test hvor jeg da tester hvis ID er lik to, så setter jeg prioritet til én. Så på den måten kan man da behandle tråder og gjøre forskjellige ting, selv om trådene i utgangspunktet er like. Så vi kan se hvordan dette ser ut når vi kompilerer og... ... kjører denne tråden. Så da ser vi. Vi starter defolt prioritet til 5. Vi starter nummer 1 med prioritet 5. Og så starter nummer 2 med prioritet 5. Men vi ser de kjører annenhver gang. Det går akkurat like fort med nummer én som med nummer to. Og så går vi ned her og så setter vi prioriteten for tråd nummer to. Den setter vi til én, så da burde den ha minst prioritet. Én er da det minste, men likevel så ser vi at disse to jobber akkurat like fort. Hvis vi prøver å se på topp når de jobber, så får begge 100 % CPU. Vi har ikke noe nice eller noe sånt der. Men vi har jo også sett tidligere at hvis man har nice-prosesser, så vil det ikke være nice i forhold til... Så det vi kunne prøve å gjøre, var å starte trådene med TaskSet.", "source": "lecture"}
{"lecture_id": "os11del4", "chunk_id": "os11del4_0002", "start": 314.16, "end": 538.92, "token_count": 585, "text": "Den setter vi til én, så da burde den ha minst prioritet. Én er da det minste, men likevel så ser vi at disse to jobber akkurat like fort. Hvis vi prøver å se på topp når de jobber, så får begge 100 % CPU. Vi har ikke noe nice eller noe sånt der. Men vi har jo også sett tidligere at hvis man har nice-prosesser, så vil det ikke være nice i forhold til... Så det vi kunne prøve å gjøre, var å starte trådene med TaskSet. Det har jeg faktisk ikke tenkt på tidligere, men vi kan gjøre et forsøk. Hvis jeg nå ser på Last Use TPU... Og så kan jeg prøve å starte Java med TaskSet. Aset minus 1,0. Sånn. Og så H... Da ser vi begge trådene kjører på tråd 0. Men vi ser at de deler helt broderlig. Selv om den ene tråden nå har... Prioritert fem. Og den andre har prioritert ti. Så tråd nummer to har prioritert ti, men dette gir ikke utslag på hvor mye CPU de får. Og vi kan ikke annet enn konkludere her med at Linux faktisk ikke bryr seg om den prioriteten. Om du setter prioritet én eller ti, spiller ingen rolle. I oppgavene denne uken så... Så blir dere bedt om å prøve å få Linux til å ta hensyn til Java-prioriteten. Og det er mulig hvis du kjører Java på en spesiell måte med et spesielt flagg. Men det virker ikke da hvis du kjører som vanlig bruker. Du må faktisk kjøre som Ruth, og i tillegg må du ha et spesielt flagg. Da implementerer JVM dette her med NICE. At man setter NICE på Java-trådene, sånn at de har prioritet i forhold til hverandre. For å se dette eksplisitt, så må du gjøre sånn som jeg gjorde nå, og bruke tasten din, sånn at de eksplisitt kjører på samme CPU. Eller har veldig mange tråder. Flere tråder enn Sepur. Ok. Da tenkte jeg å... Ja, jeg tenkte egentlig også å kjøre trådene på... Kjøre trådene på Windows. Men skal vi se... Ja, det tar litt tid å sette opp de...", "source": "lecture"}
{"lecture_id": "os11del4", "chunk_id": "os11del4_0003", "start": 492.0, "end": 598.0, "token_count": 326, "text": "sånn at de har prioritet i forhold til hverandre. For å se dette eksplisitt, så må du gjøre sånn som jeg gjorde nå, og bruke tasten din, sånn at de eksplisitt kjører på samme CPU. Eller har veldig mange tråder. Flere tråder enn Sepur. Ok. Da tenkte jeg å... Ja, jeg tenkte egentlig også å kjøre trådene på... Kjøre trådene på Windows. Men skal vi se... Ja, det tar litt tid å sette opp de... Så jeg lurer på om vi gjør det etter pausen, så kan vi heller se på... Nå gå til litt flere slides om tråder. Så vi skal se litt mer teoretisk på tråder. Og aller først skal vi se på blokkerende systemkall. Men før vi avslutter demoen her... Vi skal se etter pause at hvis vi gjør dette samme på... kjører helt den samme Claes-bilen, kjører det samme programmet, så vil vi se at Windows faktisk tar hensyn til prioriteten. Og den tar kraftig hensyn, sånn at hvis du har en tråd med prioritet 4, så får den mye lavere prioritet enn en tråd med prioritet 5. Mens Linux da ikke tar hensyn i det hele tatt.", "source": "lecture"}
