{"lecture_id": "os11del5", "chunk_id": "os11del5_0000", "start": 0.0, "end": 195.8, "token_count": 593, "text": "Blokkerende systemcall. Dette er opprinnelig den viktigste grunnen til at vi har tråder i det hele tatt. Blokkerende systemcall er systemcall som da blokkerer prosessen fordi den venter på en input-output-forespørsel. Det kan f.eks. være at man ønsker å lese noe fra en disk. Da er det jo naturlig at programmet ikke går videre før den har lest det som den har på disken. Og i alle denne type systemkall hvor man må vente på resultatet før programmet kan gå videre, det er da representert ved et blokkerende systemkall. For da gjør man et systemkall, og så blokkerer det prosessen, sånn at den ikke får kjøre videre. Det kan være veldig uheldig. For du ønsker gjerne at en applikasjon skal være responsiv, selv om den leser noe fra disk eller gjør noe annet som krever IO. Og derfor så... Det var på en måte en av hovedideene for å få inn tråder. Nemlig at programmereren ved hjelp av tråder kan styre de forskjellige arbeidsoppgavene. Det henger da ikke i å vente på blokkerende systemcall. Noen eksempler på den type systemcall er sånn som read and write, await, opplagt hvor du venter på andre toaletter, og sleep, altså opplagt blokkerende, for der venter du eksplisitt. Det mest typiske er sånn som read, hvor du leser noe fra disk, og da må du vente på å få resultatet. Så fins en del ikke-blokkerende systemkall også, eller veldig mange, sånn som GetPayDay og GetTimeOfDay f.eks. De eksekverer ferdig veldig raskt, og de blokkerer da ikke prosessen. Trådmodeller. Det finnes mange implementasjoner av tråder, og dette er det. De er de tre vanligste og mest brukte trådmodellene. Den som er aller vanligst med en gang, det er 1-1. Det er denne modellen her hvor for hver tråd brukeren starter... F.eks. vi starter et Java-program. JVM starter 20 tråder. Da vil det tilsvarende være 20 kjernetråder. Det betyr i praksis at du... Du har 20 tråder som skreduleres som 20 uavhengige regneoperasjoner. I tillegg har vi én til mange.", "source": "lecture"}
{"lecture_id": "os11del5", "chunk_id": "os11del5_0001", "start": 150.0, "end": 327.88, "token_count": 549, "text": "De er de tre vanligste og mest brukte trådmodellene. Den som er aller vanligst med en gang, det er 1-1. Det er denne modellen her hvor for hver tråd brukeren starter... F.eks. vi starter et Java-program. JVM starter 20 tråder. Da vil det tilsvarende være 20 kjernetråder. Det betyr i praksis at du... Du har 20 tråder som skreduleres som 20 uavhengige regneoperasjoner. I tillegg har vi én til mange. Vi kan se litt på neste slide hvor disse blir beskrevet. Én til mange, det betyr at alle trådene skreduleres som én prosess. Tidligere fantes en del sånne implementasjoner. Det kalles ofte green threats. Den aller første implementasjonen på Linux av JVM var av green threats. Men det er jo litt upraktisk, for det som skjer da, er at programmeren selv må skedulere. Vi har f.eks. en metode som kalles Yield, som sier... Ok, nå vil jeg gi fra meg CPU-en. Og Yield er en sånn... Når man overlater til operativsystemet å skredulere. Men dette er da den trådmodellen. Så har vi 1-1, som er det mest vanlige, hvor alle tråder skreduleres uavhengig av hverandre av operativsystemet. Det er det som vi har i Java, og etter pausen skal vi se på Post-Ex-Treats eller P-Treats. De skreduleres også på den måten. En tredje måte er mange-til-mange. Og da skal du lese som én-til-én hvis det ikke er altfor mange tråder. Men så har det vært en del operativsystemer som har implementert mange-til-mange for tilfeller hvor det er ekstremt mange tråder. Altså mange hundre eller mange tusen tråder. Skreduleres hver for seg. Så lager man grupper, sånn at én kjernetråd tar hånd om et sett av tråder. Så kan det være 50 tråder som skreduleres av denne, og 50 av denne tråden. Da får de en intern skredulering seg imellom.", "source": "lecture"}
