{"lecture_id": "os11del3", "chunk_id": "os11del3_0000", "start": 0.0, "end": 229.24, "token_count": 593, "text": "Sånn. Da skal vi se på... Kalkmani. Det er et trådprogram implementert i Java, som implementerer en rekke tråder... Det var noen oppgaver i forrige uke som gikk ut på at man skulle se på hvor mange tråder som kjøres av operativsystemet når man kjører to tråder. Og da var det overraskende nok så var det veldig mange tråder som kjøres. Og det var en masse sånne workertreads som operativsystemet setter opp. Og som operativsystemet skredulerer. Så det er hjelpetråder som står klare til å gjøre alle slags forskjellige oppgaver. Det koster ikke så mye å ha disse ekstra trådene, så derfor er det veldig mange programmer, sånn som Java og Chrome og andre applikasjoner, som kjører en rekke tråder. Det koster ganske lite for operativsystemet å ha de trådene kjørende når de ikke brukes i PU. Men her er da et eksempel på... Et eksempel som kjører med mange tråder. Så vi kan gå ned til klassen Calcmanny her, som er main. Og det som skjer her, er at vi definerer en intreds som er 20. Så det vi skal gjøre, er å starte 20 uavhengige tråder. Her opprettes et nytt trådobjekt, menu. Her opprettes en ny tråd. Og så skriver jeg bare ut at vi starter... At vi starter 20.30. Og så går jeg inn i forløkket. Her starter jeg da tråd nummer null... ... and new calcthread. Og så når college én, så starter jeg tråd nummer én osv. Og så kaller jeg på startmetoden for tråden. Så dette skjer da 20 ganger. Og hvis vi går opp her, så ser vi hva som skjer når calchtread... kalles. Da... Når Calcred startes opp, så kjøres denne Inject-metoden her. Count pluss-pluss. Da er det viktig å huske at... Count er definert som static. Og det betyr at det finnes bare én av den for alle trådene. En variabel som ikke blir deklarert som static, som int id, den har vi da 20 stykker av. Når vi har en maks her, så kunne også den vært static.", "source": "lecture"}
{"lecture_id": "os11del3", "chunk_id": "os11del3_0001", "start": 173.08, "end": 395.64, "token_count": 599, "text": "hva som skjer når calchtread... kalles. Da... Når Calcred startes opp, så kjøres denne Inject-metoden her. Count pluss-pluss. Da er det viktig å huske at... Count er definert som static. Og det betyr at det finnes bare én av den for alle trådene. En variabel som ikke blir deklarert som static, som int id, den har vi da 20 stykker av. Når vi har en maks her, så kunne også den vært static. For den skal være en samme for alle. Men her lager vi også 20 maks. Men det viktigste her er konto id. Så hver gang vi gjør... Så økes den felles variabelen. Og dermed så teller den opp fra én og opp til 20. Og så setter ID en leak count, så da får vi en ID på hver. Og så sier jeg tredd nummer først én i starting, så tredd... Nummer én calculated work. Og her ser vi at den tråden gjør... La oss se bort fra den som er kommentert bort her. Men det som skjer inneni work, er at 15 ganger så regner det ut en kjempelang løkke. Java er såpass rask at selv om man står og regner sånn som dette her, så kan man gjøre det 900 millioner ganger. Hvis man lager et høyere tall der, så blir det høyere enn en int. Så da får man trøbbel. Dette er ekstremt mange ganger den går. Men likevel så regner det mange ganger. Og det som er hovedpoenget her nå, med tråder, er at når vi setter i gang de, så kjører de samtidig. Så vi kan... Vi kan kompilere. Og... Ja, vi kan kjøre det her kanskje. Bare i sidevinduet, så vi kan se på trådene mens vi kjører. Jeg ser det starter veldig kjapt, så startes det opp 20 tråder. Så kan vi se på det i topp. I utgangspunktet så ser vi at... Det er én prosess som kjører. Men hvis vi legger på... Hvis vi velger ut 'number of threads', så ser vi at den ene prosessen som kjører, den har 37 tråder. Vi ser også at faktisk de fleste andre prosesser også har en rekke... Sånn som Zoom. Jeg har 64 tråder. Ops, har 27.", "source": "lecture"}
{"lecture_id": "os11del3", "chunk_id": "os11del3_0002", "start": 346.62, "end": 465.0, "token_count": 353, "text": "Jeg ser det starter veldig kjapt, så startes det opp 20 tråder. Så kan vi se på det i topp. I utgangspunktet så ser vi at... Det er én prosess som kjører. Men hvis vi legger på... Hvis vi velger ut 'number of threads', så ser vi at den ene prosessen som kjører, den har 37 tråder. Vi ser også at faktisk de fleste andre prosesser også har en rekke... Sånn som Zoom. Jeg har 64 tråder. Ops, har 27. Men det som er spesielt med våre tråder nå, er at 20 av de er de regnetrådene som vi har startet. Hvis vi taster H, stor H, så får vi se alle trådene. Da ser vi at det er 20 tråder som står og kjører. Så kunne vi også ta og... Se på Last Use CPU. Hvis jeg velger den også... Så ser vi da at trådene er skredulert på forskjellige CPU-er. Noen er da så klart på mange, for her er det bare 0 til 7 av CPU-er. Men vi ser da hvordan det er operativsystemet som skredulerer alle trådene. Og så blir de skedulert av OS. Og akkurat det samme er det med alle de andre programmene. De starter en rekke tråder, men de blir skedulert som helt uavhengige enheter.", "source": "lecture"}
