{"lecture_id": "os12del13", "chunk_id": "os12del13_0000", "start": 0.0, "end": 234.4, "token_count": 599, "text": "Da tenker jeg at vi bare har én CPU. Én CPU her, og så har vi ramme her oppe. Og her har vi svar. Svarlekk 10. Og da er det litt greiere, for hvis vi bare ser... La oss kalle den institusjonen for INKSVAR. Da skjer den operasjonen der. Det er bare én institusjon. Så da vil det hele tiden være sånn at hvis du... Hvis jeg gjør INKSVAR, så henter jeg ut tallet ti. Den tar databussen. Inn til Alun. Alun får inn ti, sender elleve tilbake. Og så kommer det elleve opp her. Og dette er da én operasjon. Men så har jeg nå to prosesser, eller to tråder, som kjører samtidig på denne CPU-en. Og da vil det liksom være P1 og P2... Men gjett gitt... P1 og P2 har liksom et lite område. De har en sånn PCB her oppe hvor de har sine verdier lagret. Ops... Dårlig kulepenn. Der. P1 og P2 har... ... sine verdier lagret her oppe. Og det er når du gjør en Context Switch. Så henter man inn de gamle verdiene. Men da er poenget her... Når vi kjører et task-sett, og vi bare har én institusjon, så da så vi at en context switch hadde ikke noe å si. For da utføres den institusjonen her ferdig, og det går bare én i operasjon. Så hver gang prosess 1 er inne og gjør dette her, så økes det pent fra 10 og 11. P2 inn, og skal jobbe. Da vil den hente ut verdien 11, for P1 er jo ferdig med den. Kjøre ned til aluen og øke igjen. Og da kommer den opp til 12. Og alt går fint. Men det som ble problemet, er... Hva skjer om vi bruker den koden som... Move svar til... Ja, det er prosent AX, ink, prosent AX. Og move prosent AX til svar. Da var det tre instruksjoner. Og da så vi at da ble det også trøbbel for... Selv om vi kjørte Task-sett. Og da har vi to prosesser, P1 og P2, og det var litt sånn som med den MILD-en som vi så på. Da, selv om det bare er én CPU og én buss, så får du problemer.", "source": "lecture"}
{"lecture_id": "os12del13", "chunk_id": "os12del13_0001", "start": 180.0, "end": 350.0, "token_count": 495, "text": "Move svar til... Ja, det er prosent AX, ink, prosent AX. Og move prosent AX til svar. Da var det tre instruksjoner. Og da så vi at da ble det også trøbbel for... Selv om vi kjørte Task-sett. Og da har vi to prosesser, P1 og P2, og det var litt sånn som med den MILD-en som vi så på. Da, selv om det bare er én CPU og én buss, så får du problemer. For da vil... La oss si vi... Ja, la oss si vi... Vi har verdien 11 her, da. Så er det ProsessP1 som kjører, henter inn verdien 11 og legger den i AX. Og så kommer det en ContextSwitch. Og da ligger da verdien 11... Den vil da lagres i PCB for P1. Og den verdien 11, den ligger der, da. Og så kommer den ContextSwitch akkurat etter den institusjonen der. Her kommer det Context Itch. Så starter P2 å kjøre, og den vil da begynne på koden her og hente inn verdien 11, som ligger i svar, inn i sitt register. Og så øker den den og legger ut osv. Og da ville da P2 kunne gjøre det en rekke ganger. 100 ganger, kanskje. Så den kommer opp i et svar på 111. Og så kommer den kontekstfritz tilbake, og så er det P1 sin tur. Men da vil jo P1 begynne å operere på sin gamle 11 som ligger der. Den legges inn i registrene. Og så øker den AX10 og får 12. Og så sendes 12 ut. Og da ser vi... Da blir det totalt kaos, fordi det var tre linjer her. Men hvis vi kjørte Task-sett og tvang begge prosessene til å kjøre på samme CPU, så så vi at INK svarte med én enkel operasjon så fungerte det som det skulle. Da fikk vi ikke noe trøbbel.", "source": "lecture"}
