{"lecture_id": "os12del5", "chunk_id": "os12del5_0000", "start": 0.0, "end": 177.16, "token_count": 595, "text": "Kritisk avsnitt er det avsnittet i koden som er helt avgjørende når det gjelder synkronisering. Og det er da typisk når man aksesserer en felles variabel. Vi har sett på en problemstilling hvor vi har en felles variabel saldo. Hvor vi hadde en felles variabel saldo som én prosess... Økte med 1 mill. og en annen prosess, P1, minket med 1 mill. Og så så vi da på hvordan dette kunne gjøre at saldoen... At det forsvant 1 mill. Og det er jo opplagt uheldig. Og akkurat den kodebiten hvor den millen forsvinner, det er når saldoen oppdateres. Og dette kalles kritisk avsnitt. Som er helt avgjørende, er at en prosess som er inni et kritisk avsnitt, den må kunne fullføre det helt alene, uten at da noen andre endrer på saldoen. Så serialiseringen, den må da sørge for at det kritiske avsnittet, det gjøres bare av én prosess av gangen. Og vi begynte å se på metoder som kan gjøre dette her, så vi hadde en lokkinstitusjon. Og den hindret da at andre prosesser endret på saldoen. Det gjorde vi med Petrads. Og det som også var avgjørende da, var at vi låste minnebussen. Altså bussen ut til RAM. For det er det som er avgjørende når du har tråder som kjører på forskjellige CPU-er. Så er det ikke så lett å koordinere dem, for da opererer de totalt samtidig og helt uavhengig av hverandre. Hvis begge kjører på samme CPU, så har du tross alt en context switch, sånn at da går det an å koordinere i litt større grad. Selv om det kan bli trøbbel, det òg. Men når du er på forskjellige CPU-er, så må minnebussen låses for at ikke to prosesser skal da... Samtidig hente ut en kode, eller samtidig endre. Det vil si at ikke begge skal hente ut den nåværende verdien, og så skrive tilbake uten å koordinere med den andre. Det er da problemene skjer. Men hvis vi kjører selv, hvis vi kjører på samme CPU, så har vi sett at én institusjon sånn som dette her...", "source": "lecture"}
{"lecture_id": "os12del5", "chunk_id": "os12del5_0001", "start": 140.96, "end": 325.52, "token_count": 592, "text": "Men når du er på forskjellige CPU-er, så må minnebussen låses for at ikke to prosesser skal da... Samtidig hente ut en kode, eller samtidig endre. Det vil si at ikke begge skal hente ut den nåværende verdien, og så skrive tilbake uten å koordinere med den andre. Det er da problemene skjer. Men hvis vi kjører selv, hvis vi kjører på samme CPU, så har vi sett at én institusjon sånn som dette her... Den fører faktisk til minst to instruksjoner på maskinnivå. På assembly-nivå. Og det er det operativsystemet ser. Så når operativsystemet skedulerer to prosesser sånn som dette, selv på samme CPU, så kan det da komme en context switch midt inne i denne oppdateringen. Og da kan det som prosess 2... Utfører av institusjoner. Det kan da bli ødelagt av den andre fordi de ikke koordinerer. Og fordi det kan komme context-switch midt inn i kritisk avsnitt. For da blir kritisk avsnitt større enn én linje. Hvis kritisk avsnitt faktisk bare er én maskininstitusjon, så vil vi ikke få det problemet med context-switching på samme SPU. Men problemet kan likevel oppstå når vi har flere SPU. Nå skal jeg se på noen metoder for å behandle kritiske avsnitt. Og målet med disse metodene er at vi skal sikre oss at bare én prosess av gangen, eller én tråd av gangen, utfører sitt kritiske avsnitt før en annen prosess gjør det. I prinsippet så kan det være ti tråder som samtidig ønsker å gå inn i... Men det avgjørende her er bare én av gangene. En veldig direkte måte å sørge dette for, det er å skru av interrupts. For hvis man da skrur av interrupts, så er du sikker på at... Da er du sikker på at det ikke kommer noe context switch. Så kan det være trøbbel med andre CPU-er. Men hvis vi er på samme CPU, så kan vi sikre et kritisk avsnitt ved først å disable interrupts, så utføre det kritiske avsnittet, og så enable interrupts etterpå. For da er vi... Selv om dette kritiske avsnittet da består av flere maskininstitusjoner,", "source": "lecture"}
{"lecture_id": "os12del5", "chunk_id": "os12del5_0002", "start": 285.4, "end": 475.68, "token_count": 590, "text": "For hvis man da skrur av interrupts, så er du sikker på at... Da er du sikker på at det ikke kommer noe context switch. Så kan det være trøbbel med andre CPU-er. Men hvis vi er på samme CPU, så kan vi sikre et kritisk avsnitt ved først å disable interrupts, så utføre det kritiske avsnittet, og så enable interrupts etterpå. For da er vi... Selv om dette kritiske avsnittet da består av flere maskininstitusjoner, så er man likevel sikker på at ingen... Det kan ikke skje noe kontekstuelt. For interrupt er skrudd av. Det skjedde ved at det kommer en timer-interrupt. Så om man ikke behandler timer-interrupten med en gang, men venter til koden er ferdig, så vil det ikke kunne skje... Da vil ingen kunne avbryte knyttet til avsnittet. Dette er OK for en OUS-kjerne. Det er kode i OUS-kjernen som skrur av interrupts. Være helt sikker på å fullføre et kritisk gassnitt. Men det ville vært veldig kritisk hvis brukerprosesser kunne gjøre dette her, for da kunne de straks ta over styringen. Så dette er OK for en O-stjerne, men generelt så kan man ikke gi en slik metode til en vanlig brukerprosess. Det er å lage en slags lås. Det er litt sånn som den lock-instruksjonen som vi har sett på. Man lager en lås sånn at bare én prosess av gangen har tilgang til fellesdata. Generelt så kalles en slik lås mutix. Det står da for mutual exclusion. På norsk betyr det gjensidig utelukkelse. man... Sørge for å utelukke hverandre. Og dette er den mest brukte metoden generelt. Og det fins mange implementasjoner av det. Og vi skal se noen eksempler på implementasjoner. Men det som er viktig her, er at man må da utelukke alle andre. Ja, en mutex... Den lockwill-funksjonen vi hadde, den gjelder bare for én institusjon. Men en mutex generelt, det er på en måte en nøkkel som man tar tak i. Og så lenge man beholder den nøkkelen, så er man inne i kritiske avsnitt, og da kan ingen andre komme inn i kritiske avsnitt og gjøre noe.", "source": "lecture"}
{"lecture_id": "os12del5", "chunk_id": "os12del5_0003", "start": 432.16, "end": 486.26, "token_count": 180, "text": "Og vi skal se noen eksempler på implementasjoner. Men det som er viktig her, er at man må da utelukke alle andre. Ja, en mutex... Den lockwill-funksjonen vi hadde, den gjelder bare for én institusjon. Men en mutex generelt, det er på en måte en nøkkel som man tar tak i. Og så lenge man beholder den nøkkelen, så er man inne i kritiske avsnitt, og da kan ingen andre komme inn i kritiske avsnitt og gjøre noe. Så det kan vare lenger enn en enkelt institusjon, og dermed så kan det Den kan også brukes til å serialisere kode, som har mer enn én institusjon i Kritisk avsnitt.", "source": "lecture"}
