{"lecture_id": "os12del15", "chunk_id": "os12del15_0000", "start": 0.0, "end": 187.64, "token_count": 587, "text": "Semaforer er et begrep som er mye brukt når det gjelder synkronisering. Og semaforer, de... Det er en slags teller. Så en binær semafor, altså en semafor som bare har 0 eller 1, det er akkurat som en myteks. Men generelt så kan en semafor ha flere verdier. Du kan f.eks. Starter med S like T. Og da... Da har man ti ressurser som man kan på en måte bruke opp før man må vente og synkronisere med andre. Og på en semafor så har man to metoder som man bruker. Signal-S og wait-S. Og signal-S, det signaliserer nå... Nå er alt klart. Semaforer er jo et gammelt begrep som handler om flagg. At man bruker sånne tegn for flagg for å sende signaler over lange avstander. Så dette er semaforer som da brukes til å sende tegn prosesser imellom. Og Deikstra, som er en nederlandsk professor som på 60-, 70-tallet... Han la grunnlag for mye av dette med synkronisering og den Dijkstra-algoritmen som vi skal se på i oppgavene. Og han fant på dette begrepet - semaforer. Hvis det skal implementeres riktig, så må de være uninterruptable. Altså, de må være atomiske, sånn at de ikke kan... Sånn at det ikke kan komme en contex-switch midt inni her. Og det gjør man da ofte med hardware-støtte. Og de operasjonene man gjør... Her så ser vi så lenge S er mindre enn lik null, så venter man, og så minsker man. Det betyr... La oss si S i utgangspunktet er 5, da. Så vil alle som går inn i veit, de vil senke den nedover. Når den når 0, da vil den ikke gå lenger ned. Da er det et signal til andre. Men hvis vi starter med S1, så vil en semafor se ut som en mytex. Så en binærsemafor som enten er 0 eller 1, den er akkurat som en lokk eller som en mytex. Og da kan man bruke semaforer akkurat som man har gjort tidligere. Tidligere så sa vi get Mutex og release Mutex. Men her ville vi nå ta Wait-S og Signal-S.", "source": "lecture"}
{"lecture_id": "os12del15", "chunk_id": "os12del15_0001", "start": 150.0, "end": 339.6, "token_count": 587, "text": "Når den når 0, da vil den ikke gå lenger ned. Da er det et signal til andre. Men hvis vi starter med S1, så vil en semafor se ut som en mytex. Så en binærsemafor som enten er 0 eller 1, den er akkurat som en lokk eller som en mytex. Og da kan man bruke semaforer akkurat som man har gjort tidligere. Tidligere så sa vi get Mutex og release Mutex. Men her ville vi nå ta Wait-S og Signal-S. Men de har da den tilsvarende egenskapen. Da kan man kjøre et kritisk avsnitt inni. Og da, når man gjør Wait-S, så setter man S lik 0. Og det er da et signal til alle andre at de må stå og vente. Uansett... Generelt med mutexer... Og hvis man gjør det med software, lager den type mutexer, så bruker man busy waiting. Og det er opplagt en ulempe. Operativsystemet har den store fordelen at det kan styre prosesser og sette de inn og ut av køer. Så dette er en implementasjon av semafore reoperativsystemet. Og da kan... Hvis vi starter med wait, så kan en... Hvis en ressurs er opptatt, og man må vente, så kan operativstudenten blokkere den prosessen og legge det i en venteliste. Det fine med det, er at da tas bare prosessen ut av reddelist. Og den vil ikke måtte stå og vente med en busy waiting. Den vil da bare legges på vent. Og så, når andre prosesser er ferdig, og gjør en signal, så kan Operativ CMC, OK, S økes med igjen. Ja, da kan vi vekke opp neste prosess fra ventelisten. Så da vekkes den prosessen opp som har ligget og ventet. Og på den måten så får man en veldig ryddig og effektiv på å synkronisere prosesser. Og det er et viktig poeng at operativsystemer legger til rette for at programmerere kan synkronisere med sånn som signal-o-wait. Mens det er programmereren som må skrive koden som gjør det. Så operativsystemer synkroniserer ikke for programmererne. Det er programmererne som må gjøre dette, men Operativ Svømme legger til rette ved f.eks. å kunne tilby semaforer.", "source": "lecture"}
