{"lecture_id": "os12del7", "chunk_id": "os12del7_0000", "start": 0.0, "end": 204.0, "token_count": 596, "text": "Ja... Vi har allerede sett på Lock på X86-institusjonen Lock. Og som vi skal se senere, så trenger man... For å lage en effektiv løsning, så trenger man hjelp fra hardware. Men det går også an å lage software-løsninger som, selv om de kjører på... Selv om det kan komme en kontekst-witch som sørger for en Mutex. Hvis vi ønsker en software-løsning, da ønsker vi oss gjerne å ha to funksjoner eller metoder sånn som dette... GetMutex og releaseMutex. Og getMutex... Den metoden ønsker vi skal hente en lokk. Og så sier vi denne nøkkelen. Ingen andre må ta den. Ingen andre kan ta den. Så da kan jeg utføre mitt Kritiske avsnitt. Og så, etterpå, så kan jeg gi fra meg nøkkelen. Og dette virker jo enkelt og greit. Så da burde man egentlig ha løst hele problemet. Men vi skal se at det er ikke så enkelt som man skulle tro. Så dette er første forsøk på å lage en software music. De andre forsøkene er det oppgaver om denne uken. Så se på de oppgavene senere. Men vi skal se på dette første forsøket, som er liksom det... Enkleste man kan få til, og som tilsvarer det å lage... Vi kan lage en mail-lok. Vi hadde et eksempel hvor vi lagde en fil. Og så sjekker alle andre prosesser om den filen finnes. Dette er egentlig det tilsvarende, men vi får det samme problemet. Så vi tenker oss at vi har en static boolin-lok. Det er da en felles variabel som er true eller false. Og den er static i betydning... Av at to eller flere prosesser kan aksessere den. Så nå skal vi som programmerere ha kode som sikrer denne lokken. Og da kan vi gjøre det på denne måten her. Vi kan si... Getmutex-lokk. Den kan være sånn at... Dette er en litt spesiell konstruksjon, men den funker i Java, f.eks. Og det er vile lock, og så kommer det bare to parenteser. Og de to parentesene, de er... De gjør ingenting. Det er faktisk en maskininstitusjon som gjør ingenting. Og den heter NOP, No Operation. Så vile lock, og så ingenting.", "source": "lecture"}
{"lecture_id": "os12del7", "chunk_id": "os12del7_0001", "start": 165.72, "end": 335.24, "token_count": 578, "text": "Og da kan vi gjøre det på denne måten her. Vi kan si... Getmutex-lokk. Den kan være sånn at... Dette er en litt spesiell konstruksjon, men den funker i Java, f.eks. Og det er vile lock, og så kommer det bare to parenteser. Og de to parentesene, de er... De gjør ingenting. Det er faktisk en maskininstitusjon som gjør ingenting. Og den heter NOP, No Operation. Så vile lock, og så ingenting. Det den gjør, det er at den bare tester om og om igjen. Om lock er true. Ja. Den tester om og om igjen om lock er true eller false. Og hvis lock er true, så går den inn i løkka og gjør ingenting. Og det den da gjør, er at den hele tiden sjekker om lock er true. Så den står her og gang på gang tester om er lock true, er lock true. Hele tiden, hvis lokket er truet, så står den og venter. Og da er det klart... Der vil den stå evig. Med mindre det er andre prosesser som aksesserer denne lokken og setter den til Folds. Så hvis ingen andre har satt denne til Folds før, så vil den første prosessen som gjør GetMuteX, den vil gå inn... Lokket er Folds, så da hopper den over denne her. Og da er det trygt, for da kan den gå inn i sitt kritisk avsnitt. For den har nå gått inn, satt locklig true... Akkurat som å skru på en lås. Det er som om man går inn på et toalett og vrir på låsen, for da er det et signal til alle andre. Da er det rødt. Ingen kan komme inn her. Så da er det safe. Så hvis en annen prosess kommer inn og også prøver å gjøre get mutex før det kritiske avsnittet, så vil den komme inn og så se... Oi, lokk er på. OK, da må jeg stå her og vente. Og den står da og venter helt til den første prosessen som kom inn, har gjort released mutex. For hvis vi husker det man... Først gjør man get mutex, henter låsen, så kritisk avsnitt, og så release mutex. Så når da... Prosess nummer to. Er ferdig med sett kritiske avsnitt,", "source": "lecture"}
{"lecture_id": "os12del7", "chunk_id": "os12del7_0002", "start": 305.32, "end": 496.28, "token_count": 587, "text": "get mutex før det kritiske avsnittet, så vil den komme inn og så se... Oi, lokk er på. OK, da må jeg stå her og vente. Og den står da og venter helt til den første prosessen som kom inn, har gjort released mutex. For hvis vi husker det man... Først gjør man get mutex, henter låsen, så kritisk avsnitt, og så release mutex. Så når da... Prosess nummer to. Er ferdig med sett kritiske avsnitt, så vil den release mye av teksten, og det gjør den ved å sette locklick-fots. Og da vil de som måtte stå her og vente i en løkke, de vil da komme inn i kritiske avsnitt, og så vil de sette locklick, tror jeg. Så dette ser ut som det perfekte opplegg. Men her er det et problem. Jeg har stilt et spørsmål her. Dette burde sikre at to prosesser ikke er i kritisk asyl samtidig. Men vi kan få et problem her, og det er hvis... Hva skjer hvis det kommer en context switch? Vi tenker at disse kjører på samme CPU. Hva om det kommer en kontekst-witch rett etter at denne prosessen har testet om... Om lock er false. Hvis vi antar at lock er false... Og så vil det jo... En sånn veiløkke... En sånn test består av flere deler. Første del må hente inn verdien og legge et register. Truly Falls-register er typisk 0 eller 1. Og så må den, etter at den har hentet den inn, gjøre en compare. Sammenligne den verdien med 0, f.eks. Og så må den etter den compare hoppe, avhengig av verdien. Men det der utføres i minst to institusjoner. Så hva skjer om det kommer en context switch nøyaktig etter at den har hentet inn verdien, og sett at den er falsk? Jo, da fryser selv den prosessen. Det neste den vil gjøre, er å sette lock-click-through og gå inn i kreditskapsnitt. Men når den første prosessen som kommer inn, fryser, Da er jo lock fortsatt false. Så den prosess nummer to... Den vil enkelt og greit bare hoppe over den løkka. Lock er false. Og så vil den sette locklik, tror jeg. Men da er det for sent.", "source": "lecture"}
{"lecture_id": "os12del7", "chunk_id": "os12del7_0003", "start": 458.84, "end": 632.58, "token_count": 550, "text": "nøyaktig etter at den har hentet inn verdien, og sett at den er falsk? Jo, da fryser selv den prosessen. Det neste den vil gjøre, er å sette lock-click-through og gå inn i kreditskapsnitt. Men når den første prosessen som kommer inn, fryser, Da er jo lock fortsatt false. Så den prosess nummer to... Den vil enkelt og greit bare hoppe over den løkka. Lock er false. Og så vil den sette locklik, tror jeg. Men da er det for sent. For da er P1 allerede inne i kritiske avsnitt. Og så kommer P2 etter, og den går også inn i kritiske avsnitt. Og da er vi tilbake i de gamle problemene. Så kan begge to kjøre kritiske avsnitt samtidig. Så derfor så fungerer rett og slett ikke denne software-løsningen. Den vil fungere stort sett, bortsett fra hvis det kommer et kritisk avsnitt nøyaktig etter wild lock. Nøyaktig etter at verdien er hentet inn til registrene, men rett før den hopper på grunnlag av denne verdien. Er ikke denne god nok? Og i øvingsoppgavene så kommer det et par andre nye forsøk som er litt bedre. Og til slutt så kommer man fram til Peterson-algoritmen, som kom en gang på 80-tallet, som er en perfekt software-mytex-løsning. Men den er litt tungvint, og du trenger litt kode. Men den kan. Det kan man bruke. Men i praksis, sånn som med operativstemme og sånn som med Java-tråder osv., så bruker man metoder hvor man får hjelp fra Harvay. Og det sikrer i tillegg at man lokker databussen. Så de metodene er da enda bedre. I de softwareløsningene som vi har sett på, de krever litt kode. Og i tillegg så bruker de alle sammen bussy waiting. Bussy waiting er dette her med at man står og venter. Og da bruker man CPU-en. Man gjør NOP-institusjoner om og om igjen. Og det er en litt effektiv måte å vente på. Det kalles da generelt 'bussy waiting'.", "source": "lecture"}
