{"lecture_id": "os12del12", "chunk_id": "os12del12_0000", "start": 0.0, "end": 256.72, "token_count": 591, "text": "Hvis vi tenker oss at dette er CPU1... Og så har vi... skal vi se... sånn... En buss som går opp til Ramm her oppe. Her er Ramm. Og det som skjer hele tiden, er at her oppe i Ramm så har vi en adresse hvor vi har en variabel som heter'svar'. Og la oss si'svar nå er kanskje 10'. Så... Vi kan ta det første eksempelet først. Hvor vi bare har én institusjon her, som heter INK-L. INK-lung. Svar av... prosent. Altså det er én institusjon som øker den verdien. Da er det opplagt ikke noe problem hvis denne her kjører helt alene. Da vil vanligvis bare hente... I én institusjon så øker den da verdien. Men på en eller annen måte... Den kan ikke... Den må på en eller annen måte hente inn verdien her. Så verdien vil gå... På databussen, ned hit... Det er da en del av hele denne maskininstitusjonen INK med svar. Den henter inn verdien, øker med én, og legger den tilbake. I én enkeltoperasjon. Men da er det klart, da kan vi ha problemer her hvis... CPU2, den også... gjør den samme operasjonen. Og så er jo begge de to koblet på... Dette er buss. De er koblet på den samme bussen. Og de snakker med hverandre om og henter inn verdier. Men da er problemet hvis disse to CPU-ene ikke er koordinerte. De vil da operere samtidig. Og hvis verdien her oppe er 10, så vil begge de to hente ned verdien 10. Og den verdien vil da lagres i et register her nede. Vi lagrer det ikke eksplisitt i registeret. Den maskininstruksjonen som gjør dette, den må lagre et register, og så må de sende verdien inn i aluen osv. Den må i hvert fall kanalisere den tieren der inn i aluen, sånn at aluen øker den med én. Og så må den sende 11 tilbake. Men da er det klart... Da får vi allerede et problem hvis de gjør dette her. Helt samtidig. Ber om den tieren. Da kommer det en tier kjørende ned der. Disse bitene sendes over bussen. En tier inn her og en tier inn der.", "source": "lecture"}
{"lecture_id": "os12del12", "chunk_id": "os12del12_0001", "start": 218.46, "end": 396.96, "token_count": 573, "text": "og så må de sende verdien inn i aluen osv. Den må i hvert fall kanalisere den tieren der inn i aluen, sånn at aluen øker den med én. Og så må den sende 11 tilbake. Men da er det klart... Da får vi allerede et problem hvis de gjør dette her. Helt samtidig. Ber om den tieren. Da kommer det en tier kjørende ned der. Disse bitene sendes over bussen. En tier inn her og en tier inn der. Og så øker begge... Øker den til 11 med alu. Og så sender begge 11 tilbake. Her går det... Dette går ikke bra fordi at... Uansett hvilken som da kommer først tilbake... Uansett så vil 11 lagres her oppe. Og det som skulle ha skjedd, det er at 12 skulle ha blitt lagret. Fordi begge har lagt til. Og det er da... Det er da vi kommer inn med den smarte tingen at vi legger på Lokk... Det skulle stå lokk. Jeg vil legge på en lokk foran. Foran institusjonen. Og det som skjer da, er at da... La oss si den CPU1 gjør dette her først. Den lokker da hele databussen. Nå får ingen andre lov til å... endre på den variabelen. Det ville jo ikke gjelde. Men man sjekker at den ene variabelen der... Her skal ingen andre kunne... Den skal ingen andre kunne endre. Og det som skjer da, er at da får CPU1 i fred og ro utføre sin alun, øker fra 10 til 11, sender den tilbake på bussen, og denne her går opp til 11. Og så, i neste omgang, når den... Når den er ferdig med den ene institusjonen, så får CPU2 utføre sin institusjon. Den hadde kanskje prøvd å gjøre det samtidig, men så fant den ut at nei, databussen var lokket. Den var låst, så da måtte den vente litt. Og da begynner CPU2 på sin operasjon. Og den vil da, istedenfor å hente inn 10, så vil den hente inn 11. Og den får da resultatet 12, og så sendes det tilbake. Og så ble det tolv her. Og alt ble riktig. Så det går fint med...", "source": "lecture"}
