{"lecture_id": "os12del2", "chunk_id": "os12del2_0000", "start": 0.0, "end": 184.44, "token_count": 593, "text": "Det er oppgaver denne uken som går på Windows PowerShell. Og for dere som kjører Windows-laptoper, så... Så kan dere gjøre de aller fleste av oppgavene direkte. Men det er noen oppgaver med å lage nye brukere osv. Og så er det noen oppgaver med Windows Registry med å endre på innstillinger. Da... Kan det være greit for å være sikker på ikke å ødelegge noe på eget oppsett, så kan det være greit å bruke en Virtual Box vindus-VM, som mange av dere har brukt tidligere. Men det står instruksjoner her også på hvordan den kan installeres og settes opp. Videre er det en... Etter de PowerShell-oppgavene så er det oppgaver om det vi snakker om i dag. Og her ser vi... Et script sånn som dette her kan kjøres omtrent direkte i PowerShell. Så veldig mye er likt, fordi det er lagd alias i PowerShell som gjør mange av de samme kommandoene. Når vi først kan binde bæsjskrift, så kan det også mye på oss selv. Masse kan overføres direkte. Og så, etter hvert, så er det oppgaver i dag. Så er det javatrådoppgaver og diverse oppgaver rundt synkronisering. Og serialisering. Så er det blant annet noen litt mer vanskelige teoretiske oppgaver. Men det skal vi se på først. I forløsningene. Så temaet i dag er generell synkronisering. Vi skal spesielt se på synchronized i Java for å se hvordan vi kan synkronisere den Java-koden som vi hadde før påske, hvor man talte opp en saldo, og to tråder ødela for hverandre. Synkroniserer vi riktig, ser vi ofte at det ikke er tread safe. Det betyr at trådene kan ødelegge for hverandre. Synchronized er en metode som kan brukes for å synkronisere og gjøre et trådprogram tread safe. Så skal vi til slutt i dag se på deadlock. Det er noe som kan oppstå når man fortvilet prøver å synkronisere mange prosesser, og det gjør man typisk alt ved at de vet... Men hvis flere prosesser venter f.eks. i en ring, en sirkel, på hverandre, så kan det oppstå deadlock. Og da kommer ingen videre.", "source": "lecture"}
{"lecture_id": "os12del2", "chunk_id": "os12del2_0001", "start": 151.88, "end": 200.0, "token_count": 173, "text": "Synchronized er en metode som kan brukes for å synkronisere og gjøre et trådprogram tread safe. Så skal vi til slutt i dag se på deadlock. Det er noe som kan oppstå når man fortvilet prøver å synkronisere mange prosesser, og det gjør man typisk alt ved at de vet... Men hvis flere prosesser venter f.eks. i en ring, en sirkel, på hverandre, så kan det oppstå deadlock. Og da kommer ingen videre. Og det er et problem man må være klar over når man begynner å programmere og synkronisere tråder. Eller prosesser, for den saks skyld. Så det er... Det er temaet i dag.", "source": "lecture"}
