{"lecture_id": "os13del15", "chunk_id": "os13del15_0000", "start": 0.0, "end": 183.92, "token_count": 579, "text": "Og dette med å bruke et virtuelt minnerom, det kalles generelt paging. Og det er fordi man deler inn hver sin prosess, sitt virtuelle minnerom, i et antall sider. Så la oss si de forrige prosessene, da. De hadde 50 bite per side. Så hvis den besto av 500 bites, så ville de fått 10 sider. I MMU vil det bare stå hvor disse ti sidene ligger. Og da... Når vi organiserer ram, det virtuelle ram, i sider, eller pages på denne måten, så kan operativsystemet da dynamisk laste inn og ut disse sidene fra ram. Og det kan da types å være enheter på 4K, f.eks., En vanlig sidestørrelse er 4K. Og da deles alle programmer inn i biter av 4K, og så laster operativstemmet inn og ut disse bitene. Og på den måten så har jeg operativstemmet full kontroll over minibruken og kan dynamisk da endre tildelingen av ramm til alle prosesser. Et lite fiktivt eksempel på hvordan dette kan se ut. En page har størrelse 2 jentebites. Skal se senere hvorfor det må være akkurat 2 jenter. Typiske verdier er 1 lik 12 eller 13, sånn at du får sidestørrelse på 4 eller 8 kilobite. 4 kilobite er vanlig for X86-prosessorer. Det er ganske standard. Så... Så dette gjelder per prosess. Så vi har da en tabell... Hver prosess har en egen tabell. Og hvis du har én CPU, så er det jo bare én prosess som kjører av gangen. Så vi trenger egentlig bare å ha i MMU den ene tabellen for prosessen som kjøres. Når en prosess switches ut, så lagres da MMU-tabellen i PCB. Men her har vi en prosess med logisk minne, side 01234... Og MMU vil da være en tabell som sier hvor i det fysiske minnet disse sidene ligger. Så f.eks.... Her står det frame nummer... Eller virtuell side nummer 0 ligger i page nummer 1. Eller i frame nummer 1. Det logiske minnet kaller jeg pages. Og så er dette i fysisk minne - det er frames.", "source": "lecture"}
{"lecture_id": "os13del15", "chunk_id": "os13del15_0001", "start": 139.32, "end": 340.86, "token_count": 593, "text": "Når en prosess switches ut, så lagres da MMU-tabellen i PCB. Men her har vi en prosess med logisk minne, side 01234... Og MMU vil da være en tabell som sier hvor i det fysiske minnet disse sidene ligger. Så f.eks.... Her står det frame nummer... Eller virtuell side nummer 0 ligger i page nummer 1. Eller i frame nummer 1. Det logiske minnet kaller jeg pages. Og så er dette i fysisk minne - det er frames. Og i MMU så står det her at page nr. 0 ligger i frame 1. Og page nr. 1 ligger i frame 4. Enkelt og greit, bare en tabell som viser denne oversettelsen. Men det er veldig viktig at denne oversettelsen må være veldig hurtig. Så vi skal se litt i detalj på etter hvert hvordan... I en sånn pagetabell så har vi da en pagetable-entry for hver eneste side. Og det viktigste da er sidenummeret. Det er altså det nummeret her. Denne virtuelle siden. I hvilken fysisk frame ligger den? Men vi har også noen andre bits. F.eks. sånn at man kan sette skrive- og leserettigheter på minnet også. Per prosess og per page. Og så har man present-absent-bit. Det sier om... Det sier om denne siden faktisk ligger i det fysiske minnet. Hvis du står null her, så betyr det at den ligger bare på disken. Og da, hvis du ønsker... Hvis programmet ønsker å hente noe fra denne siden, så må man ut på disken og hente den. Og det er en såkalt page fault. Siden mangler, og må ut på disken og hente, og det tar veldig lang tid. Men hvis den er 1, så betyr det at siden er dirty eller har blitt endret. Og det betyr at hvis... Hvis den siden skal ut av ramm, så må verdien skrives til disk. Hvis den ikke har blitt endret og skal ut av ramm, så kan du bare droppe den. Men hvis endret-bit er 1, så er siden dirty og den må skrives til disk før den kan... Før den kan fjernes fra rammen. Så er det reference. Det brukes av pensing-algoritmer. Som velger hvilke sider som til enhver tid skal ha plass i rammen.", "source": "lecture"}
