{"lecture_id": "os13del21", "chunk_id": "os13del21_0000", "start": 0.0, "end": 173.4, "token_count": 599, "text": "Hvorfor legger man ikke mer lagringsplass i LNC i en GB? Det er et godt spørsmål, men... Kunne du ikke bare hatt enormt mye lagringsplass her? Og dette er et fysisk spørsmål. Man lager dette her så effektivt som mulig, men hvis du har... Én GB her inne, så... Eller la oss si du hadde én GB her, da, og ikke hadde noe L1, så... Da ville du straks hatt det problemet at det tok lengre tid, rett og slett fordi det er så mange... Én GB er enormt mange transistorer. Og det er jo fysiske systemer, dette her. Så det er derfor jeg vil ha L1-cash, L2-cash, L3-cash osv. Man skulle jo ønske at så mye som mulig var nær CPU-en, men der er det fysiske begrensninger, så alt kan ikke være nær CPU-en. Og de størrelsene man har på L1, L2 og L3 Cash, de har liksom blitt tilpasset og lagd sånn ut fra hardwaren. Hvordan kan man få det mest mulig effektivt? Og en grunn til at man da ikke lager L1-cash på én gigabyte, er at... Er at det... Stort sett så er det ikke én gigabyte med data som brukes hele tiden om og om igjen. Ut fra statistikk av hvordan programmet kjører, så har man funnet ut at sånn som et TLB... At det er 1 %... 99 % av tilfellene så treffer man med den TLB-en som ligger her, Med kanskje bare 500K med data. Helt tett opp. Og da er det bedre å ha disse 500K med data veldig tett i CPU-en, sånn at det går lynraskt når de skal inn til registrene. Og så heller ha én GB her ute med neste ledd. Men kanskje ikke så mye som én GB, men appetit megabyte i hvert fall. Så er det en sånn avveining. Hvis du skulle hatt én GB her, så måtte det være plass til alle, og da ville det tatt lengre tid å få et vilkårlig bite herfra inn til CPU-en. Så dette med størrelsen på L1, L2, L3 cash, de er nøye avveiet for å få det til å gå fortest mulig. Så kunne man tenke seg at man kunne kjøre alt til cash.", "source": "lecture"}
{"lecture_id": "os13del21", "chunk_id": "os13del21_0001", "start": 138.04, "end": 200.0, "token_count": 242, "text": "Men kanskje ikke så mye som én GB, men appetit megabyte i hvert fall. Så er det en sånn avveining. Hvis du skulle hatt én GB her, så måtte det være plass til alle, og da ville det tatt lengre tid å få et vilkårlig bite herfra inn til CPU-en. Så dette med størrelsen på L1, L2, L3 cash, de er nøye avveiet for å få det til å gå fortest mulig. Så kunne man tenke seg at man kunne kjøre alt til cash. Ja, man prøver å lage cash større og større, men det er mye dyrere. Og det krever mer strøm, så det er begrensninger på det òg. Men utviklingen av CPU-er har hele tiden vært sånn at man legger inn mer og mer cash. Det er sånn Wars Law har funket de siste årene. Man øker cashmengden for å få ting til å gå enda raskere.", "source": "lecture"}
