{"lecture_id": "os13del14", "chunk_id": "os13del14_0000", "start": 0.0, "end": 178.96, "token_count": 588, "text": "Som vi har argumentert for tidligere, så må alle de virtuelle adressene kunne knyttes til fysiske adresser. Som jeg nevnte, så kunne det skjedd ved Loading. Men det er både tidkrevende og tungvint og lite dynamisk. Så i alle moderne OS gjøres dette dynamisk mens programmet kjører. Og det gjør at man kan flytte inn og ut programmer og biblioteker... som operativstemme ønsker, når det vil for å kunne kjøre alle programmer mest mulig effektivt. Vi kunne hatt sånn at operativstemme oversatte mellom fysiske adresser og de logiske eller virtuelle. Men det ville gått altfor sakte. Man kan ikke ha kode som gjør det. Fordi disse operasjonene foregår hele tiden. Så dette må skje i brøkdelen av et sekund. Vi trenger hjelp fra hardware. Vi trenger en egen enhet, MMU, Memory Management Unit. Og dette er skissert et bilde av MMU-en. Vi så på den simulerte CPU-en at vi har en databuss, og det er da linjer med bits som går fra CPU-en og ut i ram. Den adressebiten, den oversettes av MMU. CPU-en sender ut en logisk adresse, så oversetter MMU-en til fysisk adresse. Så kobles den på databussen. Det er da linjer som går herfra og inn hit. Så trykker de linjene på... La oss si jeg har sendt meg adresse... MMU oversetter... La oss si logisk adresse 8 til fysisk adresse 1008. Så går 1008 ut hit. Så kobler man på RAM 1008 med bits... bang, bang, bang... inn her. Og dermed leses det som ligger i byte nummer 1008, og så sendes det tilbake til Zepperun. Og det skjer hver eneste gang man henter noe i RAM. Ja... Vi skal se på et lite eksempel, litt sånn fiktivt eksempel med program 1 og program 2. Som skal kjøres, for å se hvordan det kan se ut i praksis. Og etter at man har kompilert programmene, så er adressene logiske. Og da må man ha en MMU, eller en eller annen slags MMU-tabell, som oversetter de logiske, eller virtuelle, adressene til det fysiske. Da kan det f.eks. se sånn ut. Program 1, vi har kompilert det.", "source": "lecture"}
{"lecture_id": "os13del14", "chunk_id": "os13del14_0001", "start": 142.08, "end": 311.76, "token_count": 591, "text": "Ja... Vi skal se på et lite eksempel, litt sånn fiktivt eksempel med program 1 og program 2. Som skal kjøres, for å se hvordan det kan se ut i praksis. Og etter at man har kompilert programmene, så er adressene logiske. Og da må man ha en MMU, eller en eller annen slags MMU-tabell, som oversetter de logiske, eller virtuelle, adressene til det fysiske. Da kan det f.eks. se sånn ut. Program 1, vi har kompilert det. Da står det i program 1, f.eks. på linje 24, så står det \"-low 32\". Det betyr å laste inn i CPU-en det som ligger på linje 32 i ram. Som i dette tilfellet er tallet 671. Så har vi noe tilsvarende i program 2. På linje 28 i program 2 så står det kanskje \"-low 36\". Det betyr å laste inn denne 712, som ligger på linje 36 i ram. Når disse skal kjøres, så legges program 1 og program 2. De loads inn i ramm. Og her har de fått en plassering. Men da ser vi at ingen av disse virtuelle adressene vil være de riktig fysiske. F.eks. program 1 har tilfeldigvis havnet der på 100. Program 2 har havnet på 150. Når Program 1 sier \".load 32\", så mener det egentlig load 132. Og det er da 132 må sendes ut på minibussen, sånn at programmet får denne verdien. Men husk at load 32, når den skal kjøres, først må det lasses inn i CPU-en. Så utføres load 32. Og da vil CPU-en, ved hjelp av MMM-en, oversette 32 til... Og så sendes det tilbake hit. Så da kunne man jo tenke seg at man hadde en tabell som ordner dette her. Jeg ser spørsmål i chatten. Logiske adresser og er de samme som virtuelle? Ja, jeg bruker det litt om hverandre. Logiske eller virtuelle adresser. Hovedpoenget er at de må oversettes til fysiske adresser. Sånn så tabellen ut som dette her. For program 1 så kunne vi si OK, adresse 24, den mappes over til 124. For program 2, adresse 28, mappes over til 178.", "source": "lecture"}
{"lecture_id": "os13del14", "chunk_id": "os13del14_0002", "start": 273.56, "end": 356.4, "token_count": 299, "text": "Så da kunne man jo tenke seg at man hadde en tabell som ordner dette her. Jeg ser spørsmål i chatten. Logiske adresser og er de samme som virtuelle? Ja, jeg bruker det litt om hverandre. Logiske eller virtuelle adresser. Hovedpoenget er at de må oversettes til fysiske adresser. Sånn så tabellen ut som dette her. For program 1 så kunne vi si OK, adresse 24, den mappes over til 124. For program 2, adresse 28, mappes over til 178. Men det er klart, da hadde vi jo plutselig en tabell som var like stor som hele ramm. Så dette er helt umulig. Og altfor minnekrevende. Men vi kunne i stedet dele opp det logiske minnet i pages. Så kunne vi ha en side med 50 adresser. Og så kan vi si program 1 starter på adresse 100, og program 2 starter på adresse 150. Og dermed har vi bare én faktor som må legges til. For da sier vi at program 1 ligger på denne siden, og alle adresser må da bare... Man må legge på 100. Og det er i praksis sånn... Omtrent sånn MMU virker.", "source": "lecture"}
