{"lecture_id": "os13del3", "chunk_id": "os13del3_0000", "start": 0.0, "end": 193.2, "token_count": 598, "text": "Tidligere så har vi sett på synkronisering. Vi har hele tiden... Det vil si, aller først så så vi på det å multitasking og parallellisere. Få ting til å gå fort i parallell. Og stort sett så går det veldig fint. Så bare å kjøre på i parallell, så sant det er mulig å parallellisere koden. Så kom jeg til noen tilfeller hvor man må serialisere koden. Hvor det er rett og slett ødeleggende at kode kjører i parallell. Og det er da typisk hvis man har en felles ressurs som to eller flere tråder jobber opp mot. Da kan de ødelegge for hverandre. Så et system må være tread safe. Det betyr at man ikke må ha tråder som ødelegger for hverandre. Og da må man serialisere og synkle. Og vi så foregang på forskjellige typer serialisering. Forskjellige metoder for å gjøre det. Bl.a. Mutex og semaforer, monitorer... Dette er teknologier og egentlig tilbud fra operativsystemet til programmereren for å hjelpe til å serialisere. I prinsippet så er det samme ting de oppnår. Men f.eks. monitorer sånn som vi så på i Java, de er enklere å forholde seg til. Det var én enkel metode som man kunne legge rundt en hel blokk, som den synkroniserte metoden. Så den ville da synkronisere hele systemet på en veldig enkel måte. Å bruke mutexer direkte, og også semaforer, er litt mer komplisert. Så dette er på en måte forskjellige tilbud fra operativstemme til programmerere for å kunne serialisere. Men når man serialiserer på denne måten med mutexer, og tvinger prosesser til å vente på hverandre, så får man et problem med at deadlock kan skje. Og det er tre klare kriterier som må være tilfredsstilt for at deadlock skal oppstå. Så hvis man klarer å unngå alle disse tre kriteriene, så kan man si at ok, da unngår jeg deadlock. Men samtidig så er dette gjerne noe man ønsker å få til i et program. Og da må man kode. Sånn at deadlock ikke oppstår. Men det første kriteriet er at man må ha en eller annen form for mutex. Altså man må ha ressurser som ikke kan deles.", "source": "lecture"}
{"lecture_id": "os13del3", "chunk_id": "os13del3_0001", "start": 159.12, "end": 358.48, "token_count": 595, "text": "for at deadlock skal oppstå. Så hvis man klarer å unngå alle disse tre kriteriene, så kan man si at ok, da unngår jeg deadlock. Men samtidig så er dette gjerne noe man ønsker å få til i et program. Og da må man kode. Sånn at deadlock ikke oppstår. Men det første kriteriet er at man må ha en eller annen form for mutex. Altså man må ha ressurser som ikke kan deles. Hvis alle ressurser kan deles hele tiden, uten noe problem, så vil ikke deadlock oppstå. Så må man også ha et kriterium at en prosess kan beholde sin ressurs mens den venter på andre. Også at en prosess ikke kan tvinges til å gi opp sin ressurs. Hvis disse kriteriene er oppfylt, så kan deadlock oppstå. Og vi kan få deadlock ved sirkulær venting. Vi skal se hva det betyr. Ja... Her er et enkelt eksempel på deadlock. Hvor... Generelt så kan man få deadlock hvis to eller flere prosesser venter på hverandre. Og i det eksempelet her så ser vi at vi kjører prosess A og prosess B. Og de gjør sånn de skal vente S1 for å vente på en ressurs, og signal S1 her nede for å avgi den ressursen. Hvis både Prosess A og Prosess B ønsker å få tak i ressurs S1 og S2... Og Prosess A sånn tilfeldigvis så gjør Prosess A først en wait på S1... Mens Prosess B gjør wait på S2. Og så, mens den venter på S1, så ønsker den også å vente på S2. Den vil også ha den ressursen. Og samtidig gjør... Og da vil vi få en låst situasjon. Da vil vi få en låst situasjon hvor prosess A venter på at prosess B skal release S2, for den har fått tak i SO. Den har nøkkelen her til SO. Og tilsvarende venter Prosess B på at Prosess A skal release essay. Kanskje de står her med en sånn... Med busy waiting. Står og spinner og venter og venter. Og dette kalte seg en deadlock. Den vil aldri løse seg opp. Eksempel én er jo kanskje enklere. Prosess 1 venter på P2. P2 venter på P3, og P3 venter på P1. De bare venter på hverandre.", "source": "lecture"}
{"lecture_id": "os13del3", "chunk_id": "os13del3_0002", "start": 327.64, "end": 435.6, "token_count": 424, "text": "Den har nøkkelen her til SO. Og tilsvarende venter Prosess B på at Prosess A skal release essay. Kanskje de står her med en sånn... Med busy waiting. Står og spinner og venter og venter. Og dette kalte seg en deadlock. Den vil aldri løse seg opp. Eksempel én er jo kanskje enklere. Prosess 1 venter på P2. P2 venter på P3, og P3 venter på P1. De bare venter på hverandre. Det kan være en sånn semafor som dette her, men det kunne også være sånn som vi så på forrige gang, at prosess 2 skal være ferdig med noe i koden før prosess 3 går videre osv. Og dette er sånt som kan oppstå i den virkelige verden også. Jeg husker veldig godt at jeg var ute og kjørte bil, og så kom jeg i et kryss hvor man har vikeplikt fra høyre. Og da hadde jeg tidligere snakket om dette på forelesning, at jo, hvis kommer det et kryss med fire biler som skal inn, og det var vanlig virkeplikt, så... Og da var det sånn at jeg ventet på den som sto ved siden av fra høyre. Den ventet på den som sto ved siden av fra høyre igjen, osv. Rundt hele krysset. Så alle sto og ventet på hverandre. Og jeg var den eneste, kanskje av bilistene, som jublet... Yes! Deadlock! De andre tenkte kanskje ikke så nøye over det, men akkurat denne situasjonen er det som skjer i programmer. Hvor de venter på hverandre, og så kan en deadlock-situasjon som det oppstå...", "source": "lecture"}
