{"lecture_id": "os13del6", "chunk_id": "os13del6_0000", "start": 0.0, "end": 184.86, "token_count": 594, "text": "Minnepyramiden. Den har vi også sett på videre. Dette er det veldig viktig å hamse i. Vi starter helt innerst her med registeret. Og her... Registrene er ekstremt hurtige. Og så er det altså med avstand. Registrene ligger inne i CPU-en. Når man kopierer mellom registrene på mindre enn et nanosekund... Altså typisk på én eller to klokkesykler... Så kan man kopiere mellom registrene. Mens LNCash er da fortsatt SRAM. Det er på en måte samme teknologi, men det ligger litt lenger ut, så det tar litt lengre tid. Og så kommer det enda lenger ut El2Cash. El3Cash er gjerne hakket utenfor der igjen også. Så kommer man ut til ramme- eller internminet, og der ser vi at det er en fakta på minst ti inn til registrene. Det er denne forskjevnen som gjør at cash er så viktig. Man klarer rett og slett ikke å få inn data fort nok til CPU-en uten å bruke cash. Så kommer vi et hakk ut til disker. SolidState-disker. Skal se mer på det senere. Har random axs på samme måte som ram. At du kan ta like lang tid å hente en hvilken som helst bite, men det går mye saktere. Det er en fakta på i hvert fall 1000 i forhold til ram. Og så har du kanskje grovt sett en fakta på 1000 til igjen ut til fysiske harddisker som spinner rundt. Så der går det veldig mye saktere.  Internminnet er... Eller RAM er egentlig bare et kjempesvært array av bites med en nummerering. Så vi ser her nede, adresse 0... Her er det 8-bit som utgjør én bite. Og så er det adresse 1 osv. oppover. Og her ser du 42... Dette er to i 32. Så dette er... Fire giga med adresser. Og dermed har du fire gigabyte med ram i dette RI-et. Så det er viktig å huske... Det er bare ett stort RI som programmerer, så kan vi tenke på det. Og med bites som ligger etter hverandre. Så har vi sett tidligere hvordan f.eks. vi har lagret en... En 64-bit... Så vi lager det som en integer som trenger da fire bite.", "source": "lecture"}
{"lecture_id": "os13del6", "chunk_id": "os13del6_0001", "start": 137.56, "end": 201.0, "token_count": 180, "text": "Og her ser du 42... Dette er to i 32. Så dette er... Fire giga med adresser. Og dermed har du fire gigabyte med ram i dette RI-et. Så det er viktig å huske... Det er bare ett stort RI som programmerer, så kan vi tenke på det. Og med bites som ligger etter hverandre. Så har vi sett tidligere hvordan f.eks. vi har lagret en... En 64-bit... Så vi lager det som en integer som trenger da fire bite. Og da setter man typisk av de fire bitene etter hverandre til en variabel. Det er en litt sånn teknikalitet. Men i virkeligheten så er det bare bite som ligger etter hverandre i et svært ærøy.", "source": "lecture"}
