{"lecture_id": "os13del17", "chunk_id": "os13del17_0000", "start": 0.0, "end": 197.7, "token_count": 591, "text": "Det er en figur fra Tallbaum, og det viser en oversettelse fra det virtuelle adresserommet til det fysiske adresserommet. Her er det veldig små størrelser. Vi har 32K fysisk minne. 64K virtuelt minne. På moderne maskiner har man opplevd mye større... Større både fysisk og virtuell minne, men prinsippene er akkurat det samme. Så her ser vi at... Hvor mange er det? Åtte av disse virtuelle sidene er mappet til fysisk minne. Det er akkurat de samme tabellene som vi hadde tidligere. Her nederst her er page nummer null. Vi ser at den ligger i fysisk frame nummer to. Så det går en pil herfra og så opp hit. Og da må man... Herfra inn til MMU-en, så må MMU-en lynraskt oversette den min-adressen til den riktige i den fysiske. Og det er det neste slide viser hvordan man gjør. Dette viser da på en måte den fysiske kablingen i MMU som gjør at et MMU-oppslag går på faktisk brøkdelen av en klokkesykkel. Fordi det er ikke en... Det regnes ikke ut ved hjelp av CPU-institusjoner. Det er direkte kabling. Og måten man får det til på, er at man har en innkommende adresse. Vi kan se konkret på dette eksempelet her. Har vi en innkommende adresse 8196... Vi har tolv bit her. Det betyr at vi har en... Hver side har to i tolvte adresser. Og to i tiende er 1024, så to i tolvte er 4096. Så disse tolvbitene her utgjør da 4096 adresser. Og det er liksom internt på siden hvilken adresse det er. Men så... I det virtuelle adresserommet har vi da i tillegg fire bit. Og de bitene sier hvilken side i det virtuelle adresserommet det er. Og 0100, det er da dette... Det vil da være null, nei, enere. Og dette er toere. Så dette er tallet to. Så vi ser at den peker her. Det er det virtuelle side nummer to. Og det betyr at... Ja... Dette vil da bli to ganger 4096. Det er da 8192. Du kan se på de tallene.", "source": "lecture"}
{"lecture_id": "os13del17", "chunk_id": "os13del17_0001", "start": 147.7, "end": 342.02, "token_count": 591, "text": "Men så... I det virtuelle adresserommet har vi da i tillegg fire bit. Og de bitene sier hvilken side i det virtuelle adresserommet det er. Og 0100, det er da dette... Det vil da være null, nei, enere. Og dette er toere. Så dette er tallet to. Så vi ser at den peker her. Det er det virtuelle side nummer to. Og det betyr at... Ja... Dette vil da bli to ganger 4096. Det er da 8192. Du kan se på de tallene. Jeg har skrevet det i detalj i forelesningsresultatene hvordan man oversetter det. Så prøv å gå gjennom det. Det er en typisk liten eksamensoppgave. Men dette er for at dere virkelig skal se mekanismen i hvordan dette oversettes. Så det som skjer, er at her har vi side to. Og de neste tolvbitene er bare hvor i adresserommet det er. Og her står det fire... I adresserommet. Adresse nummer fire. Men så ser vi, da har vi det smarte, at her er MMU-tabellen. Og da er det bare 110... Den peker til... Nei, 2. Den peker til 110. Her står det 110. Så da tar man de bitene her som er i page nummer to. Så står det 110. Og det er da... Det er da tallet seks. Og så limer man da bare det tallet seks som sier hvilken frame det er. Så det sier fysisk frame nummer seks. Og det er akkurat det som vi så her nede. Her er vi page nummer to. Page nummer null, én, to. Page nummer to peker på fysisk adresse nummer seks. Og det gjøres ved at man limer den... Eller kabler, da. 110, sånn at den kommer først. Og så sendes da bare... Hele denne her sendes videre til databussen. Og det er på magisk vis... Det er da den riktige utgående fysiske adressen. Men vi har bare lint på et på en måte seks ganger 4096. Og det ble 24576. Og så kommer det firetall i tillegg. Firetallet er bare offset hvor i denne siden som den adressen vi skal ha tak i, ligger. Så dette viser hvordan man... Ved å bare kable dette helt riktig med bit for bit,", "source": "lecture"}
{"lecture_id": "os13del17", "chunk_id": "os13del17_0002", "start": 302.1, "end": 352.82, "token_count": 163, "text": "Og så sendes da bare... Hele denne her sendes videre til databussen. Og det er på magisk vis... Det er da den riktige utgående fysiske adressen. Men vi har bare lint på et på en måte seks ganger 4096. Og det ble 24576. Og så kommer det firetall i tillegg. Firetallet er bare offset hvor i denne siden som den adressen vi skal ha tak i, ligger. Så dette viser hvordan man... Ved å bare kable dette helt riktig med bit for bit, så får man en hardware-bit, altså MMU, som gjør denne oversettelsen i løpet av brøkdelen av et skudd.", "source": "lecture"}
