{"lecture_id": "os13del8", "chunk_id": "os13del8_0000", "start": 0.0, "end": 202.76, "token_count": 599, "text": "Som kunne lagres i registeret. Og det har vi sett på tidligere. At vi har brukt Move f.eks. for å flytte noe fra RAM og inn i de interne registrene i CPU-en. Og da har vi brukt registeret sånn som prosent-RSP, som er da en peker... Prosent-RSP peker til toppen av stacken. Så innholdet av det registeret er da en... Er da en adresse som peker til toppen av stacken. Altså toppen av stacken her, det er én spesifikk adresse. Det er et til spørsmål i chatten her. Ja. GDDR... Ja, det er vel... Sånn GPU-ram... Det er jeg ikke sikker på. Men det høres veldig sånn ut. At det er grafikkram... Jeg kan sjekke ut det i pausen. Ja... Jo, et annet eksempel på adresserom, det er sånn som IP-adresser. Da har vi alle adresser fra 000 til 255, 255, 255, 255. Da er det en spesifikk betydning av adresser. Alle IP4-adresser må ligge innenfor dette adresserommet. Og det er fordi man måtte begynne med IPV6, fordi det var til slutt ikke nok adresser i adresserommet. Samme problemstillingene har man i internminet. Generelt så er det veldig enkelt adresserom for internminet. Det går bare fra null til maks. Men så trenger man å... Og ha et register for å lagre en adresse. Til å begynne med hadde man 16-bits CPU-er. Og da hadde du en registerstørrelse på 16 bit. Og da... Hvis du da skulle lagre alle adressene, så er det i 16-bit bare plass til to i 16-adresser. Og det er 64K. Og derfor er det mange sånne gamle computere... Kommodore 64 osv. For da hadde de et adresserom som var på 64 000. Og der kunne man lagre 64 kB, og det var punktet. Etter hvert så fikk man 32-bitsregisteret. Og da hadde man to i 32. adresser. Og det er fire. Det var også et sånt problem med 32-bits CPU-er. Hvis man kjørte Linux og hadde mer enn 4 GB ram, så fikk man straks et problem. Mange av de CPU-ene støttet ikke det å bruke 4G-ram.", "source": "lecture"}
{"lecture_id": "os13del8", "chunk_id": "os13del8_0001", "start": 160.56, "end": 376.12, "token_count": 596, "text": "som var på 64 000. Og der kunne man lagre 64 kB, og det var punktet. Etter hvert så fikk man 32-bitsregisteret. Og da hadde man to i 32. adresser. Og det er fire. Det var også et sånt problem med 32-bits CPU-er. Hvis man kjørte Linux og hadde mer enn 4 GB ram, så fikk man straks et problem. Mange av de CPU-ene støttet ikke det å bruke 4G-ram. Så etter hvert kom det 64-bits-registeret, Selv to opphøyde 48 gir 256 terabyte. Så det er mer enn nok for rammedelen. Så da er det ikke noe problem med antall bit i registrene. Men generelt så må du da kunne ha et register som kan lagre alle adressene i Iran. Virtuelt adresserom... Vi deler da... Vi har et fysisk adresserom. Det er liksom alle adressene fra null til maks. Men generelt så er det ikke plass i alle programmer i internminnet på en gang. Hvis du har veldig mange programmer, så må de til en viss grad lastes inn og ut. Så er det veldig nyttig å kunne ha et virtuelt adresserom, for at man da dynamisk kan velge hvilke biter av et program som er med. Sånn man organiserer det, er at hvert enkelt program får et adresserom fra null til maks. F.eks. til 4G, hvis det er 32-bits adresser. Hver prosess lokalt tror at den har tilgang til alt dette minnet. Den har et kjempesvært adresserom. Men i virkeligheten så... Så ligger noe av dette minnet i ramm, og andre ligger på disken. Eller andre deler er ikke i bruk i det hele tatt. Så disse logiske adressene, de brukes overalt hvor... som programmet refererer til nå, f.eks. en institusjon som dette... Move1023 til AL. Det sier move det som ligger i minneadresse 1023, inn i registeret AL. Men 1023 er da den virtuelle adressen. Det er ikke den faktisk fysiske adressen. Opprinnelig, i de aller første datamaskinene, brukte man ikke et virtuelt adresserom. Og da var 1023 bite nummer 1023 i ramma. Men nå har vi et system hvor alle disse adressene hele tiden oversettes til fysiske adresser.", "source": "lecture"}
{"lecture_id": "os13del8", "chunk_id": "os13del8_0002", "start": 330.0, "end": 441.0, "token_count": 329, "text": "som programmet refererer til nå, f.eks. en institusjon som dette... Move1023 til AL. Det sier move det som ligger i minneadresse 1023, inn i registeret AL. Men 1023 er da den virtuelle adressen. Det er ikke den faktisk fysiske adressen. Opprinnelig, i de aller første datamaskinene, brukte man ikke et virtuelt adresserom. Og da var 1023 bite nummer 1023 i ramma. Men nå har vi et system hvor alle disse adressene hele tiden oversettes til fysiske adresser. Og dette gjøres da av MMU, som vi skal se på i detalj. Memory Management Unit. Og siden dette gjøres ved... Om ikke hver institusjon, så hver eneste gang man adresserer RAM i det hele tatt, så må denne oversettelsen gjennomføres. Og det betyr at det må gå ekstremt raskt, for... For dette skjer hele tiden. Så alle programmer som snakker med minnet, de må få sin virtuelle adresse oversatt til den fysiske, og det skjer... Og da har man ikke noe tid til å bruke CPU-sykler på å få dette til. Så dette må nærmest lagres i hardware. Og det er nettopp det MMU er. Det er hardware som oversetter fra virtuelle adresser til fysiske adresser.", "source": "lecture"}
