{"lecture_id": "os13del12", "chunk_id": "os13del12_0000", "start": 0.0, "end": 239.72, "token_count": 597, "text": "Ja, jeg tenkte jeg kunne vise det i praksis, men bare først skissere hva som skjer her. Dette er en simulering jeg lagde en gang. Så det er et C pluss pluss-prosjekt. Og da lagde jeg et bibliotek som gjorde noen beregninger. Genererte noen tilfeldige tall og regnet ut standard og vik osv. Det jeg gjorde da, var at jeg lagde et C++-library. Altså mitt eget bibliotek. Og det G++ er en C++-kompilator. Så det jeg gjorde da først, var å kompilere kildekoden til biblioteket. Og da lages det kalktools.o og roundtools.o. Og så er ar en kommando for å lage et bibliotek. Og det biblioteket jeg lagde, er libtools.a. Og så hadde jeg en simulering som jeg kompilerte. Akkurat tilsvarende som vi gjorde tidligere. Lage maskinkode. Og så til slutt så denne operasjonen her nede... Den lager en eksekverbar fil-sim ved å lime sammen alle programmene. Og her er det også noen kommandoer som gjør at man limer inn det biblioteket her oppe. Så i praksis det jeg gjorde, var at jeg laget mitt eget lille bibliotek her. Og så, den siste operasjonen, linket det sammen. Og all koden var det her inne. Og så kan den lastes inn og kjøres. Så vi kan... Vi kan se på hvordan det ser ut i praksis. Så her under 'Tools' så har jeg da de verktøyene. For eksempel 'Calc Tools'. Det er da en metode som regner ut varians. Og så har jeg en... Bare et lite program som... Skal vi se... Sånn, kanskje. Dette er et lite skript som kompilerer. Så først kompileres de to programmene, og så lager jeg et bibliotek. ved å eksplisitt kjøre det. Sånn. Nå har jeg lagd en bibliotekfil. Og den... Jeg tar den her. Libtools.a. Det er selve bibliotekfilen som en nå skal bruke når jeg skal kjøre. Så... da kan jeg gå til selve simuleringen. Her har jeg også et lite program som kompilerer. Den komplerer selve simuleringen og noen andre hjelpeprogram. Og så her linkes det sammen til en simulering.", "source": "lecture"}
{"lecture_id": "os13del12", "chunk_id": "os13del12_0001", "start": 180.0, "end": 423.82, "token_count": 580, "text": "ved å eksplisitt kjøre det. Sånn. Nå har jeg lagd en bibliotekfil. Og den... Jeg tar den her. Libtools.a. Det er selve bibliotekfilen som en nå skal bruke når jeg skal kjøre. Så... da kan jeg gå til selve simuleringen. Her har jeg også et lite program som kompilerer. Den komplerer selve simuleringen og noen andre hjelpeprogram. Og så her linkes det sammen til en simulering. Så jeg skal gjøre det her. Jeg skriver bæsj minus 6, for da får jeg se eksplisitt hva som skjer. Nå har jeg lagd en simulering. 27 000 bites. Og så kan den simuleringen kjøre. Lastes den inn i minnet, inkludert biblioteksfilene? Så skal jeg prøve å gjøre det samme på en litt annen måte. Det jeg skal gjøre da, er... Nå har jeg en... S-Tools.  Den her har jeg i de samme bibliotekene, men her skal jeg vise hvordan man lager et dynamisk bibliotek. Det er veldig mye av det samme. Det ligner veldig, men du ser... Dynamisk bibliotek under Linux så heter de.so. I Windows heter det DLL. Dynamical Linkable... Ja, hva er det det heter...? DLL... Dynamical Linked Library heter det. Så hvis jeg kjører dette, så lager jeg da et dynamisk bibliotek. libstools.so. Så... da kan jeg... gå hit, hvor jeg har det dynam... Det dynamiske. Og så kan jeg... Complere med det dynamiske biblioteket. Og da ser det veldig likt ut. Jeg legger på en minus L-tools der. Og så er det nå klart til at jeg kan kjøre den simuleringen i stedet. Akkurat den går litt fortere. Det er ikke noen forskjell i koden. Det er bare en løkke som er mindre her. Det ser jo veldig likt ut når jeg kjører, men det som er en viktig forskjell her, er at når... I det andre tilfellet her, når jeg starter denne her som bruker et dynamisk bibliotek, så lastes det biblioteket inn når jeg kjører det. Og det kan også... Da kunne jeg også lage andre simuleringer. Som bruker akkurat det samme biblioteket. Vi kan se at det er en liten forskjell.", "source": "lecture"}
{"lecture_id": "os13del12", "chunk_id": "os13del12_0002", "start": 387.02, "end": 490.0, "token_count": 328, "text": "Det er bare en løkke som er mindre her. Det ser jo veldig likt ut når jeg kjører, men det som er en viktig forskjell her, er at når... I det andre tilfellet her, når jeg starter denne her som bruker et dynamisk bibliotek, så lastes det biblioteket inn når jeg kjører det. Og det kan også... Da kunne jeg også lage andre simuleringer. Som bruker akkurat det samme biblioteket. Vi kan se at det er en liten forskjell. Hvis jeg nå tar LS minus L på SIM, så ser vi at den er på 26.68. Mens den første simuleringen, den er på 27.88. Så du ser her, det er en forskjell på én kilobite. I dette tilfellet er det en statisk lenke. Så da er all koden fra biblioteket ligger fysisk inne i den kjørbare filen. Mens her så lastes den kjørbare... Det dynamiske biblioteket lastes dynamisk. Og dermed ser vi at koden er litt mindre. Så hvis vi går tilbake til slidene... I det andre tilfellet hadde jeg et dynamisk bibliotek som ble lastet inn når jeg kjørte koden. I det første tilfellet så lå alt inni her. Og dermed så var den 1K søre den koden.", "source": "lecture"}
