{"lecture_id": "os13del16", "chunk_id": "os13del16_0000", "start": 0.0, "end": 185.08, "token_count": 591, "text": "TelB, Translation Look-Aside Buffer, det er en viktig bit. Og i CPU-en så har vi L1 og L2 Cash for ramm. Men da snakker vi hele tiden om kode og variabler. Men vi har det samme for MMU, fordi MMU må gå så raskt. Så har man TLB, som er en cashbit spesielt for MMU-adressene. Og som et eksempel, da... Hvis man har en prosess som bruker 100 MB, så vil det gi 4 kB med sider. Nei, så vil det med 4 kB sider... Altså med 1 lik 12. Så har vi 4 kB størrelse på sidene. Det vil bety omtrent 25 000 sider, så vi ser det blir fort veldig mange... En sånn topp-L blir fort veldig stor. En 4 GB-prosess har 1 mill. sider i MMU. Og da får man ikke plass til å lagre dette inne i CPU-en. Der er det bare et begrenset antall registre. Så dermed så vil MMU være med også da... Den vil i utgangspunktet ligge i ramm, men så vil du ha noe i cash. TLB-en er da den innerste delen av cashen som de... som er raskest å treffe. Så TLB er... er da hurtigcash for MEU. Og den vil da bare inneholde en bitte liten del av pagedabellen, men heldigvis er det ofte den som treffes på. Akkurat som med annen type cash. Bruker man ofte de samme sidene om og om igjen, sånn at da treffer man ofte på den oversettelsen. Hvis man ber om en adresse som ikke ligger i TLB, så får man en såkalt TLB-miss eller en soft-miss. Det tar vesentlig lengre tid enn om den ligger i TLB, for da må man ut lenger ut i cash, eventuelt helt ut i ramm for å hente denne siden. Dette er bare noen eksempler på sånn typisk TLB-ytelse. Størrelse... En cash-linje... Det er der en bit av cash... Altså den minste biten av cash er typisk på 64 bytes. Og TLB-er kan være sånn mellom 16 000 og 4000 linjer. Eller mellom 1 og 256 kilobytes. Så det er relativt... Men det som er viktig, oppslagstiden er ekstremt hurtig.", "source": "lecture"}
{"lecture_id": "os13del16", "chunk_id": "os13del16_0001", "start": 144.0, "end": 283.0, "token_count": 521, "text": "for da må man ut lenger ut i cash, eventuelt helt ut i ramm for å hente denne siden. Dette er bare noen eksempler på sånn typisk TLB-ytelse. Størrelse... En cash-linje... Det er der en bit av cash... Altså den minste biten av cash er typisk på 64 bytes. Og TLB-er kan være sånn mellom 16 000 og 4000 linjer. Eller mellom 1 og 256 kilobytes. Så det er relativt... Men det som er viktig, oppslagstiden er ekstremt hurtig. Dere kan gå i underkant av en klokkesykkel og slå opp. Det er hardware-kablet, så man gjør ikke noen instruksjoner og regner noe. Man kabler adressene direkte. Hvis det er en TLBM-miss, så kan det fort gå mange klokkesykler for å hente den, avhengig av om den er i cash eller i ram. Det som er veldig fint med dette, er at TLB-misfrekvensen statistisk er veldig liten. Stort sett så bruker man de samme adressene om og om igjen, og de ligger da i TLB. Så noe sånt som dette her kan det se ut. Vi har sett tidligere at vi har level 2-cash også level 3-cash inne på prosessoren. Og så har vi Ram her ute. Så tidligere har vi sett at vi har... LN-cash for data og for instruksjoner. Sånn at når... Ofte så henter man de samme instruksjonene, de samme dataene, om og om igjen, og det ligger veldig nære CPU-en, og dermed går det tigangs så raskt som om man skulle hente det ut til dem. Helt det samme er det for MMU. Og da har vi en telbeg LN-cash her inne. Og dette er telbn som vi snakker om. Her ligger hurtigoppslagene for... Så 99 % av tilfellene så treffer man på et LB, og da går oversettelsen fra virtuelt minne til fysisk minne veldig raskt.", "source": "lecture"}
