{"lecture_id": "os13del5", "chunk_id": "os13del5_0000", "start": 0.0, "end": 201.12, "token_count": 597, "text": "Internmin og cash. Vi har vært borti både internmin og cash tidligere i en del sammenhenger. Men vi skal nå se spesifikt på det som spesielt har med ramme å gjøre. Ikke så mye på cash, men vi skal se hvordan ram oppfører seg, Hva skjer når programmer lager store RA og bruker store mengder ram, og hvordan organiseringen av ram, ikke minst hvordan det skjer i operativsystem. Og jevnt så skjer det i nært samarbeid med hardware. Det er mange hardware-spesifikke instruksjoner og konstruksjoner. Ikke minst... MMU, som er lagd i hardware for at det å bruke ramm skal gå fort. Og veldig mye av dette skyldes at ramm i utgangspunktet er relativt tregt. Cash er mye raskere, eller S-ramm er mye raskere enn D-ramm. Så det har vi sett på tidligere. Vi har da lagt inn cash for at man skal hurtigere kunne snakke med RAM. Men utgangspunktet RAM - Random Access Memory... Det høres ut som et litt rart begrep - Random Access. Men hovedpoenget med begrepet Random Access er at... Det er minnet hvor det går like fort å hente ethvert bite, uavhengig av hvor det ligger. Så hvis du skal hente bite nummer 1000, så... Med ram eller Random Access så betyr det at det går like fort å hente bite nummer 1000-1000. Uansett hvor det ligger i ram, så går det like fort å hente det. Og det er i og for seg riktig for en standard konstruksjon av ram, men i praksis så vil det ta forskjellig tid å hente en gitt bite. F.eks. en variabel svar som man har i et C-program. Hvis man skal gå ut i ram og hente den, så vil det være forskjellig hvor lang tid det tar. Det er først og fremst pga. cash. Hvis du nylig har hentet den verdien, så vil den ligge i cash. Og cash er hurtigminne, og da går det hurtigere å hente. Sånn sett er det ikke random access i forhold til om du henter en variabel eller en bite som ikke har vært i minnet på lang tid. Da vil det gå raskt å hente den. Et annet tilfelle vi har hvor det er forskjell på tiden,", "source": "lecture"}
{"lecture_id": "os13del5", "chunk_id": "os13del5_0001", "start": 175.72, "end": 335.92, "token_count": 586, "text": "Det er først og fremst pga. cash. Hvis du nylig har hentet den verdien, så vil den ligge i cash. Og cash er hurtigminne, og da går det hurtigere å hente. Sånn sett er det ikke random access i forhold til om du henter en variabel eller en bite som ikke har vært i minnet på lang tid. Da vil det gå raskt å hente den. Et annet tilfelle vi har hvor det er forskjell på tiden, det er med såkalt nummanoder. Hvis du har servere som har... Mange CPU-er, altså sånn titalls CPU-er, sånn som noen av de vi har sett på, med 48 CPU-er. Eller sånn som den serveren som dokkecontainerne kjører i, Linux-VM-ene, som vi kaller de, den har 60 CPU-er eller noe sånt. Den er da... Den har da et system av numanoder. Og det betyr at det er en slags cluster av CPU-er. Som tilhører spesielle noter. Og disse notene har da ram som ligger nærmere de notene. Rent og slett fysisk nærmere, sånn at de har raskere aksess. De har en egen minnebuss ut dit. Så NVE Super Kan hente da bites fra hele ram, men i noen tilfeller vil det ta lengre tid, fordi de ikke sitter på den nummadoden som de... Som de selv hører til. Og da vil heller ikke RAN være helt random. Men standard RAM er random access. Det går like lang tid å hente hver bite. Og dette er veldig forskjellig fra harddisker, som vi skal se på senere. Iallfall spinnende, tradisjonelle harddisker. Der er det avhengig av hvor lesehodet til harddisken står, osv. En gitt del av minnet. Ok. Men som vi har sett tidligere... CPU, register og cash, det er laget av S-ram, static-ram. Og det består av seks temastiske historier. Jeg har sett på konstruksjonen av det tidligere. Og det er ekstremt hurtig, og det er statisk. Altså, det trenger ikke å oppfriskes. Ram eller internmine, derimot, det er laget av D-ram. Dynamic ram. Og det er en mye enklere konstruksjon.", "source": "lecture"}
{"lecture_id": "os13del5", "chunk_id": "os13del5_0002", "start": 299.64, "end": 470.92, "token_count": 579, "text": "Ok. Men som vi har sett tidligere... CPU, register og cash, det er laget av S-ram, static-ram. Og det består av seks temastiske historier. Jeg har sett på konstruksjonen av det tidligere. Og det er ekstremt hurtig, og det er statisk. Altså, det trenger ikke å oppfriskes. Ram eller internmine, derimot, det er laget av D-ram. Dynamic ram. Og det er en mye enklere konstruksjon. Det består bare av én transistor, og så er det én kondensator. En kondensator, det er da et lite element som kan holde på ladning. Så... Det holder på statisk ladning. Litt sånn som en ballong som du gnir på, så får du statisk ladning. En kondensator kan da holde en liten ladning, og det vil da være en én eller null. Så hvis du har ladning, så er det én, og hvis du ikke har ladning, så er det null. Men denne ladningen, den siver sakte ut, så den må oppfriskes ca. ti ganger i sekundet. Så da må man ha en liten loop som går og oppfrisker alle verdiene i ram hele tiden. Det betyr jo opplagt at hvis man skrur av en maskin, så forsvinner alt som er i ram. Ingenting av det som er i ram, blir lagret. Selvfølgelig ikke det i registeret heller. Så det betyr at alt som skal lagres permanent, det må lagres på disk. På harddisker, der ligger det permanent. Å synkronisere deram. Men... Ja, for kanskje sånn 15-20 år siden så ble det vanlig å synkronisere deram sånn at lesing og skriving var synkronisert med en ekstern klokke. Sånn som det alltid har vært i CPU-en. Der har vi en klokke. Men det er også en klokke ut mot databussen. Sånn at man synkroniserer lesing og skriving. Og da finnes det forskjellige versjoner av RAM. Alle nye er DDR5. DDR4 var den forrige. DDR står for Double Data Rate. Så alt dette er SDRAM, men det har vært versjoner som har kommet, som har vært mer og mer effektive.", "source": "lecture"}
{"lecture_id": "os13del5", "chunk_id": "os13del5_0003", "start": 429.6, "end": 480.02, "token_count": 173, "text": "var synkronisert med en ekstern klokke. Sånn som det alltid har vært i CPU-en. Der har vi en klokke. Men det er også en klokke ut mot databussen. Sånn at man synkroniserer lesing og skriving. Og da finnes det forskjellige versjoner av RAM. Alle nye er DDR5. DDR4 var den forrige. DDR står for Double Data Rate. Så alt dette er SDRAM, men det har vært versjoner som har kommet, som har vært mer og mer effektive. Og den typiske forskjellen er at de har høyere klokkefrekvens. Sånn at de raskere kan overføre data.", "source": "lecture"}
