{"lecture_id": "os14del12", "chunk_id": "os14del12_0000", "start": 0.0, "end": 229.02, "token_count": 575, "text": "Dette programmet, som skriver til et RA. Og noe av det som er viktig å vite her nå, er hvordan et todimensjonalt RA, eller en matrise, lagres i ramm. Ofte bruker man matriser som dette, RABA, med to indekser, for å lagre data. I maskinlæring og AI, f.eks., har man ofte sånne store matriser som dette. Da er det viktig å vite hvordan et RAI er organisert. For det er på en måte et valg når du har to indekser. Hvordan skal de ligge etter hverandre i ramm? Da er jeg skrevet opp fasiten for C her nede. Kompulatorer for forskjellige språk. Men for å se, så er det sånn at ra00 ligger rett før ra01 og ra02. Så... Ja, dette er litt viktig for hele problemstillingen. Så jeg tenker vi skal... Vi kan prøve å tegne opp det også. Hvis jeg kaller bare r-eyet A. Jeg har A av A. B. Sånn som det der. Og så har vi ramme nedover her. Og da er det et veldig viktig poeng når vi skal kjøre dette her, at A av 00 er første poeng. Det ligger her. Og så kommer A av 01. Og så kommer A av 02. Og så videre nedover. Helt til vi kommer til... Har fylt opp liksom første delen av r-øyet. Så kommer vi til A av 10... Og så fortsetter den nedover dere. Og så kommer A2. Og så videre i det uendelige. Her ser vi med en gang at den fortsetter. At her kan det bli noe trøbbel eller noen forskjeller med hensyn på cash. For det er klart... Hvis jeg skriver ut på denne måten, med a av null først, og løper gjennom med 1, 2, 3, 0, 1, 2 og sånn, så vil det treffe bra med cash, for da vil hele den biten sendes ut i cash. Og... Det er det vi nå skal se på. Og da ser vi... Skal vi se hvordan jeg gjør det her... I det eksempelet her... så ser vi at... Ja, jeg har B, A... Kanskje jeg kan prøve å gjøre det sånn? Sette A først. For da...", "source": "lecture"}
{"lecture_id": "os14del12", "chunk_id": "os14del12_0001", "start": 187.7, "end": 365.8, "token_count": 577, "text": "For det er klart... Hvis jeg skriver ut på denne måten, med a av null først, og løper gjennom med 1, 2, 3, 0, 1, 2 og sånn, så vil det treffe bra med cash, for da vil hele den biten sendes ut i cash. Og... Det er det vi nå skal se på. Og da ser vi... Skal vi se hvordan jeg gjør det her... I det eksempelet her... så ser vi at... Ja, jeg har B, A... Kanskje jeg kan prøve å gjøre det sånn? Sette A først. For da... La oss si jeg skal prøve å få det til å gå så fort som mulig nå. A lik 0... Da er det den ytre forløkken der. Og da starter... Så starter jeg på A av 0, og da vil jeg få A av 0, A av 0, A av 01 osv. Så denne måten burde være den raskeste. Men da prøver vi. Komplerer og kjører. Ja... Jeg kan se om det er noen forskjell Stor O. Mer effektivt gode... Jo, det går fortere. Så ikke tenk på den siste... at jeg bruker stor O. Når jeg skal komplere etterpå på den andre måten, så bruker jeg fortsatt stor O. Og vi ser... Det går på 0,75 sekunder. Men så kan jeg prøve. Hva om jeg bytter om B og A? Og det er opplagt... Det er det samme jeg gjør hver gang. Jeg bare løper gjennom på litt forskjellige måter. Totalt sett så vil programmet gjøre akkurat det samme. Men da ser vi... Dette programmet, som vi gjør nok til det samme, det går... Ca. 8... Det bruker 8 ganger så lang tid. Og det er akkurat den effekten som vi da forutsa. Her, i det første programmet, så tok vi og skrev til R-øyet på denne måten. Vi skrev ut hvert element som da ligger etter hverandre pent og pyntelig i ram, og det kan kjøres i hele bolker i cash og sendes av gårde. Neste forsøk så gjorde vi jo da noen enorme hopp fordi at vi måtte... Hoppe fra... Først skrev jeg A00, og så skrev jeg AA10.", "source": "lecture"}
{"lecture_id": "os14del12", "chunk_id": "os14del12_0002", "start": 325.4, "end": 537.96, "token_count": 587, "text": "Og det er akkurat den effekten som vi da forutsa. Her, i det første programmet, så tok vi og skrev til R-øyet på denne måten. Vi skrev ut hvert element som da ligger etter hverandre pent og pyntelig i ram, og det kan kjøres i hele bolker i cash og sendes av gårde. Neste forsøk så gjorde vi jo da noen enorme hopp fordi at vi måtte... Hoppe fra... Først skrev jeg A00, og så skrev jeg AA10. Og da måtte vi gjøre et svært hopp i ram herfra og hit, som var på 20 000. Og dermed ble det totalt cash miss. Og det kan vi da også se... Hvis vi kjører perf på dette her. Så vi kjører perf på det andre forsøket. Og her ser vi... Masse Minerfolds. Minner bare bygges opp. Det er kanskje ikke så forskjellig, men det er vel først og fremst cash misses som blir forskjellen her. Da må vi endre til det vi trodde var det beste. AB. Kompliere på nytt... og kjøre perf. Ja, da ser vi. Minor folds ble det samme. For i dette tilfellet så bruker vi jo akkurat like stor del av ramm. Så antall pages blir det samme. Så det gir ikke så stor tidsforskjell. Men her ser vi på cash misses. Her er det en stor forskjell. Her er det 29 millioner cash misses, så det er en god del. Men her oppe så ser vi... Dette tar tid, for det er 700 millioner cash misses. Det er også flere cash referanser. Altså der hvor du i det hele tatt... Her er det først og fremst en enorm forskjell i cash-bruken. Vi gjør akkurat det samme, men vi henter det fra et annet sted. Har det noe med at man bare legger ut 5? Det vi kunne gjøre, var bare for å gjøre det veldig eksplisitt, så kunne vi prøve å legge ut... Hva om vi legger ut A pluss B? Blir det noen annen forskjell på programmene? Men vi ser... Ja, det tok litt lengre tid. Men vi ser i Cashmisses så er det ikke noen forskjell. For det er... Du gjør det samme. Så da jeg prøvde å avkrefte det nå, var at kanskje de gjorde", "source": "lecture"}
{"lecture_id": "os14del12", "chunk_id": "os14del12_0003", "start": 497.84, "end": 589.0, "token_count": 266, "text": "Det vi kunne gjøre, var bare for å gjøre det veldig eksplisitt, så kunne vi prøve å legge ut... Hva om vi legger ut A pluss B? Blir det noen annen forskjell på programmene? Men vi ser... Ja, det tok litt lengre tid. Men vi ser i Cashmisses så er det ikke noen forskjell. For det er... Du gjør det samme. Så da jeg prøvde å avkrefte det nå, var at kanskje de gjorde noe sånt smart triks med at det ligger et tall Men vi ser, selv når vi legger forskjellige tall, så er forskjellene de samme. Og vi får den samme forskjellen... ... med at det tar mye lengre tid. Og vi får omtrent det samme antall cash misses. Så det at vi la ut det femtallet, hadde ingen betydning. Den store forskjellen var at i det ene tilfellet måtte vi hoppe langt i ramm. Og det passer dårlig med cash. I det andre tilfellet så lå alle dataene pent etter hverandre.", "source": "lecture"}
