{"lecture_id": "os14del14", "chunk_id": "os14del14_0000", "start": 0.0, "end": 176.16, "token_count": 575, "text": "Først så kjørte jeg den raske versjonen, 0,9 sekunder, som tok matrissen på riktig måte. Da fikk jeg bare én kontekst-witch. Og så var det spørsmål om hvorfor jeg fikk 204 kontekst-witcher her. Og det første man kan si, er at programmet kjører seks ganger så lenge. Så da burde det naturlig være flere kontekst-witcher. Kontekst-witcher skjer når... Man... Når flere prosesser kjører på samme CPU, og her konkurrerer de bl.a. med OBS og med Zoom, og de kjører en masse prosesser, så det vil nok bli noen context switcher en gang iblant. Men så prøvde jeg å kjøre programmet om igjen, og da fikk jeg åtte context switcher og seks context switcher. Så jeg ser at det... Det var nok litt tilfeldig at det ble så veldig mange. Akkurat der. Der ble det tolv. Mens hvis jeg... Kjører du på nytt den raske, så ser vi også at det er noen context sitcher der. Men jeg tror da, som sagt, at det var litt tilfeldig. At det ble veldig mange context sitcher. Jeg kjører et par ganger til. Ja, der var det oppe i 95. Men context switcher er jo da noe man ikke kan forutsi. Det vil variere fra gang til gang. Og det vil jo også... Det er jo et poeng at det kan ta lengre tid hvis det er mange context switcher, for da blir cash ødelagt for den... Den prosessen. Så vi kan se om det... Det ser ut som det er noen forskjell på hvor lang tid det tar når det er mange kontekst-switcher. Skal vi se... I det tilfellet overtok her oppe. Du kan kanskje se en antydning. 5,46 sekunder. De kontekst-switchene tar litt ekstra tid. Og ødelegger cash, sånn at det tar litt ekstra tid. Men i det tilfellet så ødelegger jo programmet cash for seg selv hele tiden. Men alt i alt, som svar på spørsmålet... Det var nok tilfeldig at det var så veldig mange. Antall kontekstvitsjer varierer veldig med hvor mange andre prosesser som kjører. Så det er litt tilfeldig dette inn i bildet.", "source": "lecture"}
{"lecture_id": "os14del14", "chunk_id": "os14del14_0001", "start": 145.4, "end": 182.0, "token_count": 157, "text": "De kontekst-switchene tar litt ekstra tid. Og ødelegger cash, sånn at det tar litt ekstra tid. Men i det tilfellet så ødelegger jo programmet cash for seg selv hele tiden. Men alt i alt, som svar på spørsmålet... Det var nok tilfeldig at det var så veldig mange. Antall kontekstvitsjer varierer veldig med hvor mange andre prosesser som kjører. Så det er litt tilfeldig dette inn i bildet. Så jeg tror først og fremst at når en kjører lenger, så er det flere kontekstvitser. Takk for oppmerksomheten.", "source": "lecture"}
