{"lecture_id": "os14del11", "chunk_id": "os14del11_0000", "start": 0.0, "end": 185.72, "token_count": 581, "text": "Vi kan se litt mer i detalj på det. For vi har da et program som heter Perf. Som jeg kan bruke til å se nøyaktig hva som skjer når jeg kjører programmet. Så vi kan ta den enkleste... enkleste versjonen først. Sette i den som går raskest. Her ligger det pent etter hverandre, så dette kan pustes i store biter ut i cash. Da går det kjapt. Det er den der. 0,02 sekunder. Men så kan jeg kjøre en... Altså, jeg har kjørt den før. Det er en kommando som heter perf, og den gir statistikk med antall... Her er jeg bedt eksplisitt om å skrive ut antall sykler, antall instruksjoner, Cash references. Det er hvor mange ganger du har en cash-referanse. Hvor mange ganger du henter ut noe for cash. Og så, ikke minst, cash misses. Major faults og minor faults. Major faults, det er når man må ut på disken og hente. Og det skjer ikke her. Det er når du får en virkelig page fault. Minor faults, det er når man må... Når man ikke har... Lagd en side i MMU. Og det skal vi se, det må vi gjøre ganske ofte. Så... Jeg tar og kjører den først. Og da får vi statistikken for dette programmet. Igjen ser vi det går lynras. 0,02 sekunder. Likevel ser vi... Utfør 63 millioner sykler. Og du gjør 71 millioner institusjoner. Men omtrent da en institusjon per sekund. Så... så ser vi... Cash Misses. Ja, den bommer ganske ofte på cash. Og det er fordi at den... den tar jo nå ut bit for bit. Men ganske ofte så må den hoppe videre til neste... neste del av cashen. Må fylle ut cash på nytt. Men fordelen når de ligger etter hverandre, er at den fyller hele cash. Med elementene som ligger etter hverandre. Men vi ser her minor falts. 10 000 minor falts. Og det passer ganske bra med... Hvis at det er 10K. En side er omtrent på 1000 bytes. Vanligvis er den på 4K. Så det går ikke helt opp. Men... Det er omtrent 10 000 K. Og vi ser at vi får 10 000 minor folts.", "source": "lecture"}
{"lecture_id": "os14del11", "chunk_id": "os14del11_0001", "start": 143.12, "end": 349.84, "token_count": 588, "text": "Må fylle ut cash på nytt. Men fordelen når de ligger etter hverandre, er at den fyller hele cash. Med elementene som ligger etter hverandre. Men vi ser her minor falts. 10 000 minor falts. Og det passer ganske bra med... Hvis at det er 10K. En side er omtrent på 1000 bytes. Vanligvis er den på 4K. Så det går ikke helt opp. Men... Det er omtrent 10 000 K. Og vi ser at vi får 10 000 minor folts. Og det er fordi at en minor folts er når man ikke har referert til denne delen av minnet. Og da lages det en adressering i MMU. Og det gjøres 10 000 ganger. Så det tar også litt tid. Men alt i alt så går dette lynraskt. Så prøver jeg å sette J like. Nei, vi setter inn RA av J, og da hopper vi rundt i 4 GB. Og dette tar da mye lengre tid. Komplerer. Og kjører det samme. Og nå ser vi... Nå får vi først og fremst... Så burde vi egentlig kunne sammenligne. Sånn, ja. Det tar 1,6 sekunder mye lengre tid. Og det er opplagt mange flere cycles. Og vi ser vi har veldig mange flere cash references, og nesten alle bommer. Jeg har på en måte konstruert dette sånn at det skal bomme. Vi hopper med 100 hver gang. Det er veldig uvanlig at man gjør det på denne måten her. Men dette er bare for å illustrere hvordan cash virker. Å være klar over det. Så vi får 75 millioner cash misses i stedet for 800 000 her oppe. Det er først og fremst det som gjør at det tar mye lengre tid. Men det tar også tid å bygge opp MMU, for her ser du vi... Her trengs det én million sider. For det r-e-et er på fire. Fire G, fire gigabyte. Og med en sidestørrelse på fire K, så så trenger man én million sider. Ja, så det går pent opp. Jeg glemte det at en integr er på fire. Så dette, det tilsvarer da... I det første tilfellet trengte vi bare 10 000 sider i MMU, men her trenger vi 1 million sider for å kunne adressere 4 gigabyte.", "source": "lecture"}
{"lecture_id": "os14del11", "chunk_id": "os14del11_0002", "start": 287.28, "end": 535.72, "token_count": 591, "text": "Men det tar også tid å bygge opp MMU, for her ser du vi... Her trengs det én million sider. For det r-e-et er på fire. Fire G, fire gigabyte. Og med en sidestørrelse på fire K, så så trenger man én million sider. Ja, så det går pent opp. Jeg glemte det at en integr er på fire. Så dette, det tilsvarer da... I det første tilfellet trengte vi bare 10 000 sider i MMU, men her trenger vi 1 million sider for å kunne adressere 4 gigabyte. Og dette tar også mye tid å bygge opp MMU. Og da ser vi at det er oppe i 1,6 GB. Det kan vi også se på... Når jeg tar Time Out-Out, så kan vi se på hva tiden går bort til. Vi ser user, det er 0,4, men veldig mye brukes av system. Cornal Tid. Og det er da for å bygge opp MMU-sidene. Så det er også en faktor her. Det er ikke bare cash, Hvis vi nå kjører... Hvis vi ser på det samme med Adatat, så ser vi... Jo, det er en andel system her også som er ganske stor. Den er faktisk litt større, for her også må de sidene bygges opp. Så ser vi at kjernen er inne og hjelper til med å... Bygge opp, da, i dette tilfellet 1 million pages. Og det tar litt tid. Spørsmål om hvorfor det var så mange cash misses i prog 1. Jo, det skyldes at tross alt, selv om man går etter hverandre, så går man veldig langt. Her ser vi det er 10 millioner... 10 millioner bite, eller da 10 000 kilobite. Og hvis du regner med INT, så er det da 40 000 kilobite. Og det krever jo da... At man lager de 10 000 sidene... her oppe. Men spørsmålet var kanskje hvorfor det var så mange cashministers som 801? Jo... Cash er da mindre enn 4K, så selv om du... Selv om du treffer veldig ofte, så er det jo med en gang du kommer utenfor, i første omgang, LN-cash-størrelsen, så vil du måtte hoppe over på... Så vil LN-cash måtte reflushes. Og den vil da reflushes 800 000 ganger når det går oppover.", "source": "lecture"}
{"lecture_id": "os14del11", "chunk_id": "os14del11_0003", "start": 480.0, "end": 547.96, "token_count": 176, "text": "At man lager de 10 000 sidene... her oppe. Men spørsmålet var kanskje hvorfor det var så mange cashministers som 801? Jo... Cash er da mindre enn 4K, så selv om du... Selv om du treffer veldig ofte, så er det jo med en gang du kommer utenfor, i første omgang, LN-cash-størrelsen, så vil du måtte hoppe over på... Så vil LN-cash måtte reflushes. Og den vil da reflushes 800 000 ganger når det går oppover. Først med opptil 100, og så... Men du ser du skal helt opp til 10 millioner. Så derfor vil du ha flere cashmisses enn der...", "source": "lecture"}
