{"lecture_id": "os14del3", "chunk_id": "os14del3_0000", "start": 0.0, "end": 174.98, "token_count": 599, "text": "Der. Dynamisk allokering. Som dere sikkert har prøvd selv, så kan man be om mer ram mens man kjører et program. Altså, man kan deklarere alt som er av variabler og så videre, i starten av programmet, og så bare bruke det. Men man kan også, sånn som Java... Og ha statements om dette her. PCB er en ny prosess, midt inn i programmet. Og da vet jo ikke operativsystemet eller noen andre om at dette her kommer til å skje. F.eks. så kan man gi input underveis til et RA hvor langt det skal være. Og da må det lages underfly. Altså man må... Det må sette seg plass i minnet. Og det er da... Da er det veldig fint å ha paging. Da kan operativselskapet sette av nye sider til denne prosessen dynamisk. Og da får prosessen, når den gjør noe sånt som dette, så får den page for page med minne. Det kan jo være en sånn... Det kan jo være... Dette krever mange megabyte med minne. Og lag et nytt objekt. Så... Men da får prosessen tildelt så mye. I Cs C pluss pluss så må man... Når man allokerer minnet på denne måten... Vi skal se et seeksempel etterpå. Så må man etterpå slette sånne objekter som er i bruk. Hvis man hele tiden allokerer mer og mer minne uten å frigjøre det, så får man det som man kaller en minnelekkasje. Det er et sånt vanlig program. Et vanlig problem i programmering, altså i store servere osv.... Det er et eller annet som gjør at når du kjører programmet lenger og lenger, så bruker det mer og mer minne, og så går det tregere og tregere. Og det er en typisk minnelekkasje. Det vil bare si at man allokerer mer og mer minne som ikke blir frigjort. Så programmereren må sørge for at man frigjør minne hele tiden. Det er en av de store fordelene med mange moderne... Med mange nyere programmeringsspråk, sånn som Java. Dere tenker kanskje ikke på Java. Supernytt. Men i forhold til COC++, så er det relativt nytt. Og det utfører da denne oppryddingen automatisk. Såkalt garbage collection, som skjer hele tiden bak kulissene.", "source": "lecture"}
{"lecture_id": "os14del3", "chunk_id": "os14del3_0001", "start": 139.48, "end": 238.0, "token_count": 320, "text": "Det vil bare si at man allokerer mer og mer minne som ikke blir frigjort. Så programmereren må sørge for at man frigjør minne hele tiden. Det er en av de store fordelene med mange moderne... Med mange nyere programmeringsspråk, sånn som Java. Dere tenker kanskje ikke på Java. Supernytt. Men i forhold til COC++, så er det relativt nytt. Og det utfører da denne oppryddingen automatisk. Såkalt garbage collection, som skjer hele tiden bak kulissene. Så hvis dere har et RAI eller noen objekter som ikke brukes lenger, så fjernes det fra minnet, sånn at minnet blir frigjort til andre programmer eller andre variabler i samme program. Den delen av ramm som kan øke og minke i størrelse, det kalles heap. Vi så forrige gang et minnekart i Linux, der dere hadde én del som var heapen. Det er her... Legges alt som er av RY og sånn, som øker og minsker i størrelse. Mens vi har stacken også. Den inneholder f.eks. alt som har med å hoppe til og fra metoder å gjøre. Så det er litt sånn organisering i... En organisering av ramm som operativstemme sørger for.", "source": "lecture"}
