{"lecture_id": "os14del5", "chunk_id": "os14del5_0000", "start": 0.0, "end": 189.4, "token_count": 583, "text": "Her tenkte jeg å kjøre en Vram-test. Dette er også en av oppgavene denne uken. Å kjøre dette RAM... RAM-SMP. RAM-Speed. Hvis vi kjører det uten argumenter som dette, ser vi at vi får litt info om... Men vi ser vi trenger å ha en minus B id. Sånn generelt når... Hvis opsjoner står i parenteser, så er det opsjoner. Man kan velge å ikke ta dem med, men opsjoner som ikke står i parenteser, de må være med. Så vi ser her... For å få dette til å kjøre, må vi bruke den minus B. Og minus B1... Den gjør da en test hvor man skriver til RAM. Vi kan teste og lese etterpå. Så dette er da min Linux-desktop som står nede på OsloNet. Som jeg kjører denne testen i. Og det som skjer nå, er at vi... Og skrive til ram akkurat på samme måte som vi gjorde i det forrige programmet. Vi har et svært array, og så skriver vi bite for bite til det arrayet. Og vi ser... Det er noe sånt som åtte gigabyte med ram som skrives. Og... Men forskjellen er størrelsen på blokkene som skrives. Så i førstelinja her så skriver man bare... Én kilobite av gangen. Altså, man har en løkke som går gjennom... Da blir det 250 bite, sånn at det blir én kilobite totalt. Og så skrives det veldig hurtig til ramm. Og så måles hastigheten. Det går veldig fort. 26 000 megabyte per sekund. Altså 27 eller 30 gigabyte i sekundet. Så... Det går unna. Hvis du skal streame noe, f.eks., så kan du... Ja... Du kan streame kanskje 4 megabit per sekund, og det er bare bit. Dette er bite, og så er det giga. Så det er 30 gigabyte per sekund. Så dette går veldig, veldig hurtig. Men litt av poenget her med denne testen er at vi ser det går veldig hurtig til å begynne. Men så begynner det å gå litt saktere. Her er det 29 000, så går det ned til 28 000, 27 000 her... 25 000. Og så dropper det enda mer.", "source": "lecture"}
{"lecture_id": "os14del5", "chunk_id": "os14del5_0001", "start": 155.42, "end": 332.88, "token_count": 584, "text": "Ja... Du kan streame kanskje 4 megabit per sekund, og det er bare bit. Dette er bite, og så er det giga. Så det er 30 gigabyte per sekund. Så dette går veldig, veldig hurtig. Men litt av poenget her med denne testen er at vi ser det går veldig hurtig til å begynne. Men så begynner det å gå litt saktere. Her er det 29 000, så går det ned til 28 000, 27 000 her... 25 000. Og så dropper det enda mer. Og her nede så ser vi at vi er nedi en fjerdedel av den opprinnelige hastigheten. Og dette har da... Dette er da på grunn av cash. Dette er cash-størrelsene. Skriver en liten blokk, så får den plass i LN-cash. Skriver vi en litt større blokk, så får den plass i L2-cash. Og så må vi kanskje ut i L3-cash her ute. Det vi trenger å vite da, er hvor stor er cash på denne maskinen her. Og da... Det jeg gjorde nå, var kommandoen LSCPU. Og den gir cash-størrelsene. Og da ser vi... L1-cash er 32K for data og instruksjoner. Det er data. I er instruksjoner. Og dette vil jo være typisk... Her skrives, og dette vil typisk være data. Så da har vi 32K i L1 og 256K i L2 og 8 mega i L3. Så da kan vi prøve. Vi skal prøve å se... Er det noen forskjell på... Er det noen stor forskjell ved 32K og 256K? Det er ikke så veldig stor forskjell. Vi kan se at det begynner å droppe litt ved 32K, for da må den over på L2. Men det ser ut som... Når du skriver de store mengdene her, så ser det ut som L2 også er veldig effektiv. Men så begynner det å bli større enn L2. Nå i dag faller det litt i hastighet. Men så ser vi her mellom 4 og 8. Der begynner det å bli en stor forskjell. Da begynner vi å komme over 8K. Da ser vi at hastigheten har blitt halvert. Og det er fordi da får ikke de blokkene plass i...", "source": "lecture"}
{"lecture_id": "os14del5", "chunk_id": "os14del5_0002", "start": 283.44, "end": 421.36, "token_count": 402, "text": "Men det ser ut som... Når du skriver de store mengdene her, så ser det ut som L2 også er veldig effektiv. Men så begynner det å bli større enn L2. Nå i dag faller det litt i hastighet. Men så ser vi her mellom 4 og 8. Der begynner det å bli en stor forskjell. Da begynner vi å komme over 8K. Da ser vi at hastigheten har blitt halvert. Og det er fordi da får ikke de blokkene plass i... Ikke engang i L3. Så da må du begynne å lese direkte fra disken... Nei, direkte fra ram, og da begynner man å komme ned på den... Det som du kan kalle den ekte rammehastigheten. Altså at du må helt ut i ramm og... Hentedataene. Da faller hastigheten med i hvert fall en faktor på fire. Muligens enda mer hvis vi hadde skrevet enda større blokker. Så vi kan prøve å lese også. Minus B2. Da leser vi fra ramma. Og vi ser det går enda fortere. Vi ser igjen så vi får 1 KB. Den er kanskje for liten igjen til at det skal gå fort nok. Når det kommer opp i 2, så ser vi det kommer opp i 60 GB per stykke. Men igjen så ser vi den samme effekten. Det faller litt... ... litt etter 32K, eller den cash-størrelsen. Og så faller det veldig mye etter 8K. Fra 50 og ned til 20, omtrent. Så det er en stor faktor.", "source": "lecture"}
