{"lecture_id": "os15time1", "chunk_id": "os15time1_0000", "start": 0.0, "end": 193.96, "token_count": 600, "text": "Sånn. Fra nå blir foreløpningen tatt opp. Vi ser vi har kommet til uke 17. Det vil si, vi har vel hatt i hvert fall to uker... en studieuke og en påskeuke. Men det har vært 15 uker med nytt stoff. Litt mindre de siste ukene. Er disker og filsystemer et ganske morsomt tema? Og noe som er relativt forskjellig fra det vi har holdt på med tidligere. Så nå er vi over på den aller tregeste, seineste delen av operativsystemet. Her kan det gå inntil en million ganger saktere. Her er vi faktisk avhengig av plater som snurrer rundt. Ting tar tid. Men like fullt så er disker og filtsystemer en viktig del av operativsystemet. Kanskje ikke like viktig som for 10 og 20 og 30 år siden. Fordi vi i moderne systemer så har ramm blitt såpass billig, og man har såpass store mengder ramm at man ofte kan unngå de problemene Man får det med 3G-disker ved disk-cashing. Altså at man rett og slett bare laster inn svære filer på mange gigabyte inn i ramm. Og det løser en del problemer. Selv store databasesystemer kan ha store deler av databasen i ramm, og da går ting veldig mye raskere enn om man alltid må ut på disk og hente det. Men uansett trenger man disker. Når man skrur av datamaskinen, forsvinner alt som er i ramm. Så det holder ikke helt. Så det er dette som er temaet denne uken. Ikke minst så er det noen morsomme oppgaver... Som er... Ja, som går ganske... De er ganske praktisk anlagt. De går ut på å se på filsystemer. Og for å kunne gjøre det, så trenger vi noen ekstra verktøy. Og vi skal bruke et verktøy som heter autopsy. Det er en sånn open source forensics browser. Forensics, det er sånn... På norsk heter det kanskje rettsmedisin. Otopsy er jo sånn hvor man ser på døde personer og finner ut hva som har skjedd. Det er verktøy. Det blir brukt ofte hvis man... Hvis noen ganger politiet kommer og henter datamaskiner, da tar de det første de gjør, og tar en kopi av harddisken.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0001", "start": 156.5, "end": 333.84, "token_count": 598, "text": "Og vi skal bruke et verktøy som heter autopsy. Det er en sånn open source forensics browser. Forensics, det er sånn... På norsk heter det kanskje rettsmedisin. Otopsy er jo sånn hvor man ser på døde personer og finner ut hva som har skjedd. Det er verktøy. Det blir brukt ofte hvis man... Hvis noen ganger politiet kommer og henter datamaskiner, da tar de det første de gjør, og tar en kopi av harddisken. Og så går det løs på den og prøver å finne ut hva som har vært på disken. Det er ofte sånn også at man kanskje ser på mobiltelefoner, eventuelt minnepinner. Og så er det da ting som... Som har blitt slettet på disse minnepinnene. Men så leser man ofte at 'det går an å finne igjen'. Det er ikke helt borte. Og det stemmer faktisk. Hvis man sletter en fil fra en disk, så blir bare linken til der hvor stoffet har ligget, slettet. Så selve dataene ligger der helt til de tilfeldigvis skrives. Med mindre man eksplisitt skriver over seg. Så på en Wallaby Service du sletter en film, så sier vi at den er borte for godt. Men i virkeligheten så ligger den fortsatt på disken. Og det gjelder også SSD-disker, og det gjelder også minnepinner. Så mot slutten av oppgaven denne uken, så er det en oppgave som... Den går ut på at man... At det er en kar som kommer til Norge, og så har han med seg litt diverse utstyr, men blir stoppet av politiet på grensen, på Gardermoen. Men da har han akkurat klart å slette et bilde som han har på harddisken. Og i tillegg så har han slettet innholdet på en minnepinne. Men som eksperter så skal dere gå inn med autopsy. Og så skal dere se på de diskene. Jeg har fått tak i en kopi av et image av hver av diskene. Og så skal dere da lete bl.a. etter et bilde og diverse tekst og noen nøkler for å finne ut hvordan man kan løse mysteriet. Og det dere vil se etter hvert, er at her er det faktisk et bilde som dere kan få tak i, som har vært slettet fra en disk. Dere får trylle det frem igjen med autopsy.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0002", "start": 293.26, "end": 496.16, "token_count": 590, "text": "Men som eksperter så skal dere gå inn med autopsy. Og så skal dere se på de diskene. Jeg har fått tak i en kopi av et image av hver av diskene. Og så skal dere da lete bl.a. etter et bilde og diverse tekst og noen nøkler for å finne ut hvordan man kan løse mysteriet. Og det dere vil se etter hvert, er at her er det faktisk et bilde som dere kan få tak i, som har vært slettet fra en disk. Dere får trylle det frem igjen med autopsy. Det er ikke så veldig rett frem, men det er en del jobb. Men det er morsomt når man først får det til. Og litt av poenget her er at da skal dere samtidig lære hvordan et filsystem er bygd opp, for da må dere gå inn under de vanlige filene og se på sammenhengene hvordan filer egentlig er lagret. Så her er det på mange nivåer. Så er det data som er skjult, som dere kan få fram med relativt enkle midler. Vi skal se etterpå hvordan vi bruker autopsy for å se på noen filer. Jeg tenkte å prøve å gjøre det, bygge et image fra scratch. Lage en fil på det imaget og slette det, og så se om vi klarer å finne det igjen. Ok. Det var mye om dagens oppgaver. Ja, vi kan se. Her nede er en oppgave tre det jeg snakket om. Hvor dere skal drive med computer forensics, som det heter, og se på disker og finne ut hva som har skjedd. OK. Da skal vi se på hva vi skal holde på med i dag. Vi kan kanskje aller først raskt se på hva vi holdt på med sist. Forrige gang så var det RAM, internminnet, som vi så på. Og vi så først og fremst på i praksis hvordan... Hva som skjer ved bruk av internmine, og hva som er viktig. Det som er det viktige, er å få plass til alt i RAM. Hvis man må begynne å bruke disk for å programme programmer, så tar ting veldig lang tid. RAM, derimot, er veldig hurtig. Og enda hurtigere er det ved hjelp av cash. Så vi så på noen... Noen rammetester, sånn som her. Og en rammetest som er sånn som denne... Den skriver da små blokker om og om igjen.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0003", "start": 450.0, "end": 639.6, "token_count": 597, "text": "Hva som skjer ved bruk av internmine, og hva som er viktig. Det som er det viktige, er å få plass til alt i RAM. Hvis man må begynne å bruke disk for å programme programmer, så tar ting veldig lang tid. RAM, derimot, er veldig hurtig. Og enda hurtigere er det ved hjelp av cash. Så vi så på noen... Noen rammetester, sånn som her. Og en rammetest som er sånn som denne... Den skriver da små blokker om og om igjen. Og da, i praksis, så vil ikke dette skrives helt ut til disk fortløpende. For hastigheten ut til disk er ikke så rask. Altså cash nærmest CPU-en. Så hvis man skriver to ganger raskt etter hverandre til samme område, så blir det ofte bare lagret til cash. Og så etter hvert når ting ror seg, så blir det skrevet helt ut til disken. Og vi kunne da se at her er det en forskjell på en faktor åtte i forhold til når man skriver større mengder, som da skrives helt ut til disk. Så dette viser hvor viktig Cash er for å få ting hurtig ut på disken. Og vi så også på noen eksempler på hvordan man... Hvis man må hoppe i ramm... Vi så f.eks. på en matrise. Så hvis man bruker feil indeks i en matrise, så hopper man store biter av gårde i ramm når man lagrer. Det tar da straks veldig mye mer tid. Det kan fort bli en faktor på 510. Fordi man da må tilbake til hastigheten av vanlig RAM, som ikke er hurtig nok for CPU-en. Og det er hele hovedpoenget. Hadde RAM vært like hurtig som CPU, så hadde vi ikke trengt å ha hele cash-opplegget i det hele tatt. Og et annet poeng med cash er at det styres ikke av operativstemme. Det er det samme med MMU. Ok, da kan vi gå til dagens tema. Først skal vi se litt på det som kan kalles gammeldagse disker, selv om det er mye bruk i vanlige PC-er og laptop-er også. Så vi skal se på oppbygning av disker. Og så skal vi se på partisjoner og litt på SSD. Solid State Drive, som er da en raskere utgave av en raskere disk,", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0004", "start": 600.0, "end": 803.22, "token_count": 599, "text": "Det er det samme med MMU. Ok, da kan vi gå til dagens tema. Først skal vi se litt på det som kan kalles gammeldagse disker, selv om det er mye bruk i vanlige PC-er og laptop-er også. Så vi skal se på oppbygning av disker. Og så skal vi se på partisjoner og litt på SSD. Solid State Drive, som er da en raskere utgave av en raskere disk, som bruker en helt annen teknologi, som bruker den samme teknologien som i minnepinner. Og som ligner mer på det som ligner egentlig mer på ram og registre, faktisk. Men forskjellen er at SSD, den beholder informasjonen Skal vi se på filsystemer, hvordan et filsystem er bygd opp, og det er egentlig bare en oversikt over hva som er lagret på en disk. Kortversjonen er at man har såkalte sektorer, som er minste enhet på 512 bite. Og filsystemet er bare en litt komplisert oversikt over hvor alle disse sektorene, De minste byggescenene, hvor de ligger på disken. Ja. Så skal vi se litt konkret på... på disker og DMA, hvordan operativsystemet avlastes og lagrer... Hvordan ting lagres direkte mellom ramme og disk uten at OUS trenger å jobbe for mye. Vi skal ta opp igjen det med Kib, mib og gib, som jeg nevnte sist. Og så skal vi helt til slutt se på rate, som er en måte å parallellisere disker. Man setter mange disker ved siden av hverandre, og så leser man og skriver i parallell for å få ting til å gå fortere. Ok. Da skal vi starte med magnetiske disker. Magnetiske disker, de ser ut som små CD-plater, og de snurrer veldig fort rundt. 1000 ganger i sekundet, eller der noe omkring. Og så har de... Som man ser her, så er det lesehoder som ligger veldig tett inntil diskene. Så prinsippet er bygd på magnetisering. Så man har magnetisert områder på disken. Og da kan det være sånn at et bitte lite område som er magnetisert, det er en ener. Og hvis det ikke er magnetisert, så er det null. Og dette er en varig lagring, sånn at hvis man skrur av strømmen,", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0005", "start": 767.4, "end": 929.94, "token_count": 590, "text": "Og så har de... Som man ser her, så er det lesehoder som ligger veldig tett inntil diskene. Så prinsippet er bygd på magnetisering. Så man har magnetisert områder på disken. Og da kan det være sånn at et bitte lite område som er magnetisert, det er en ener. Og hvis det ikke er magnetisert, så er det null. Og dette er en varig lagring, sånn at hvis man skrur av strømmen, så ligger jo det der fortsatt. Men for å lese av den magnetiseringen så trenger du lesehoder Veldig tett inntil diskene. Og de ligger både over og under. Og siden jeg har dem, så har du mange lag med disker. Det kan se ut noe sånt ut. Sånn størrelsesorden 100 ganger i sekundet roterer disse diskene rundt. Og så har man lesehoder over og under. Sånn at man lagrer på begge siden av alle diskene. En ting som er viktig med disker, er at sektor er den minste grunnhenheten for en disk. Det er den minste biten. Hvis jeg har en sektor her ute, den er på 512 bite. Og når man leser fra en disk, så leser man ikke én og én bite, men man leser 512 av gangen. Det er den minste enheten. Skal ikke se så veldig mye på oppbyggingen av disker, for nå blir det mer eller mindre. Men noen ganger vil man se at man møter begrepet track. Og det er akkurat som en løpebane. En track er hele den banen rundt her. Og så har du én sektor per track, og så har du mange tracker innover. Så i tillegg må du si hvilken skive du er på, og om du er over eller under. Så på den måten kan du spesifisere nøyaktig hvor en sektor er. På SSD-disker som vi kommer til, så er dette helt... De er bygd opp helt annerledes. De snurrer ikke rundt. De er faste. Mer som ramm. Men likevel bruker man det sektorbegrepet for å kunne bruke de samme filsystemene som på klassiske disker. Sylinder er et begrep som fortsatt brukes, og som dukker opp i mange sammenhenger. Og egentlig er en sylinder samlingen av alle plater...", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0006", "start": 893.06, "end": 1070.52, "token_count": 591, "text": "Så på den måten kan du spesifisere nøyaktig hvor en sektor er. På SSD-disker som vi kommer til, så er dette helt... De er bygd opp helt annerledes. De snurrer ikke rundt. De er faste. Mer som ramm. Men likevel bruker man det sektorbegrepet for å kunne bruke de samme filsystemene som på klassiske disker. Sylinder er et begrep som fortsatt brukes, og som dukker opp i mange sammenhenger. Og egentlig er en sylinder samlingen av alle plater... De ligger i samme avstand fra sentrum. Altså samme trekk. Så trekk opp og nede på alle sylinderne... Nei, trekk opp og nede på alle skivene. Det utgjør én sylinder. Og generelt, når man da skal be om én sektor, be om én sånn liten sektor her, så kan man gjøre det ved å si hvilket lesehode det er. Hvilket nummer, hvilken track og hvilken sektor rommet på denne tracken. Og da får du akkurat den sektoren du trenger. Og tradisjonelt så er det operativsystemet som har styrt dette her. Helt ned til detaljnivå. Og for å lese en fil så organiserte da operativsystemet sånn at den sendte ut meldinger, lesehode, track-sektor-nummer ut i disken, og så kom det tilbake. En egen diskontroller som gjør alle disse operasjonene, sånn at operativstemmet kan jobbe på et høyere nivå og så bare be om alle sektorene som en fil utgjør. Og så ordner diskontrolleren det praktiske med hvor det ligger. Hvis man har isolert et operativsystem på en datamaskin, så bruker man begrepet partisjoner. Da må man først partisjonere disken. F.eks. så kan man ha filer som man endrer på. Det kan være med på én partisjon, og så kan man ha operativsystemet på en annen partisjon. Så kan man beholde hovmpartisjonen, alle filene man har som bruker. Og så bare bytter man om. Da kan man formatere den partisjonen som OS ligger på, og legge OS på nytt. Men egentlig er partisjon en samling av sylindere.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0007", "start": 1035.1, "end": 1224.76, "token_count": 598, "text": "F.eks. så kan man ha filer som man endrer på. Det kan være med på én partisjon, og så kan man ha operativsystemet på en annen partisjon. Så kan man beholde hovmpartisjonen, alle filene man har som bruker. Og så bare bytter man om. Da kan man formatere den partisjonen som OS ligger på, og legge OS på nytt. Men egentlig er partisjon en samling av sylindere. På dette bildet ser vi de fire innerste sylinderne. De utgjør til sammen en partisjon. Og grunnen til at man deler det inn på denne måten her, er at én sånn sylinder ligger i samme avstand. Så hvis lesehodene ligger fast, så snurrer disken. Og da vil man naturlig lese en hel sylinder. For lesehodene går ut og inn. Det er derfor man i utgangspunktet har en sylinder. Og det samme gjelder partisjoner. Det ligger fysisk inntil hverandre, så da kan man... Hvis man fortløpende skal lese en stor fil som ligger på samme partisjon, så går man utover i... eller innover i sylinderne og leser det samme. Så dette er årsaken til noen av de begrepene som man har i harddisker. Det er en helt annen type teknologi enn disker som snurrer med magnetisk lagring. Det er basert på flashminner. Akkurat samme minne som i minnepinner. Det har ingen bevegelige deler, og det er faktisk en liten... Den ligner egentlig mest på en liten lagringsenhet for ram. Hvis vi husker RAM, så hadde vi én liten transistor. Men den måtte... Den lille transistoren holder en ladning. Med ladning er det én, og uten er det null. Men i RAM må den refreshes. Altså den må fylles opp på nytt. Hvert ti ganger i sekundet fordi ladning siver ut. Men i mine pinner... Et par ekstra lag rundt den transistoren som gjør at man kan lagre varig en bitte liten ladning. Den vil gå ut etter hvert, men den kan lagres i lang tid, sånn at man ikke trenger strøm for å ta vare på den. Men den er ikke like rask som den. Det er kanskje en fakta på 1000?", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0008", "start": 1188.6, "end": 1349.8, "token_count": 582, "text": "Men i RAM må den refreshes. Altså den må fylles opp på nytt. Hvert ti ganger i sekundet fordi ladning siver ut. Men i mine pinner... Et par ekstra lag rundt den transistoren som gjør at man kan lagre varig en bitte liten ladning. Den vil gå ut etter hvert, men den kan lagres i lang tid, sånn at man ikke trenger strøm for å ta vare på den. Men den er ikke like rask som den. Det er kanskje en fakta på 1000? Kanskje noe mer også. Så det er mye tregere. Men... I forhold til disker som roterer, så har den mange opplagte fordeler, blant annet at den ikke har noen bevegelige deler. Med en laptop med en HDD, en harddisk, så må du spinne harddisken, så må man ofte være litt forsiktig med å vri fort på den, for da kan du til og med høre at det sier... Og så kan disken gå i stykker. Så den tåler da å vrisses og flyttes på. På en helt annen måte enn en vanlig harddisk. Og så er det mye raskere. Spesielt med random aksesttid. Ned mot 0,1 millisekunder, og kanskje enda mindre også, litt avhengig av hvordan man kobler til. Mens for roterende risker så er det oppe i 5-10 millisekunder. Og det er fordi at da du skal hente én gitt sektor, så er det virkelig ikke ram. For da må du jo flytte på lesehodet, og så må disken snurre, og så kan man lese en sektor. Så det er veldig forskjellig. Men SSE er dyrere. Nå har prisene begynt å... Etter hvert som man produserer mer, så går prisene nedover. Men de er fortsatt en god del dyrere enn HDD, eller Hard Disk Drive, som er roterende disker. Hvordan man kobler til, har mye å si. NVME... Det er såkalt Non-Volatile Memory Express. Det er en spesiell teknologi hvor du kobler rett på PCI-en i en datamaskin. PCI er et sånt generelt tilkoblingspunkt for alle devices som disker av nettargskort og lydkort. Tross alt så har man andre tilkoblinger.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0009", "start": 1311.8, "end": 1520.32, "token_count": 598, "text": "Men de er fortsatt en god del dyrere enn HDD, eller Hard Disk Drive, som er roterende disker. Hvordan man kobler til, har mye å si. NVME... Det er såkalt Non-Volatile Memory Express. Det er en spesiell teknologi hvor du kobler rett på PCI-en i en datamaskin. PCI er et sånt generelt tilkoblingspunkt for alle devices som disker av nettargskort og lydkort. Tross alt så har man andre tilkoblinger. Men med SSD, så for å oppnå høy hastighet som man i utgangspunktet har, høyere hastighet enn andre disker, så har man klart å koble det i da... Eller fått lag teknologi som kobler det rett på PCI-en, sånn at det kan gå mye raskere. Og mens en vanlig disk kjører sånn typisk 100 MB per sekund... Så kan du få SSD-er opp i 2500. Vi kunne ta en kikk på det. Skal vi se om vi får til å teste noen disker. Skal vi se... Vi kan starte med... her. Ja... Jeg kan starte og kjøre en kommando som heter HD-parm. Før jeg gjør det, så kan vi først starte med å prøve å se på disken. Nå er jeg på en Linus-desktopp som... Og den har en standard harddisk. Så hvis jeg tasser DF... DF-mins òg, den gir en oversikt over disken og diskbruk. Så ser vi det er en del dev loop her, og det er... Det er typisk... lagret i ramm. Så du kan komme tilbake og se på dev loop senere. Men... Disse her, Rønn og så videre, de er også... Og Dev og Rønn, de er avbildet ramm for at ting skal gå fortere. Men det som er selve disken her, harddisken, det er denne linjen. DWSDA1. Her har jeg bare én partisjon. Jeg kunne hatt flere partisjoner. Da ville jeg hatt typisk DWSDA1, DWSDA2 osv. Men her har jeg bare alt under disken på ett sted. En sånn disk er montert et eller annet sted i filsystemet. Her ser vi hvis den er montert på... Denne disken er montert på slash, altså øverst på roten. Så det betyr at når jeg skrur av datamaskinen, så ligger alt på denne devicen.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0010", "start": 1485.72, "end": 1690.48, "token_count": 597, "text": "Her har jeg bare én partisjon. Jeg kunne hatt flere partisjoner. Da ville jeg hatt typisk DWSDA1, DWSDA2 osv. Men her har jeg bare alt under disken på ett sted. En sånn disk er montert et eller annet sted i filsystemet. Her ser vi hvis den er montert på... Denne disken er montert på slash, altså øverst på roten. Så det betyr at når jeg skrur av datamaskinen, så ligger alt på denne devicen. Alt dette ligger på en disk og er evig lagret. Iallfall lagret uten strøm. Og 278 G. Vi ser for øvrig ikke alt av den disken. Fordi noe av det ligger på... Eller dette er en... Jeg har dual boot, så jeg har også en Windows-disk. Men man kan se resten med F-disk. Og typisk når jeg skal se på en disk, så... Så må jeg ha Ruths rettigheter. For generelt sett en vanlig bruker adgang til devices som disk. Så nå starter jeg F-disk på denne disken, og så kan jeg taste P. Da printer man ut en oversikt over disken. Jeg har flere partisjoner der. SDA2 er en extended. Så ser jeg også at jeg har SWAP. SOP snakket vi om forrige gang. Det er da det området på disken som brukes til virtuelt minne. Så her har jeg satt opp SWAP på 16G. Det er like stort som internminne. Sånn at man hele tiden har en kopi av alt som er internminne, Inn og ut på disken, eller si man får ha 16G ekstra. Og ha på en måte en slags backup-ram i disken. Såping går sakte. Så på mange moderne systemer så har du så mye ram at du egentlig aldri bruker såpp. Men hovedpenget er at man har... Her har jeg Linux. Men SWOP er da en egen partisjon. Så SDA5 er en egen, uavhengig bit av disken. Og dette med partisjoner, det må man definere fra scratch når man installerer operativsystemet. Det finnes forskjellige verktøy som kan endre på partisjoner. Endre partisjonene. Kanskje det er sånn at 280 gigabyte brukes av Windows. Og så kan man plukke ut 100 gigabyte av den og si at OK,", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0011", "start": 1650.0, "end": 1850.32, "token_count": 594, "text": "Men SWOP er da en egen partisjon. Så SDA5 er en egen, uavhengig bit av disken. Og dette med partisjoner, det må man definere fra scratch når man installerer operativsystemet. Det finnes forskjellige verktøy som kan endre på partisjoner. Endre partisjonene. Kanskje det er sånn at 280 gigabyte brukes av Windows. Og så kan man plukke ut 100 gigabyte av den og si at OK, nå vil jeg ha Linux på denne. Og det har jeg ikke på denne desktopen, men på laptopen din har jeg en sånn delt minne. Det kan vi se på etterpå. Så det jeg egentlig skulle se, var hastigheten. Så bruker jeg en kommando som heter HDParm, med HD-parm på dev.sda, for å teste hvor lang tid det tar å lese disken. Og da ser vi... Her står det først 'Timing. Cash the Reads'. Og det går veldig fort, for i praksis er det å lese fra DiskCash. Så her ser vi... Her er det 13 000 MB. Altså... 13 gigabyte per sekund. Så det går ekstremt fort, og det ligner mer på rammehastighet. Men vi ser på disk-kassetten, med buffer disk-grids... Den leser da direkte fra disk. Og der er vi nedi mer som er antydet 100 megabyte per sekund. Ganske fort det også, men ikke i nærheten av ramme. Så kan vi se på det tilsvarende på min laptop, som er her. Igjen kan vi starte med DF. Her ser vi også, det er masse fra Snap, som er en sånn installeringsapp. Men øverst her, så kan vi se... Igjen er det en del devices som ligger i Ram, som UDV og TempFS. Men her er selve disken på denne laptopen. Her ser vi også at det står eksplisitt NVME. Og denne er da raskere enn NVME011. Den er da raskere enn en standard harddisk. Så vi kan prøve oss og se... Vi kan ta hastigheten først. På denne disken. Igjen så må jeg være ruth. Nå er jeg altså på en annen maskin. Nå er jeg på en laptop som har en SSD-disk. Og vi ser... Den har litt høyere ramme også. Den... Nei, kanskje ikke. Det var det...", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0012", "start": 1809.08, "end": 2016.48, "token_count": 593, "text": "Og denne er da raskere enn NVME011. Den er da raskere enn en standard harddisk. Så vi kan prøve oss og se... Vi kan ta hastigheten først. På denne disken. Igjen så må jeg være ruth. Nå er jeg altså på en annen maskin. Nå er jeg på en laptop som har en SSD-disk. Og vi ser... Den har litt høyere ramme også. Den... Nei, kanskje ikke. Det var det... Må sammenligne her oppe. Sorry. Jo, 13... Det gikk faktisk ikke raskt litt senere, men det er mulig... Denne maskinen her sliter tungt nå ved å kjøre både OBS og Zoom samtidig, så det kan skyldes litt det. Men vi ser at lesningen fra disk går mye raskere. 1800 megabyte per sekund, mens her oppe så var det 80. Vi ser der at det var en fakto på 20 ganger raskere med SSD-disken. Vi ser det er en vesentlig forskjell, og det merker man også på når man brukte, f.eks. Det går mye raskere å bute med en SSD-disk. HDD-disken som jeg hadde, gikk på ca. 80, mens SSD-disken gikk på 2000. Skal vi se... Oi, hvor var jeg? Her var det, ja. Hoppe tilbake en gang til. For vi glemte å se på én ting. Vi skulle se på... Vi skulle bruke eftisk... Og se på denne disken. Hvordan den ligger ut her. P-printer. Og her ser vi et annet eksempel på partisjoner. Alle disse her er da partisjoner som er antalt som deviser her. P1, P2, P3 osv. Og her ser vi... Her er Linux-fillsystemet, som da bruker 200 GW. Men så ser vi her... Her har vi et Microsoft Basic. Så her har jeg en helt annen partisjon. Og den, så vidt jeg husker, så bruker den NTFS. Så dette er en Windows-installasjon på den samme laptopen. Men som vi så da vi startet liningsmaskinen, så så vi ikke engang... Med eftisk så så vi ikke... Nei, ikke med eftisk, men... Vi ser liste filer. I Linux så ser jeg ikke engang disse partisjonene. Men det går an å montere det. Man kan gå inn på det, men de ligger der.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0013", "start": 1981.44, "end": 2164.66, "token_count": 597, "text": "Så her har jeg en helt annen partisjon. Og den, så vidt jeg husker, så bruker den NTFS. Så dette er en Windows-installasjon på den samme laptopen. Men som vi så da vi startet liningsmaskinen, så så vi ikke engang... Med eftisk så så vi ikke... Nei, ikke med eftisk, men... Vi ser liste filer. I Linux så ser jeg ikke engang disse partisjonene. Men det går an å montere det. Man kan gå inn på det, men de ligger der. Men det er da en fullstendig Windows 10-installasjon. Så når jeg booter, så kan jeg da velge å starte Windows 10. Eller jeg kan starte Linux. Og da bruker jeg helt forskjellige uavhengige partisjoner. Jo, denne laptopen kom med Windows. Og da var alt på hele disken. Og det jeg gjorde da, var å repartsjonere med et repartsjoneringsverktøy. Så endret jeg partsjonene. Jeg tror faktisk det kan gjøre med å kjøre en vanlig Linux-installasjon fra en minnepinne. Så kommer det eksisterende Windows-systemet opp, og så kan man velge å repartsjonere. Og da valgte jeg at nå skulle halvparten være til Linux. Og etter det så kan jeg da bute Linux eller Windows, avhengig av hva jeg ønsker å starte. De kan opplagt da ikke kjøre samtidig, men man kan aksessere Windows-filene likevel, for de ligger i samme fyllesystemet, men det ligger i forskjellige pallisjoner. Kan vi gå tilbake til sleidene? Ja. Jeg nevnte innledningsvis at man har en diskontroller som styrer en harddisk. Hvis vi tenker oss herr CPU-en med operativsystemet som kjører og gjør instruksjoner, så... Var det tidligere sånn at helt fra CPU-en, fra operativstemme, så kom det beskjeder... Hent sektornummer, så trekk det, og plate nummer fire. Men den detaljstyringen, den er nå på moderne harddisker, så er det over... Så styres det av en diskontroller, som er en helt egen liten datamaskin, som styrer harddisken, og får beskjeder fra... Operativstemme om sektorer som skal hentes. Men så styrer den harddisken lokalt.", "source": "lecture"}
{"lecture_id": "os15time1", "chunk_id": "os15time1_0014", "start": 2126.48, "end": 2283.88, "token_count": 457, "text": "Var det tidligere sånn at helt fra CPU-en, fra operativstemme, så kom det beskjeder... Hent sektornummer, så trekk det, og plate nummer fire. Men den detaljstyringen, den er nå på moderne harddisker, så er det over... Så styres det av en diskontroller, som er en helt egen liten datamaskin, som styrer harddisken, og får beskjeder fra... Operativstemme om sektorer som skal hentes. Men så styrer den harddisken lokalt. I tillegg så har man DMA, Direct Memory Access, og det gjør at operativstemme kan overlate en del av oppgavene med å styre diskontrolleren til DMA. Så i praksis så vil hvis operativstemme ønsker at en fil skal leses... Da gir operativsystemet beskjed til DMA om hvilken fil man ønsker. Så snakker DMA med diskontrolleren, harddisken henter filen, og DMA legger den filen rett i ramm. Her har vi disk-cash, som vi så på sist. Den disk-cashen inneholder da én eller flere filer fra harddisken. Og det Linux-systemet gjør det hele tiden. Det bruker alle de gigabyteene man har, til å kontinuerlig cashe filer. Men med en gang du kjører et program som trenger masse ram, så vil bare den cashen slettes. Og da må man helt ut på disk for å... Helt ut på disken for å hente fil. Neste tema er filsystemer. Men da sier jeg det passer godt å ta en pause. Så... da tar vi en pause der. Kom gjerne med spørsmål i pausen. Og havbryt veldig gjerne underveis også i neste time. Men hvis det er ting dere har... Så spør i pausen. Så tar jeg 15 minutter til 9.30.", "source": "lecture"}
