{"lecture_id": "os15time2", "chunk_id": "os15time2_0000", "start": 0.0, "end": 198.92, "token_count": 595, "text": "Og der starter jeg opptak av forelesningen. Det var... Det kom ett godt spørsmål i pausen, så vi kan starte med det. Skal vi se hvis jeg klarer å finne frem her. Sånn. Jo... Det var et spørsmål om forskjellene fra tidligere og til i dag om... Hvordan operativsystemet styrer harddisken. Og det jeg prøvde å poengtere, var at tidligere så detaljstyrte operativsystemet harddisken. På den måten at den ba eksplisitt om leseholde track sektornummer. Over hvor alle sektorene lå. Så operativsystemet styrte da de algoritmene som leser fra disken. Og det fins faktisk mange forskjellige typer algoritmer. En som er heisalgoritmen, og... Og heisalgoritmen, den fungerer sånn at... Typisk så trenger operatørstemaet en liste med sektorer. Som vi skal se, en fil... Selv om man har en hel fil, så kan den ligge i sektorer rundt omkring på disken. Og da vil man trenge en algoritme som på smartest mulig måte henter ut dem. Én teknikk kan da være at man ettersom lesehode... Og det flytter seg innover og utover, så plukker den med seg de sektorene. Og da ikke nødvendigvis i den rekkefølge som operativsystemet sier 'Jeg ønsker sektor 71524'. Da kan det være at den plukkes opp i en annen rekkefølge. Og dermed viser jeg masse sånne algoritmer som må kjøres. Tidligere kjørte operativsystemet og styrte disse algoritmene. Men i dag styres det av... Diskontrolleren her nede. Det er den som styrer algoritmene for å lese av den harddisken. Så det er én forskjell. I tillegg så kommer DMA som en avlastning. Slik at CPU-en, eller da operativsystemet gjennom kommando fra CPU-en, den ber om f.eks. at man skal lese fil.taxd. Og i stedet for å be om Sektor for sektor direkte harddisken, så overlater han denne jobben til DMA. Sånn at CPU-en egentlig bare trenger å si til DMA at jeg trenger fil.txd.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0001", "start": 154.44, "end": 359.96, "token_count": 587, "text": "for å lese av den harddisken. Så det er én forskjell. I tillegg så kommer DMA som en avlastning. Slik at CPU-en, eller da operativsystemet gjennom kommando fra CPU-en, den ber om f.eks. at man skal lese fil.taxd. Og i stedet for å be om Sektor for sektor direkte harddisken, så overlater han denne jobben til DMA. Sånn at CPU-en egentlig bare trenger å si til DMA at jeg trenger fil.txd. Så vil DMA på egenhånd snakke med harddisken og sørge for at sektor for sektor så blir fil... som operativstømmen ønsker, lagt inn i RAM. Og når det er ferdig i RAM, så sendes det et interrupt til CPU-en som sier at den IO-jobben, i dette tilfellet disklesing, er fullført. Og så kan da operativstømmen komme inn og fortsette med det den skal etter at den har fått film. Moderne operativsystemer med DMA og diskontroller i forhold til tidligere. Filsystemer. I utgangspunktet så er... Når en disk kommer fra fabrikken, så er den såkalt lavnivåformatert. Det betyr at da er disken delt inn i 512 bytes. Det kalles en sektor, og det er den minste leseskriveenheten. Så man skal skrive én bite i en disk, som man jo kan. Lage en fil med én bokstav. Så settes det av minst 512 bite til denne filen. Og så skrives det. Ja, så når man har formatert disken fra scratch, så da... Da er diskkontrolleren klar til å kunne lese og skrive sektorer. Man snakker ofte om å formatere disker. Og det er ikke sånn fabrikkformatering med 512 beiter osv. Den ligger fast. Men når man formaterer en disk, så følger man den tilbake til der hvor den var da den kom fra fabrikken. Ingen av sektorene er da i bruk. Et filsystem er rett og slett et system som holder orden på hvor alle de sektorene ligger på disken. Man kunne lage veldig enkle filsystemer, men det viser seg at det er ganske mange ting man må tenke på. Ikke minst at det kan skje fysiske problemer med disken.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0002", "start": 318.12, "end": 509.88, "token_count": 588, "text": "Den ligger fast. Men når man formaterer en disk, så følger man den tilbake til der hvor den var da den kom fra fabrikken. Ingen av sektorene er da i bruk. Et filsystem er rett og slett et system som holder orden på hvor alle de sektorene ligger på disken. Man kunne lage veldig enkle filsystemer, men det viser seg at det er ganske mange ting man må tenke på. Ikke minst at det kan skje fysiske problemer med disken. Det er magnetisering, så deler av dataene på disken kan bli borte. Så en viktig oppgave for filsystemer er å ha en måte å reagere på feil. Fysiske feil på disken. Det kan også skje på SSD-disker. Men først og fremst ved HDD-disker som snurrer rundt. Så det er lett å tenke seg at hvis man vipper på laptoper, så kan det bli diskproblemer. Det finnes en rekke filsystemer. De tre første her er for Windows. FAT er det gamle filsystemet som fortsatt brukes f.eks. på minnepinner. Som dere kan se i oppgaven i dag. NTFS har lenge vært standard på Windows. Men nå er Resilient FS, REFS, den siste versjonen av filsystemer. På Linux bruker man som regel XT. XT3 og... XT4 er da den siste av XT-variantene. Men det finnes også andre filsystemer. Som BTRF. BTRFS... ISO 9660. Det er typisk sånt filsystem som man bruker på CD- og DVD-disker. Så bruker man filsystemer. Og som jeg nevnte, da er det et typisk fett som brukes. Så filsystemet, det fordeler da mapper og filer på diskens sektorer. Og holder da orden på hvor alle disse sektorene er. Sånn at man kan si catfill og takestay. Og så kommer, selv om dette er en kjempefill på mange gigabytes, så kommer den pent ut i riktig rekkefølge. Vi skal se at fyllesystemer deles inn i... ... i større blokker enn sektorer. På Linux kalles blocks eller fragments, som brukes i otopser, som vi skal se. På Windows snakka man om clustre. Og da en blokk eller en cluster kan da være et antall sektorer.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0003", "start": 469.32, "end": 675.96, "token_count": 590, "text": "Sånn at man kan si catfill og takestay. Og så kommer, selv om dette er en kjempefill på mange gigabytes, så kommer den pent ut i riktig rekkefølge. Vi skal se at fyllesystemer deles inn i... ... i større blokker enn sektorer. På Linux kalles blocks eller fragments, som brukes i otopser, som vi skal se. På Windows snakka man om clustre. Og da en blokk eller en cluster kan da være et antall sektorer. Unnskyld? Det er et spørsmål i chatten. Ja. Disko1 og... Ja, skal vi se... Det er spørsmål om mintisering... Ja, han leser av alle punktene på sektoren på en gang. Ja, det er akkurat sånn som på... sånn som med cash. Den tar en stor blokk av gangen. Så den vil lese alle 512 bitene og så sende dem. Det er også litt sånn som med cash at veldig ofte så... Om man ikke trenger de dataene som ligger der, den i noen tilfeller... Så trenger man data som ligger innen den samme sektoren. Så det er på en måte en sånn... På samme måte som man ikke leser én av én bit fra RAM... Man leser alltid minst én bite. Altså minst åtte bit av gangen. Så gjelder det samme på fyllesystemer. Så størrelsen på blokker varierer, og det bestemmes når filsystemet lages. Så da kan man si at man vil ha blokkstørrelse på 4K, f.eks. Åtte sektorer. Ja, da er det jo noen ulemper og fordeler med blokkstørrelse. Jeg skal ikke si så veldig mye om det. Hovedtanken er da hvis man har store blokker, så da vil jo dataene ligge rett etter hverandre på en harddisk, på en HDD, en skivedisk, mens på SSD-disker så spiller jo ikke det så stor rolle. En ulempe med stor blokkestørrelse, og da en fordel med små, er at små blokker bruker mindre disk. Hvis du har svære blokker, 64K f.eks., og du lagrer bare bokstaven A, så må du sette av 64K på disken til hver eneste fil. Og det er opplagt en ulempe.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0004", "start": 640.56, "end": 815.8, "token_count": 593, "text": "på en harddisk, på en HDD, en skivedisk, mens på SSD-disker så spiller jo ikke det så stor rolle. En ulempe med stor blokkestørrelse, og da en fordel med små, er at små blokker bruker mindre disk. Hvis du har svære blokker, 64K f.eks., og du lagrer bare bokstaven A, så må du sette av 64K på disken til hver eneste fil. Og det er opplagt en ulempe. Men gjerne så finner man en sånn mellomstørrelse, som 4K f.eks., som fungerer OK til det meste. Og i tillegg... Når man da bruker RammCash og mellomlagrer i Ramm, så spiller det ikke så veldig stor rolle hvordan det er organisert på filsystemet. Og jeg prøvde å illustrere et filsystem, bare for å vise at det er en tabell over hvor filene ligger på disken. Nå har jeg tegnet opp dette som sektorer. Dette er sektor 1, 2, 3, 4, 5 og 6. På en disk vil det ligge og snurre rundt, mens på en SSD-disk så... Så vil dette bildet være mer naturlig. Men hovedpoenget er at la oss si vi har en fil på 6K her, og så har vi en blokkstørrelse på 2 kB, altså på fire sektorer. Da vil man fylle opp de 6 kB her med fil 1. Så ser vi jeg tegnet et litt annet mønster på fil 2. Der er det 4 kB, men likevel så trenger man to helleblokker. For man får ikke plass til... Ja, den fylles jo nesten opp. Men hvis denne var på litt over 2 kB, så ville man likevel trenge to. På den måten fordeler man sånn som fil 4 kommer her. Men så er litt av poenget at hvis man begynner å skrive én fil, så vet man ikke helt hvor den havner. Den legges ut etter et system, men det som kan skje, er at andre filer skrives innimellom. Og så trenger man to nye blokker. Man øker størrelsen på fil 1. Da kan de plutselig ende opp her. Lenger ned kommer det enda mer til fil 1, og den havner på 19 og 20. Så dermed vil sektorer som dette...", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0005", "start": 779.26, "end": 966.28, "token_count": 589, "text": "Men så er litt av poenget at hvis man begynner å skrive én fil, så vet man ikke helt hvor den havner. Den legges ut etter et system, men det som kan skje, er at andre filer skrives innimellom. Og så trenger man to nye blokker. Man øker størrelsen på fil 1. Da kan de plutselig ende opp her. Lenger ned kommer det enda mer til fil 1, og den havner på 19 og 20. Så dermed vil sektorer som dette... De vil spres utover disken. Så de ligger ikke nødvendigvis rett etter hverandre. Og dermed kan det, spesielt etter lang tid, når man sletter filer og går mye fram og tilbake... Så kan det oppstå hull og fragmentering, sånn som på denne disken. Her har jeg nå slettet fil 1. Og da ser vi at det er tomme områder her som ikke er i bruk. Det vil si, som vi skal se... Ofte så ligger faktisk dataene fortsatt. Men filsystemet har slettet sine pekere til disse dataene. Så det er vanskelig å finne fram. Filsystemet vet ikke hvor de ligger. Og disse blir markert som ledige, sånn at hvis det kommer en ny fil, Hvis man har mange sånne hull, så kalles det fragmentering. Men Linux og XD bryr seg stort sett ikke om fragmentering. Det fungerer greit hvis man passer på å spre dataene rundt omkring. På Windows har man såkalt defragmentering, som kan hjelpe på diskhastigheten. Man kjører da defragmentering. At systemet vil legge filer etter hverandre på disken. For SSD-disk gir det ikke mening med defragmentering. Men for harddisker som roterer, så kan det være en viktig faktor for hvor rask disken jobber. Ja... Når en fil slettes, så slettes ikke alle dataene, men linkene, eller pekerne i filsystemet, som sier hvilke blokker som ligger hvor. Det er typisk en tabell. FAT, som står for File Allocation Table, og det er da bare en tabell over hvilke sektorer som utgjør en fil. Og det er denne, i forhold til... Da slettes all informasjon om hvor de forskjellige blokkene ligger. Da kan det være veldig komplisert å sette sammen en fil igjen", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0006", "start": 932.38, "end": 1097.9, "token_count": 581, "text": "men linkene, eller pekerne i filsystemet, som sier hvilke blokker som ligger hvor. Det er typisk en tabell. FAT, som står for File Allocation Table, og det er da bare en tabell over hvilke sektorer som utgjør en fil. Og det er denne, i forhold til... Da slettes all informasjon om hvor de forskjellige blokkene ligger. Da kan det være veldig komplisert å sette sammen en fil igjen hvis man ikke vet hvor innholdet ligger. Ofte så ligger det da etter hverandre, sånn som i denne oppgaven med et bilde som dere skal se på denne uken, så... Hele bildet ligger etter hverandre i sektorer. Det er vanlig hvis du skriver et bilde til en disk, så blir det lagt etter hverandre. Det er ganske vanlig at det ligger sånn, og da kan det være mulig å få ut hele bildet helt. Men hvis det er fragmentert og ligger rundt omkring på mange steder på disken, så kan det være veldig vanskelig å få ut hele bildet.  Der kan man plukke ut tekstbiter. Da vil det ligge biter av tekst rundt omkring. Men selv om man da eksplisitt sletter filene... Og det man kan gjøre for å slette en fil, er f.eks. å skrive nuller. Eller skrive et gitt tegn over hele filen. Og da vil du jo slette innholdet også. Her ser vi et lite 3D-bilde av magnetisering. Og her kan vi se hvordan lesehodet kan oppfatte nuller og enere ved om det er magnetisert eller ikke. Men hvis man da har verktøy som er enda bedre enn lesehodene, altså det har høyere oppløsning, kan lese av magnetisering... Som i dette tilfellet, så vil man kunne da se... Så kan man se noe av det underliggende, altså hva som faktisk lå bak etter at det har blitt skrevet over av nuller og enere på den måten. Så kan man se antydning til... Oi, her var det kanskje en ener. Her er det en ener, og så nuller. Det er et sånt til pjusk. Avanserte verktøy som politiet og etterretningstjenesten bruker for å kunne lese ut innhold som er slettet på disker.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0007", "start": 1068.06, "end": 1245.46, "token_count": 598, "text": "Som i dette tilfellet, så vil man kunne da se... Så kan man se noe av det underliggende, altså hva som faktisk lå bak etter at det har blitt skrevet over av nuller og enere på den måten. Så kan man se antydning til... Oi, her var det kanskje en ener. Her er det en ener, og så nuller. Det er et sånt til pjusk. Avanserte verktøy som politiet og etterretningstjenesten bruker for å kunne lese ut innhold som er slettet på disker. Så ofte sier man at for å slette ordentlig en disk, så må du kanskje... Skrive over med randomt tall seks eller syv ganger for å unngå sånne effekter som dette. Og da begynner det å bli vanskelig. Men for å være helt sikker, så bør man helst løse opp disken i saltsyre så den er skikkelig borte. Første, da kan du si... Da er det helt borte. Da tenkte jeg å skulle se på fyllesystemet. Men før vi gjør det, så skal jeg prøve å... Vise hvordan man kan lage et filsystem på en fil, og hvordan man kan slette filer på denne og montere og så videre. Og kanskje skal vi prøve oss å få til å se om jeg kan finne igjen en tekst som er slettet. Så da hopper jeg inn her. Skal vi se... Jo, det jeg vil gjøre først da, er å lage en... Jeg prøver bare å lage en tom fil som inneholder data. Og én måte å gjøre det på er å bruke en kommando som heter DD.  Og det jeg skal prøve å gjøre, er også å ta IF-opsjonen til DV. Den sier hvilke data skal jeg bruke. Og da vil jeg bruke DevZero. Det er på en måte en device som bare inneholder nuller, altså ASKI-tegn 0. Så den skal da fylle den filen jeg lager, med tegn. Så jeg kaller den bare én. Så må jeg her spesifisere hvor stor fil jeg vil lage. Dette er da opsjoner til DD. Jeg kan si at jeg vil ha 8 mega. Og så blokker vi 11. Biter på 8 mega, og så count 1. Da vil jeg bare ha én sånn bit. Hvis jeg hadde sagt 10 her, så hadde jeg fått 80 mega.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0008", "start": 1199.78, "end": 1396.86, "token_count": 588, "text": "Det er på en måte en device som bare inneholder nuller, altså ASKI-tegn 0. Så den skal da fylle den filen jeg lager, med tegn. Så jeg kaller den bare én. Så må jeg her spesifisere hvor stor fil jeg vil lage. Dette er da opsjoner til DD. Jeg kan si at jeg vil ha 8 mega. Og så blokker vi 11. Biter på 8 mega, og så count 1. Da vil jeg bare ha én sånn bit. Hvis jeg hadde sagt 10 her, så hadde jeg fått 80 mega. Så får jeg da laget en fil som er på 8,0 mega. Så dette er da 8 mega. Hvis vi regner ut eksplisitt, så er mega 1024 ganger 1024. Hvis jeg ganger det med 8, så ser jeg at jeg får akkurat det tallet der. Så det er da en fil på 8 MW. OK. Men i utgangspunktet så er dette bare en tom fil med tegn som vi ikke ser engang. Hvis jeg tar HED på én fil, så vil vi se... Ja, jeg ser den er helt tom. Men det er bare fordi den har ASKI-tegn 0. Så den synes ikke. Men jeg kan da gjøre den til et image. Og det kan jeg gjøre med en kommando som heter mkfs. Den kan da lage et filsystem på denne tomme filen. Vanligvis bruker man mkfs direkte på harddisker og lager da filsystemet på en disk som er fysisk montert, f.eks. en minnepinne. Harddisk som er montert på maskinen. Så må man si hva slags filsystem man ønsker. Jeg ønsker da ekstra tre. Og så vil jeg lage det filsystemet på én fil. Og da ser vi... Her lager den filsystemet, og den bruker de fått 1K blokker. Og da er det da 8192 blokker. Og det er da... Åtte ganger 1024. Så hvis vi får 8000 sånne blokker med størrelse 1K... Det skal vi se etterpå. Når vi studerer filsystemet, skal vi se at det er 8000 sånne blokker. Og når man da lager en fil på et sånt system, så legges det inne i en blokk. Så kan jeg prøve å montere denne disken, eller dette imaget.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0009", "start": 1360.62, "end": 1543.62, "token_count": 595, "text": "Og da er det da 8192 blokker. Og det er da... Åtte ganger 1024. Så hvis vi får 8000 sånne blokker med størrelse 1K... Det skal vi se etterpå. Når vi studerer filsystemet, skal vi se at det er 8000 sånne blokker. Og når man da lager en fil på et sånt system, så legges det inne i en blokk. Så kan jeg prøve å montere denne disken, eller dette imaget. Og da må jeg ha sudorettigheter for å få til det. Og måten jeg kan montere det på, er med kommando mount. Så mount, jeg kan si... Jeg ønsker å montere én fil, altså imaget, på filsystemet under slash mnt. Men det kan være en hvilken som helst mappe i filsystemet. Men det finnes en standardlappe som heter slash mnt, som det er vanlig å montere. Filer og disker på. Så dette kunne vært noe... F.eks. en minnepinne som er plugget inn i laptopen. DF viser hva som er montert. Og ja... Dette er Snap som monterer en masse. Det er et sånt installasjonsprogram. Men kjelt nederst her så ser vi at den... Nå har jeg fått montert min fil. Og loop det brukes for å montere image. Tidligere i dag så vi på selve disken. Den er montert her på dev.loop. Så dette er en fysisk SSD-disk som er montert. Men man monterer den på helt samme måte med image. Og dermed så kan man... For eksempel så går det an å ta en... Og så kan man ta en kopi av hele dette disk-imaget. Og da får man noe som ligner på den filen jeg har. Men så er da poenget... Når jeg har den montert, så kan jeg gå inn på disken. Sånn. Så nå er jeg inne på disken. Det er en sånn mappe som heter Lost and Found, som er en sånn standardmappe som lages i EXA. Så kan jeg nå begynne å lage filer på denne disken. Det vil si, den rettighetene er... Jeg trenger fortsatt ruterettigheter. Akkurat som med vanlig filsystem, så kunne jeg endre rettighetene til Hauger og så videre, og så kunne jeg skrive der.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0010", "start": 1502.98, "end": 1707.58, "token_count": 595, "text": "så kan jeg gå inn på disken. Sånn. Så nå er jeg inne på disken. Det er en sånn mappe som heter Lost and Found, som er en sånn standardmappe som lages i EXA. Så kan jeg nå begynne å lage filer på denne disken. Det vil si, den rettighetene er... Jeg trenger fortsatt ruterettigheter. Akkurat som med vanlig filsystem, så kunne jeg endre rettighetene til Hauger og så videre, og så kunne jeg skrive der. Men jeg kan heller ta og blir ut. Nå har jeg fått laget én fil. Og så kan jeg lage kanskje en fil til. Sånn. Så nå har jeg to filer som ligger på disken. Og da vet jeg at selv om dette bare er filer på seks bites, så bruker hver av de en hel blokk. Hvis jeg nå øker størrelsen på pilen, så vil jeg fortsette å skrive utover i blokka. Men jeg kan prøve å gå ut herfra. Gå vekk fra disken. Og så kan jeg avmontere disken. Og nå er den borte. Hvis jeg nå prøver å gå inn... Så ligger det ingenting der. Da er det bare en tom mappe. Så hender det man må synke for at det skal skrives til disk, det som ligger der. Den synkoperasjonen vil sørge for at det skrives til disk, sånn at det ikke bare blir liggende i ram med ramcash eller lignende. Det jeg tenkte å prøve nå, var å prøve å montere den igjen. Og så gå inn og slette... Nei, hva er det jeg skal? Jeg skal montere... Nå må jeg finne ut hvor jeg var. Jeg var på disk. Her har vi en fil. Så det jeg skal prøve å gjøre, er å montere igjen én fil på... Mount... Og så skal jeg gå inn på Mount. Og så ser vi... Jeg kan gjøre det eksplisitt. Jeg har to filer her. Én fil og to fil. Så kan jeg nå ta opp RM2fil.tkst. Ok, nå sletter jeg den filen. Og da er... Hvis vi snakker om Linux-filsystemer og så videre, Det fins ikke noe ønderlig. Så hvis man har slettet en fil, så er den borte. Punktum. Så da kan du glemme å finne den.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0011", "start": 1673.14, "end": 1885.42, "token_count": 591, "text": "Og så ser vi... Jeg kan gjøre det eksplisitt. Jeg har to filer her. Én fil og to fil. Så kan jeg nå ta opp RM2fil.tkst. Ok, nå sletter jeg den filen. Og da er... Hvis vi snakker om Linux-filsystemer og så videre, Det fins ikke noe ønderlig. Så hvis man har slettet en fil, så er den borte. Punktum. Så da kan du glemme å finne den. Men det som vi skal se på nå, er at man sletter faktisk ikke selve filen. Man sletter bare linkene til filen. Så det skal være mulig å finne igjen innholdet av denne filen, selv om den ikke synes nå på fyllesystemet. Og du kan ikke med... Vanlig standard Linux-operativsystem, så kan du ikke finne igjen det innholdet i Tofil. Men vi kan prøve likevel. Vi kan først og så avmontere Umount MNT. Og da ser vi... Her så har vi nå fortsatt den enfield-disken. Og legger også merke til at størrelsen er fortsatt den samme. Vi hadde vel... Oi... Langt der oppe... Når vi lagde den. Skal vi se om vi finner størrelsen her, da... Her. 8388608. Den størrelsen er fortsatt den samme. Så imaget er på en måte... Hele disken har en gitt størrelse. Den er delt nå inn i 8000 blokker, så det endrer seg ikke. Når man skriver inn på den disken, så endrer du de. Men en disk har en gitt størrelse, og det vil også gjelde for et image som dette. Men det vi skal prøve nå, er å bruke otopsiverktøyet til å gå inn og se på den disken. Da må jeg prøve å hoppe dit. Sånn. Det står instruksjoner om hvordan man skal installere... Og bruke dette verktøyet på... Tanken er at man da bruker det på Linux-VM. Men så kan man... Når man skal installere på Linux-VM, men man skal bruke det, så kan du bruke det fra egen laptop. For den kjører da over web. Så hvis dere følger instruksjonene, så kan dere se senere hvordan man setter opp. Og det er ganske rett frem. Men nå vil jeg lage en ny case for å se på et image.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0012", "start": 1847.02, "end": 2066.5, "token_count": 594, "text": "Og bruke dette verktøyet på... Tanken er at man da bruker det på Linux-VM. Men så kan man... Når man skal installere på Linux-VM, men man skal bruke det, så kan du bruke det fra egen laptop. For den kjører da over web. Så hvis dere følger instruksjonene, så kan dere se senere hvordan man setter opp. Og det er ganske rett frem. Men nå vil jeg lage en ny case for å se på et image. Man trenger et casename. Jeg bare kaller det det samme som filen. Så tror jeg man trenger en investigator. Det er da HH. Og så new case. Og da ser vi... Directory created. Og så må jeg bare si Adhost... Ja... Jeg kan kalle det en HH-lapp. Det er da liksom maskinen som denne disken har ligget på. Og så er det en del forskjellige ting som man kunne bruke i en mer seriøs case, men jeg velger bare Adhost. Og så må jeg legge til det imaget jeg har. Det jeg ønsker å se på. Og da må jeg ha full path til det imaget som... ... som jeg skal bruke. Ja, men så har jeg glemt en ting, og det kan fortere gjøres når jeg skal bruke dette her. Det imaget jeg har lagd og bruker, det er jo én fil, og det ligger på laptopen min. Otopsy kjører på min Linux-VM. Så aller først må jeg kopiere det dit. Så da hopper jeg hit og så kopierer jeg nå hele disken. Og dette kunne være en kopi av en fysisk harddisk eller minnepinne som jeg nå kopierer rundt omkring. Så jeg skal ha den til group 100 at os 100. Kolon... ja. Så nå kopierer jeg den inn på... Inn på Linux-laptopen, og der, inne på... Inne som Group 100, der har jeg startet Otopsy. Frenzy Broser. Det er det programmet som kjører på web. Her ser vi jeg bruker 8166. Det er da IP-en som jeg har lokalt her på min laptop. Så sånn virker systemet. Så nå kan jeg komme tilbake her. Og så kan jeg skrive inn at den ligger... Filen ligger på Group 100. Og så la jeg den på én fil. Og så må man velge partition. Det står også i oppgaven denne uken. Partition, og så Next.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0013", "start": 2023.3, "end": 2224.38, "token_count": 580, "text": "Frenzy Broser. Det er det programmet som kjører på web. Her ser vi jeg bruker 8166. Det er da IP-en som jeg har lokalt her på min laptop. Så sånn virker systemet. Så nå kan jeg komme tilbake her. Og så kan jeg skrive inn at den ligger... Filen ligger på Group 100. Og så la jeg den på én fil. Og så må man velge partition. Det står også i oppgaven denne uken. Partition, og så Next. Så skal man egentlig bare ignore hash value. Det er litt sånn for hvis man skal forsikre seg om at det er riktig fil, osv. Så kan man lage sånn MD5-hash, sånn at senere når du skal bevise dette i retten, så kan du dobbeltkontrollere at det er riktig hash. Men den motepoint der kan man bare beholde. Otopsi ser at det er en XD, så dette ser OK ut. Så nå kan jeg da trykke på OK, for nå har jeg lagt til dette imaget. Og da har jeg fått opp en case med et image som jeg kan analysere. Og da er det egentlig bare å trykke på Analyze. Og så kan jeg begynne å se på fillesystemet. Så nå har jeg på en måte lagd en liten disk, og så har jeg fått den inn i systemet. Jeg kan se på image details her oppe. Og da ser vi litt sånn at det er en X3. Og så her kommer det litt mer metainformasjon. Det er de pekerne som peker til hvor sektorene eller fragmentene ligger. Og her ser vi Blokkrange. 0 til 8191. Det betyr at det er 8192 blokker med størrelse 1024. Så når vi skal snakke om de blokkene, så må vi si at denne filen ligger i blokk nummer 6856. Da kan man gå inn på File Analysis. Det er kanskje det beste stedet å starte. Oi... Nå ser jeg faktisk at jeg har kommet inn på feil fil. Eller er det riktig? Jeg testet ut dette i går. Skal vi se... Nei, det ser riktig ut. 09.59.27. Ja. Nei, dette er riktig. Jeg kalte det 1fil.tkc og 2fil.tkc. Og 2fil.tkc... Den ser vi er slettet.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0014", "start": 2171.42, "end": 2423.02, "token_count": 600, "text": "at denne filen ligger i blokk nummer 6856. Da kan man gå inn på File Analysis. Det er kanskje det beste stedet å starte. Oi... Nå ser jeg faktisk at jeg har kommet inn på feil fil. Eller er det riktig? Jeg testet ut dette i går. Skal vi se... Nei, det ser riktig ut. 09.59.27. Ja. Nei, dette er riktig. Jeg kalte det 1fil.tkc og 2fil.tkc. Og 2fil.tkc... Den ser vi er slettet. Men vi kan se på den filen der. Den kan vi jo se på, for den ligger på disken. Den er det ikke noe problem på. Så jeg klikker på den, og så kan jeg displaye den som... Som Aski. Skal vi se. Men hvorfor kommer ikke den opp? Et øyeblikk. Ja, jeg ser det fungerer litt dårlig med zoom her. Skal vi se... Det problemet nå er å få vist vinduet. Jeg tror jeg må ta den litt mindre sånn. Men det står her nede... Den layteksten der er én fil. Men vi må ha litt større. Sånn. Så problemstillingen er nå... 1fil.tk, den ligger her. Og hvis vi husker tilbake... Så sto det en tekst inni den enfil.tk. Og det var den teksten Enfil der. Så det er på en måte filen. Og hvis jeg nå klikker på den filen... her... Så kan vi se. Her er ID-none nummer tolv. Og her er da data om denne filen. Enfil.tk. Og denne er ikke slettet. At den ligger i blokk nummer 1537. Så filsystemet gjør da inode 12, peker på blokk 1537, og der ligger da teksten til enfill.tk. Hvis dette var en fil som krevde flere blokker, altså en som var større enn en K, så ville den allokere mange blokker. Så en tusen blokker som kunne ha en en megabyte for fil. Men vi går nå inn på den ene blokken. Trykket jeg på det fragmentet, eller som det også kalles, eller blokk 1537. Og her ser vi... Her står den teksten. Og her ser vi da 1K med data. Hvis man trykker på Heks display, så kan man se tydeligere hvilket data det er. Vi starter på null, og helt i starten på denne blokka", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0015", "start": 2378.22, "end": 2566.82, "token_count": 589, "text": "altså en som var større enn en K, så ville den allokere mange blokker. Så en tusen blokker som kunne ha en en megabyte for fil. Men vi går nå inn på den ene blokken. Trykket jeg på det fragmentet, eller som det også kalles, eller blokk 1537. Og her ser vi... Her står den teksten. Og her ser vi da 1K med data. Hvis man trykker på Heks display, så kan man se tydeligere hvilket data det er. Vi starter på null, og helt i starten på denne blokka så ser vi at det står én fil. Og det er da aski-tegnen for én fil. Men vi ser også at den bruker én K, eller en hel blokk, 1024 bite for å lagre denne bitte lille filen. Men så er spørsmålet hvor... Hvor er den andre filen? Og det... Problemet er da at filstemma har nå slettet linkene. Så selv om vi går på File Analysis her, så er det ikke noe... Den der er på en måte bare... Den sier... Ja, den hadde INOD13, men den er ikke allokert mer. Innholdet av INOD13 er slettet. Og dermed er filen borte. Men den ligger et eller annet sted, så hvis man leter godt, så kan man finne 2Fill.txe. I utgangspunktet så kan den ligge hvor som helst på disken blant de 8000 blokkene som man har på denne disken. Og da kan man begynne å lete. Ja, vi kunne jo... Én ting som funker noen ganger, er å starte ut fra den én fil... Gå til Inode 12 og se hvor den peker. 1537... Og så kan man prøve å se i nærheten der. Hvis jeg skriver inn 1530 og ber om ti blokker, så får jeg alle blokkene som er i nærheten. Der ser vi... Her er én fil, men ikke noe mer. Men da har jeg... Med en rekke blokker etter hverandre. Og inne i de blokkene... Så der starter en blokk, og der ligger én fil. Så kan man lete gjennom og prøve å finne to fil. Når det er tekst, så går det an å søke. Så jeg kan f.eks. søke på strengen fil. Da søker jeg på en måte gjennom all teksten.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0016", "start": 2526.06, "end": 2705.9, "token_count": 591, "text": "så får jeg alle blokkene som er i nærheten. Der ser vi... Her er én fil, men ikke noe mer. Men da har jeg... Med en rekke blokker etter hverandre. Og inne i de blokkene... Så der starter en blokk, og der ligger én fil. Så kan man lete gjennom og prøve å finne to fil. Når det er tekst, så går det an å søke. Så jeg kan f.eks. søke på strengen fil. Da søker jeg på en måte gjennom all teksten. Og her ser vi jeg får noen treff på 1-fil og 2-fil. Og spesielt her nede så får jeg en treff på 2-fil... På 7169. Så da kan jeg hoppe dit. Og vips, der ser vi. Der fant jeg 2-fil. Og den lå da i blokk 7169. Og som vi ser, selv om jeg... Slettet filen med RM og greier... Så ligger fortsatt den teksten der. Problemet er at vi ikke har filsysteminformasjonen som sier nøyaktig hvor den ligger. Hvis dette har vært en stor fil som var fragmentert rundt omkring, ville det vært en kjempejobb å finne den, for du har ikke informasjon om hvor bitene ligger. Men likevel så kunne man da finne ut deler. Og skjøte dem sammen osv. Så hovedpoenget er at... 7169, da kan man gått... Når man finner ut hvor... En fil ligger... Hvis man vet fragmentnummeret... Kjenner til den blokken, så kan man bare gå dit og peke på View. Og så ser vi... Her ligger to filer. Det er den blokken.  Men problemet er da at når du gjør RM på en fil, så sletter du det tallet der rett og slett fra filsystemet, så man ikke vet lenger hvor den ligger. Men det kan være mulig sånn som dette her å likevel finne fram fil. Og i oppgaven denne uken så går det ut på at man skal... Jo, om man skulle gjøre noe lignende, men med et bilde, Siden bildene ligger pent etter hverandre, er det mulig å gjenskape bildet ved å plukke ut alle blokkene som utgjør bildet, og så hente det ut fra otopsi. Så får man ut et helt bilde selv om det er slettet fra en disk.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0017", "start": 2666.26, "end": 2864.54, "token_count": 586, "text": "Men det kan være mulig sånn som dette her å likevel finne fram fil. Og i oppgaven denne uken så går det ut på at man skal... Jo, om man skulle gjøre noe lignende, men med et bilde, Siden bildene ligger pent etter hverandre, er det mulig å gjenskape bildet ved å plukke ut alle blokkene som utgjør bildet, og så hente det ut fra otopsi. Så får man ut et helt bilde selv om det er slettet fra en disk. Ja. Det er også en oppgave som går på NTFS, og da vil dere se at NTFS-filsystemet... Det ligner på den måten at det har mye av de samme egenskapene. Det er egentlig en liste over clustere, men det er bare organisert på en litt annen måte. Så... Jeg har noen slider her med NTFS, men jeg tenker... Ja, nå ser jeg klokka er veldig mye, så jeg overlater de siste slidene til et lite selvstudium. Prøv å se på disse samtidig som dere gjør oppgaven om NTFS, som er denne uken, hvor du da bruker otopsi og leter rundt på et NTFS-system, og da vil du se at det er organisert på denne måten som er beskrevet her. Men hovedpoenget er at det bare er en liste over hvor klusterne ligger. På samme måte Linux filsystem først og fremst en liste over hvor blokkene eller fragmentene ligger. Men det er én liten ting som... Hvis dere holder ut fem ekstra minutter, så skal jeg si litt om raid helt til slutt. For der er det en ganske morsom sak med raid og paritet. Så... Aller først, hva er raid? RAID står for Redundant Area Independent Disks. Og redundant betyr overflødig eller i overflod. Generelt betyr redundant disk at man lagrer ting mer ett sted. Og det er da typisk for å lagre det i parallell, sånn at man kan lese det hurtigere. Det fins mange raid-nivåer. Raid, som veldig mye annet innen operativsystemet, er et system for å øke hastigheten. Disker er trege, så de hjelper veldig mye med raid for å gjøre ting i parallell. Så akkurat som CPU-er, at man bruker flere CPU-er og gjør ting i parallell,", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0018", "start": 2816.92, "end": 3001.18, "token_count": 590, "text": "Generelt betyr redundant disk at man lagrer ting mer ett sted. Og det er da typisk for å lagre det i parallell, sånn at man kan lese det hurtigere. Det fins mange raid-nivåer. Raid, som veldig mye annet innen operativsystemet, er et system for å øke hastigheten. Disker er trege, så de hjelper veldig mye med raid for å gjøre ting i parallell. Så akkurat som CPU-er, at man bruker flere CPU-er og gjør ting i parallell, Og Raid 0. Det er egentlig ikke Raid, for det er ikke redundant, men man striper da diskene. Det å stripe disker er at man da tar en fil, og så skriver man den over to disker. Så hvis jeg skulle lagre den setningen her, minst to disker i stripediskene, så ville kanskje minst to disker ligge på den første disken... Og det er jo ikke redundans, men dette vil da være hurtigere å lese, for da kan jeg lese fra to disker samtidig og nesten doble hastigheten. Jeg leser minst to disker fra den ene og stripediskene på den andre. Raid 1, det er ekte raid. Da har man to disker, og så dupliserer man dataene. Så det skrives på begge diskene. Det vil ta like lang tid å skrive. Men det går hurtigere å lese, for da kan du lese én setning fra hver. Og så går det dobbelt så fort å lese. Så er det RAID 3 og 4. Der bruker man i tillegg paritet. RAID 3 og 4 er ikke så mye brukt, så vi hopper til RAID 5. Da har man minst tre disker, og pariteten lages fordelt på diskene. Det er om man har et odd- eller likeantall enere. Altså hvis man er tre enere, så har man paritet 1. Hvis man er fire enere, så har man paritet 0. La oss si du ser på én bite. Og det brukes i mange andre sammenhenger til å feilsjekke, for å sjekke om bitt har endret seg underveis. Med RAID5 bruker man minst tre disker. Og så fordeler man dataene på disse diskene, sånn at det kan både skrives og leses parallelt. Og pariteten lagres også fordelt på diskene.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0019", "start": 2960.12, "end": 3131.22, "token_count": 586, "text": "Altså hvis man er tre enere, så har man paritet 1. Hvis man er fire enere, så har man paritet 0. La oss si du ser på én bite. Og det brukes i mange andre sammenhenger til å feilsjekke, for å sjekke om bitt har endret seg underveis. Med RAID5 bruker man minst tre disker. Og så fordeler man dataene på disse diskene, sånn at det kan både skrives og leses parallelt. Og pariteten lagres også fordelt på diskene. Og det betyr at uansett hvilken... Hvis du har én disk som nå ryker, så vil man kunne gjenopprette alt som var på diskene. På alle diskene ut fra de to eller flere gjenværende diskene som ikke har røket. Og det høres jo veldig rart ut, men det funker. Selv om du har ti disker, uansett hvilken av de som ryker, så kan man rette opp innholdet fra paritetsdisken. Og samtidig så har man den samme fordelen som med RAID-0, at man leser i... Sånn at det går mye raskere. Dette er litt komplisert, men vi skal se på et konkret eksempel. Så da vil jeg se at det faktisk ikke er så komplisert. Så dette er det siste eksempelet vi skal gå gjennom. Nå bruker jeg raid 3 fordi at... For det første så lagrer det alt pariteten på én disk. Raid 5, som er vanligere, den fordeler denne pariteten. Og det fungerer like bra, men det er litt enklere prinsipp å se på... Pariteten på den måten ved at man har den på én disk. Vi ønsker å lage alle disse fire kolonnene med data. Dette er dataene våre. Og så sprer vi det utover på disker. Når vi skal lese det inn, går det fire ganger så fort som om alt lå på disken. I tillegg har vi denne mystiske paritetsdisken. Den er veldig enkel. Hvis det er et like antall enere... Altså hvis det er to... Nei... Jo, hvis det er et like antall enere... Hvis det er to... Her er det også to. Eller fire enere. Så er pariteten null. Det samme ville det vært...", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0020", "start": 3090.46, "end": 3280.22, "token_count": 600, "text": "Dette er dataene våre. Og så sprer vi det utover på disker. Når vi skal lese det inn, går det fire ganger så fort som om alt lå på disken. I tillegg har vi denne mystiske paritetsdisken. Den er veldig enkel. Hvis det er et like antall enere... Altså hvis det er to... Nei... Jo, hvis det er et like antall enere... Hvis det er to... Her er det også to. Eller fire enere. Så er pariteten null. Det samme ville det vært... Da ville pariteten vært null. Men hvis det er et odd-antall... Sånn som her er det tre enere. Da er pariteten én. Her er det én ener. Da er pariteten én. Hvis du først har satt opp denne disken, så er det veldig kjapt å lese ut pariteten. Det kan man gjøre med en exor, og det er ofte hardware som gjør dette. Men så kommer det geniale. Nå hevder jeg at uansett... Hvis hvilken av disse diskene som måtte ryke, sånn at du mister absolutt all informasjon, så kan man bygge opp disken igjen fra paritetsdisken. Det er klart at hvis paritetsdisken ryker, så gjør det ikke noe. For da kan man bare regne ut pariteten på nytt. Så her kommer årets siste slide - paritet og trolldom. Hvordan kan man nå trylle frem dataene? Disk 2 her ryker. Tenk bitte lite grann på det. Kanskje... Kanskje noen som har noen ideer om det, så kan dere foreslå i chatten. Disk 2 er nå slettet totalt. Hvordan kan jeg få tilbake bittene som var der? Ja, da skal jeg prøve å... Mens dere tenker, så skal jeg prøve å sette på... Dokumentkamera. Der. Og så skal jeg begynne å trylle. Så kan jeg prøve å bare... Uten å si noe, så kan jeg... Det ville vært lett for meg å jukse, men jeg lover - jeg jukser ikke. Jeg ser bare på den disken her. Det pleier å være et glansnummer når jeg har tavle, og det er opplagt at jeg ikke jukser. Men jeg kan nå, ut fra paritetsdisken og de andre diskene, skrive ned verdien på disk 2. Og da ser jeg at her må det være.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0021", "start": 3242.2, "end": 3436.18, "token_count": 590, "text": "Så kan jeg prøve å bare... Uten å si noe, så kan jeg... Det ville vært lett for meg å jukse, men jeg lover - jeg jukser ikke. Jeg ser bare på den disken her. Det pleier å være et glansnummer når jeg har tavle, og det er opplagt at jeg ikke jukser. Men jeg kan nå, ut fra paritetsdisken og de andre diskene, skrive ned verdien på disk 2. Og da ser jeg at her må det være. Her må det være 1. Her må det være 0. Her må det være 0. Her må det være 1. Her må det være 0. Og her må det være 1. Jeg skal hoppe tilbake, og så må jeg se... Stemmer det i forhold til de opprinnelige slidene? Ja. Hvis vi hopper fram og tilbake... 1.00, 1.01, 1.00, 1.01. Så... Og dere har sikkert sett... Pariteten sier jo om det er et odde eller like antall nuller. Nei... Et odde antall enere. Så i det første tilfellet her, siden det var en ener og paritetsvis en visu null, så måtte det bli en ener for å gi den samme pariteten. Så på den måten kan man da bare regne ut. Her var det tre enere. OK, da er pariteten 1, så da må det være 0. Og her var det to enere. Pariteten er 0, så da må det være 0. I denne kolonnen så måtte det komme en ener, for pariteten var 0. Og da måtte jo det ha vært en ener. To enere i paritet 0. Her var pariteten 1, så da må det være 0. Og igjen her er det tre enere. Paritet 0, det stemmer ikke, så den må ha vært en ener. Og på den måten så kan man da... Vi kan lett tenke oss at selv om disk 4, disk 3 eller disk 1 røyk, så ville du kunne trylle frem disken igjen ved hjelp av paritetsberegningen. Her kan du ha ti disker i parallell, og bare ved å legge til én ekstra disk, så får du rendudans ved at om én disk ødelegges, så kan du bygge opp neste. Første spørsmål i chatten, hva om to disker ryker?", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0022", "start": 3398.82, "end": 3588.12, "token_count": 598, "text": "så den må ha vært en ener. Og på den måten så kan man da... Vi kan lett tenke oss at selv om disk 4, disk 3 eller disk 1 røyk, så ville du kunne trylle frem disken igjen ved hjelp av paritetsberegningen. Her kan du ha ti disker i parallell, og bare ved å legge til én ekstra disk, så får du rendudans ved at om én disk ødelegges, så kan du bygge opp neste. Første spørsmål i chatten, hva om to disker ryker? Vel, da er du ferdig. Hvis to disker ryker, så er det krok mot døra. Da har du mistet alle dataene. Men heldigvis så er det sånn at det er sjelden at... Altså, disker ryker etter en stund, men det er heldigvis sjelden at de ryker helt samtidig. Og med harddisk... Nei, med... Raid... Med spesiell hardware for raid så kan den faktisk regne ut dette veldig raskt on the fly. Sånn at om en disk er ødelagt en stund, så kan dissystemet fortsatt stå og virke lenge. Ok, beklager. Da har jeg gått kjempemasse over tiden. Men nå får dere til gjengjeld en kjempelang pause helt fram til eksamen, eller iallfall til... Prøveeksamen. Kom gjerne med forslag til når dere ønsker prøveeksamen. Vi må koordinere litt i forhold til... Ja, det er mange som har skytetjeneste, f.eks. Så vi må koordinere litt i forhold til det. Men først og fremst, prøv på ukens oppgaver. De er morsomme. Spesielt den med spionoppgaven. Få ut bildet, men gjør et forsøk. Så kommer det et fyldig løsningsforslag etter hvert, hvis dere så først. Ok. Da er det spørsmål her... Når skal dere publisere fasit til obligen? Ja, godt spørsmål. Jeg har... Jeg har publisert noe. Skal vi se... Jeg tror jeg har publisert til og med Oblique 2 i hvert fall. Hvis vi går inn... Jo, det er en Oblig. Vi ser ikke absolutt alt jeg har... Men så... Til og med Obligue 2 er publisert. Å publisere før alle har fått svar på objekt-treet", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0023", "start": 3538.68, "end": 3734.62, "token_count": 587, "text": "Ok. Da er det spørsmål her... Når skal dere publisere fasit til obligen? Ja, godt spørsmål. Jeg har... Jeg har publisert noe. Skal vi se... Jeg tror jeg har publisert til og med Oblique 2 i hvert fall. Hvis vi går inn... Jo, det er en Oblig. Vi ser ikke absolutt alt jeg har... Men så... Til og med Obligue 2 er publisert. Å publisere før alle har fått svar på objekt-treet og eventuelt sjansen til å prøve på nytt. Men det som det kan anbefales sånn generelt for å jobbe med kurset fremover, er å begynne å se på gamle eksamensoppgaver. Først og fremst... Jeg har vært litt av og på dette kurset. I 2012 var det Erik Hjelmås som hadde kurset, med litt annet pensum. Men fra våren 2017 og til 2020 til nå, så har jeg hatt kurset... Oi, du ser kanskje ikke slutten her. Her. Til og med 2020. Så den beste treningen er kanskje å jobbe med disse eksamsoppgavene fra 2017 og fram til 2020. Og det er veldig viktig når dere jobber med eksamsoppgaver, at dere ikke bare går rett på løsningsforslaget, men at dere gjør et seriøst forsøk på eksamsoppgavene og så ser på løsningsforslaget etterpå. Det å jobbe videre med tidligere oppgaver er kanskje den beste måten Det er kanskje den beste måten å lære dette på, å jobbe aktivt med oppgaver. Det er først da man får en dypere forståelse for dette stoffet. For det er mye stoff, og det er en del litt kompliserte sammenhenger. Så jobb aktivt med stoffet når dere jobber videre med det. Det er mitt hovedbudskap. Da vil jeg takke for følget så langt, spesielt til dere som trofast har stått opp hver tirsdag morgen. Veldig bra jobba. Håper virkelig dere får igjen for det på eksamen, at dere gjør en bra eksamen. Ja, det var... Det kan jeg ta opp her. Det var egentlig et godt spørsmål om begrunnelse for å gjøre... For å ha karakter på eksamen.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0024", "start": 3694.9, "end": 3884.66, "token_count": 586, "text": "Det er mitt hovedbudskap. Da vil jeg takke for følget så langt, spesielt til dere som trofast har stått opp hver tirsdag morgen. Veldig bra jobba. Håper virkelig dere får igjen for det på eksamen, at dere gjør en bra eksamen. Ja, det var... Det kan jeg ta opp her. Det var egentlig et godt spørsmål om begrunnelse for å gjøre... For å ha karakter på eksamen. For det var en som uttrykte at det var litt urettferdig om... Om noen får hjelp på eksamen av familie eller venner osv. Som hjelper til på eksamen. Det er jo opplagt juks, så jeg håper og jeg tror også at det er veldig få som gjør det. Så tror jeg dette faget er såpass vanskelig at det er ikke så mange som har familiemedlemmer eller venner som kan hjelpe til med en sånn eksamen. For du må jobbe veldig målbevisst, konkret frem med dette stoffet for å kunne det såpass godt at du på tre timer kan komme opp med svar på en ganske omfattende eksamensoppgave. Som gjør at det vil skje i veldig liten grad. I tillegg er det en begrunnelse at det er veldig kjedelig for mange av dere som får veldig mange pass-fail-karakterer. Spesielt når du skal gå videre på studier og søke om master- og ph.d. etter hvert. Så er det litt kjedelig å jobbe veldig hardt med kurs. Og så bare - bare få en godkjent når du ellers kanskje ville fått en A eller en B. På eksamen skal jeg også prøve å differensiere litt, sånn at man ikke får samme oppgaver. Så det er vanskelig å samarbeide om oppgaven også. Så jeg håper i hvert fall at det skal gi rettferdige karakterer for alle. At dette har vært en tung tid. At det er vanskeligere forhold å studere under. Og ja, det vil i hvert fall jeg prøve å ta hensyn til. Jeg tar ofte hensyn til sånne aspekter ved at... Hvis det viser seg at en eksamensoppgave har vært veldig vanskelig... Det er ikke alltid så lett å se for meg - oi, dette var vanskelig. Hvis det er en veldig vanskelig oppgave,", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0025", "start": 3840.92, "end": 4011.84, "token_count": 595, "text": "Så jeg håper i hvert fall at det skal gi rettferdige karakterer for alle. At dette har vært en tung tid. At det er vanskeligere forhold å studere under. Og ja, det vil i hvert fall jeg prøve å ta hensyn til. Jeg tar ofte hensyn til sånne aspekter ved at... Hvis det viser seg at en eksamensoppgave har vært veldig vanskelig... Det er ikke alltid så lett å se for meg - oi, dette var vanskelig. Hvis det er en veldig vanskelig oppgave, så viser det seg at 1 av 100 har klart å svare på det... Så skjønner jeg da i ettertid at dette var kanskje mye vanskeligere enn de studentene som hadde eksamen i fjor. Og da kan man i ettertid, sammen med sensor, gjøre en vurdering om at man gir en litt snillere... Man setter rett og slett litt snillere grenser Så den type vurderinger gjøres hele tiden, og det vil jeg også gjøre i år. Men ikke ta det som en såpepute. Jobb seriøst fram til eksamen. Og prøv å gjøre det så bra som bare mulig. Og så får dere forhåpentligvis, med god jobbing, så får dere en god karakter også. Ok. Da vil jeg takke for følget så langt, og så... Da ses vi forhåpentligvis på prøveeksamen. Kanskje vi til og med kan ha en fysisk gjennomgang. Vi får se. Blir det en prøveeksamen som øving til? Ja, det blir det. Det gjenstår å se når. Jeg må snakke med Inspera-admin også. I fjor fikk vi til i hvert fall én prøveeksamen som var i Inspera. Helt samme setting som dere får til eksamen. At dere sitter hjemme og gjør en tretimerseksamen. Så jeg håper dere får til i hvert fall ett tilfelle. Kanskje to også. Kanskje jeg kan gjenta prøveeksamen fra i fjor. For der har jeg allerede en gjennomgang på videoer. Ja... Derfor kommer det flere spørsmål her. Det er bra. I den grad det blir teorispørsmål, hvordan gjør du med kilder hvis det blir aktuelt? Det er et godt spørsmål. Det kommer nok ikke til å bli så veldig mye teori", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0026", "start": 3979.24, "end": 4158.3, "token_count": 594, "text": "Så jeg håper dere får til i hvert fall ett tilfelle. Kanskje to også. Kanskje jeg kan gjenta prøveeksamen fra i fjor. For der har jeg allerede en gjennomgang på videoer. Ja... Derfor kommer det flere spørsmål her. Det er bra. I den grad det blir teorispørsmål, hvordan gjør du med kilder hvis det blir aktuelt? Det er et godt spørsmål. Det kommer nok ikke til å bli så veldig mye teori av den typen som er veldig lett å google. Hva er en CPU, eller... Men i den grad det blir det, så gjelder det samme kilde... Alltid. Hvis man bruker kilder, så må man referere til det. Og det vil ikke godtas som et godt svar på en eksamensoppgave hvis man bare tar en kopi av noe som ligger et sted, selv om man da skriver en referanse. Hvis man opplagt plagerer, bare kopierer noe fra et eller annet sted... Av hverandre. Så er det et plagiat når man da... Hvis man ikke oppgir referanse. Så... Man må være ganske forsiktig... Hvis du er veldig inspirert av innholdet på et eller annet sted på nettet, så er det veldig viktig å ha med en referanse, sånn at ikke man kommer etterpå og blir stoppet av Urkuns plagiatkontroll. Da får man 100 % likt, og så så man der. For det kan være ganske alvorlig. Men når det er sagt sånn som eksamen i fjor... Den er nok ganske bygd opp på den måten at vi ser på konkrete problemstillinger. Jeg viser f.eks. et program som kjører, og så skjer sånn og sånn. Og så er spørsmålet hvorfor bruke så mye ramm i dette tilfellet? Hvorfor tar dette dobbelt så lang tid som... Den type spørsmål som man måtte tenke og bruke det man har lært, i større grad enn direkte teorispørsmål. Så det vil nok være litt forskjellig fra... Hvis man ser på tidligere eksamensoppgaver, så er det en del direkte teorispørsmål fordi da var det eksamen uten hjelpemidler. Så det er først og fremst de oppgavene. De oppgavene som er mer konkrete, som er de mest mestrelevante.", "source": "lecture"}
{"lecture_id": "os15time2", "chunk_id": "os15time2_0027", "start": 4121.46, "end": 4189.68, "token_count": 214, "text": "Den type spørsmål som man måtte tenke og bruke det man har lært, i større grad enn direkte teorispørsmål. Så det vil nok være litt forskjellig fra... Hvis man ser på tidligere eksamensoppgaver, så er det en del direkte teorispørsmål fordi da var det eksamen uten hjelpemidler. Så det er først og fremst de oppgavene. De oppgavene som er mer konkrete, som er de mest mestrelevante. Ok. Da håper jeg dere ikke er helt utslitt. Men ta gjerne en pause og kom tilbake på laben. Så skal jeg nå lage break-out-rooms til alle studentassistentene. Så kan dere få hjelp. Jeg tar et kvarters pause. Så takk for i dag og takk for følget dette som hestere. Stå på videre.", "source": "lecture"}
