{"lecture_id": "os1del1", "chunk_id": "os1del1_0000", "start": 0.0, "end": 193.84, "token_count": 599, "text": "Ja, så dette er... Her kommer dere inn i Canvas. Det jeg kommer til å bruke i år, det er... Det står en link først i Canvas, og det er en link til en kurs i det. Som ser sånn ut. Og dette er egentlig et... Når dere ser det er litt sånn farger og design fra sent 90-tall... Dette er litt sånn retro websider, men de funker ganske bra, iallfall. Og... ja, så når dere ser opplegget, så er... all informasjon dere trenger, ligger på denne ene siden. Dere ser sånn som i dag, tirsdag 5.1, så er det første OS-forelesning. Og her har jeg lagt ut notater. Også en link til slides. Og her ligger all den infoen jeg kommer til å gå gjennom. Jeg prøver å legge ut det på forhånd, så dere kan se på. Og gjerne forberede dere på denne forelesningen også. Så står det noen F-er og D-er nedover her. Og det F betyr rett og slett forelesning, sånn som i dag. Og den kommer til å gå live hver tirsdag. Etter hvert kanskje i forelesningssalen, hvis smittetallene tillater det. Men så ser du at det også står en D, og det står for digital. Og det vil på en måte være en slags digital forelesning. Der kommer jeg til å gå gjennom det som er pensum for dette området. Praktisk programmering osv. Det kommer jeg til å legge ut som videoer. Relativt korte videobiter for de forskjellige delene. Da er tanken at dere i løpet av denne uka går gjennom og ser på de videoene, eventuelt leser notatene som står der. Det som da står her, det er... De vil komme som oppgaver i neste uke igjen. Her er uke to, og da er det introduksjon til Linux' kommandolinje. Så det er oppgaver for neste uke. Men så er det hele tiden ukens oppgaver, det er fokus i dag. Så det er ikke så veldig mye oppgaver i dag. Vi starter ganske rolig. Det er jo rett etter nyttår, så ja. Alle trenger litt tid på å komme i gang, det gjør jeg også. Så vi har en relativt forsiktig start, men som Ine sa, det er ganske omfattende kurs.", "source": "lecture"}
{"lecture_id": "os1del1", "chunk_id": "os1del1_0001", "start": 161.1, "end": 339.84, "token_count": 597, "text": "Så det er oppgaver for neste uke. Men så er det hele tiden ukens oppgaver, det er fokus i dag. Så det er ikke så veldig mye oppgaver i dag. Vi starter ganske rolig. Det er jo rett etter nyttår, så ja. Alle trenger litt tid på å komme i gang, det gjør jeg også. Så vi har en relativt forsiktig start, men som Ine sa, det er ganske omfattende kurs. Så det er veldig lurt å prøve å ligge litt tidlig an i løypa. Og jobb gjerne med oppgavene for neste uke allerede nå. Vi kan se veldig kort på planen. Den... Du ser det er noen obligatoriske oppgaver her. De består rett og slett av å legge sammen enkeltoppgaver fra de første ukene. Fra uke én, to, tre, fire typisk blir den første obligatoriske innleveringen. I dag er det bare tre oppgaver, men vi ser at alle er obligatoriske. Så det betyr at da skal dere, når dere skal levere obligg én, så skal dere levere en rapport hvor det er svart på alle de spørsmålene som er merket obligger. Og det jeg håper du oppnår på med det der, at ikke obliggene nødvendigvis blir en sånn stor skjau, men at dere ved å jobbe... Jevnt og trøtt. Så kan dere plukke ut her det som er obliger. Sånn som her er det neste uke. De første ni oppgavene kanskje er mer sånn øve og komme i gang. Og så kommer det noen obliger etter hvert nedover her. Så det er hovedsakelig strukturen på kurset. Vi møttes her hver tirsdag. Og da er det også fire timer mellom. Så det blir en veldig én intensiv dag, men dere må også regne med å jobbe mer med kurset, spesielt med det som ligger i Linux 1, 2, 3 osv. Hvor det står onsdag, men det betyr da kan dere se eller jobbe med det når som helst. Men det er viktig at dere begynner å jobbe med det denne uken, sånn at dere neste tirsdag er klare til å jobbe med det. Med disse oppgavene. Og det som også kan være veldig nyttig, er at dere da kan komme opp med spørsmål som dere lurer på", "source": "lecture"}
{"lecture_id": "os1del1", "chunk_id": "os1del1_0002", "start": 306.96, "end": 370.56, "token_count": 247, "text": "mer med kurset, spesielt med det som ligger i Linux 1, 2, 3 osv. Hvor det står onsdag, men det betyr da kan dere se eller jobbe med det når som helst. Men det er viktig at dere begynner å jobbe med det denne uken, sånn at dere neste tirsdag er klare til å jobbe med det. Med disse oppgavene. Og det som også kan være veldig nyttig, er at dere da kan komme opp med spørsmål som dere lurer på fra dette stoffet. Så kan vi også ta opp det på forelesningen sånn direkte. Jeg syns det fungerer veldig mye bedre hvis dere kommer med spørsmål. Og det er ofte ting som jeg ikke tenker på i det hele tatt, som dere brenner inn med. Så... Det er litt lavere terskel å spørre studenter og studenter. Så gjør gjerne det på laben, men enda bedre hvis dere spør nå når vi møtes.", "source": "lecture"}
