{"lecture_id": "os1del17", "chunk_id": "os1del17_0000", "start": 0.0, "end": 200.28, "token_count": 589, "text": "OK, da har vi ti minutter igjen, så skal vi ta en kort introduksjon til datamaskinarkitektur, som er det vi skal jobbe med de neste ukene. Da har vi så vidt sett litt på hva operativsystemer og prosesser osv. er. For å kunne forstå det helt i detalj, hvordan operativsystemet virker. så trenger man også å forstå hardware. Man må forstå hvordan CPU og ramme fungerer, for å forstå hvordan operativsystemkjernen styrer denne hardwaren. Og hardware, det bygger i bunn og grunn på digitalteknikk. Alt i en datamaskin er representert ved null og enere. Og det er ganske enkelt. Det er ingen spenning. Og en ener er f.eks. 5 volts spenning i forhold til jord. Med en gang man har nuller og enere, så kan man representere tall med nuller og enere, binære tall. F.eks. kan du sette 32-bit ved siden av hverandre med nuller og enere. Da får man et heltall, en integer, og da kan man representere tall opp til 32 andre. Eller omtrent 4 milliarder. I en datamaskin så er alt tall. Og utgangspunktet er da nuller og enere. Dette er typisk sånn som man har i en standard CPU. At du har null er representert med ingen spenning. Fem volt betyr da at her er det spenning, og det er da en ener. Man sier alltid at alle datamaskiner er drevet binært, og det er riktig. Men det er ikke opplagt at man skulle bruke det binære tallsystemet. Det var en del forskjell på å bruke desimale tall. Og det kunne man da oppnå ved å liksom si at null er null volt, én er én volt, to er to volt, tre er tre volt osv. Og så representere alt med desimale tall. Men det viser seg at det blir veldig komplisert i praksis å få til, sånn at... Etter hvert så har alle datamaskiner benyttet det binære tallsystemet, fordi det er veldig enkelt å skille mellom null og én. Men ut fra binære tall, så kan man representere alt. F.eks. er det lett å representere disse med alle tall, sånn som her. 0101 er fem. En ener pluss en firer, det blir en femmer.", "source": "lecture"}
{"lecture_id": "os1del17", "chunk_id": "os1del17_0001", "start": 164.28, "end": 331.88, "token_count": 596, "text": "tre er tre volt osv. Og så representere alt med desimale tall. Men det viser seg at det blir veldig komplisert i praksis å få til, sånn at... Etter hvert så har alle datamaskiner benyttet det binære tallsystemet, fordi det er veldig enkelt å skille mellom null og én. Men ut fra binære tall, så kan man representere alt. F.eks. er det lett å representere disse med alle tall, sånn som her. 0101 er fem. En ener pluss en firer, det blir en femmer. Og så kan man representere bokstaver. F.eks. bokstaven P er tallnummer... Da har du bokstaver. Så kan man representere piksler i grafikk, og fargen til piksler. Dermed har du alt som er en datamaskin, og alt kan da representeres ved nuller og enere. Datamaskinarkitektur går da ut på å manipulere på disse nuller og enerne, sånn at man får gjort nøyaktig det man ønsker å gjøre. Så alt er tall, og her ser vi da konkret hvordan et binært tall kan se ut. Og her ser vi sånne ledninger, og det er ikke tull, det er virkelig ledninger. Så kan du da måle... Du måler at det er spenningsforskjell i forhold til jord. Og da kan du... Hvis det er null her, så betyr det at det er faktisk en null. Og fem volt her, det betyr en ener. Og sånn får vi... Det er ener her. To en-toer. Ingen firere og en åtter. Og det blir til sammen tallet ti. Men for å lage en datamaskin, så trenger man ikke bare å representere tall. Man må kunne lagre f.eks. 32-bit. Men man må kunne utføre alle mulige logiske og matematiske operasjoner på samlinger av bit. Som f.eks. addere, subtrahere, multiplisere, dividere, sammenligne, skifte operasjoner og en rekke andre operasjoner. Men disse er faktisk de viktigste. De fleste programmer kan man utføre bare ved å ha disse få operasjonene. Og dette er da maskininstruksjoner som vi skal se på i stor detalj. Men det vi skal se på aller først, er hvordan kan man lage Det er en enkel operasjon. Hvordan kan man få til det?", "source": "lecture"}
{"lecture_id": "os1del17", "chunk_id": "os1del17_0002", "start": 289.2, "end": 480.48, "token_count": 599, "text": "Men man må kunne utføre alle mulige logiske og matematiske operasjoner på samlinger av bit. Som f.eks. addere, subtrahere, multiplisere, dividere, sammenligne, skifte operasjoner og en rekke andre operasjoner. Men disse er faktisk de viktigste. De fleste programmer kan man utføre bare ved å ha disse få operasjonene. Og dette er da maskininstruksjoner som vi skal se på i stor detalj. Men det vi skal se på aller først, er hvordan kan man lage Det er en enkel operasjon. Hvordan kan man få til det? Hvordan kan man få til å lage logiske operasjoner rent fysisk? Jo, det kan gjøres med logiske kretser. Først skal man bygge de logiske kretsene sånn teoretisk. Tenke seg hvordan bør dette se ut. Og etterpå så kan man da bygge de logiske kretsene fysiske som integrerte kretser. Noen fysiske integrerte kretser. Logiske kretser. Det er kretser som da utfører binær logikk eller binær algebra. Og alle binære operasjoner kan utføres med såkalte and or not-operasjoner. Så da kan man... Alt man ønsker å få til, kan man få til ved disse operasjonene. Da gjør man ganske enkelt sånn at man bygger disse tre logiske operatorene i hardware. Og dermed så kan man få til hva man vil av både addisjon og divisjon og... Alle operasjoner er mulige å få til hvis man setter sammen de riktige logiske operasjonene and or not. På en helt spesiell måte. Man må finne ut nøyaktig hvordan man skal sette det sammen. Disse operasjonene kalles porter. Før vi går og ser på hvordan portene opererer, hva som er logikken i det, så må vi se litt på den fysiske utførelsen av de. I de aller første datamaskinene brukte man... Radiorør som man brukte for å implementere And or not-porter. Men de radiorørene har en fysisk størrelse som er... De er store. Så dermed... Det som i dag er bitte små datamaskiner, fylte da opp store saler. Det trengte enormt mye plass. Men... det var en god start. Det var en veldig stor oppdagelse i forrige århundre, kvantemekanikken.", "source": "lecture"}
{"lecture_id": "os1del17", "chunk_id": "os1del17_0003", "start": 433.96, "end": 611.44, "token_count": 580, "text": "så må vi se litt på den fysiske utførelsen av de. I de aller første datamaskinene brukte man... Radiorør som man brukte for å implementere And or not-porter. Men de radiorørene har en fysisk størrelse som er... De er store. Så dermed... Det som i dag er bitte små datamaskiner, fylte da opp store saler. Det trengte enormt mye plass. Men... det var en god start. Det var en veldig stor oppdagelse i forrige århundre, kvantemekanikken. Nemlig hvordan verden virker helt nede på mikronivå, på atomnivå. Og denne teknologien gjorde det mulig å lage transistoren, som var helt grunnleggende for datamaskinen. Det som var fantastisk med transistoren, var at man kunne lage and or not. Som var ekstremt små. Sånn at man kan få i dag mange milliarder av dem på en kvadratcentimeter. Det er hele grunnlaget for datamaskinen. Og de er så små at ledningene er sånn type ned på fem nanometer i bredde. Og et hårstrå er 100 000 nanometer. Du kan tenke deg hvor ekstremt små de er. Og det man da bruker disse transitionordene til, det er å lage en liten logisk port, sånn som dette her. Dette er AND-porten. Og den fungerer sånn at du har input A, B, nuller og enere. Så her kommer A inn som en... La oss si det kommer en null inn her, og B er en null. Og da kommer A, prikk B. Eller A og B, som dere som har diskré matematikk, som kanskje er vant til å le. Men hvis det kommer to nuller inn, så kommer det en null ut. Og tilsvarende, hvis det kommer null og én eller én og null inn, så kommer det også null ut. Og det er bare i tilfelle én-én kommer inn, så kommer det en ener ut. Og dette er da én byggescene, én port. Det tar veldig kjapt. De andre er år, som har en litt annen virkemåte. Og not, som er rett og slett sånn at hvis det kommer en null inn, så kommer en ener ut. Hvis det kommer en ener inn, så kommer en null ut.", "source": "lecture"}
{"lecture_id": "os1del17", "chunk_id": "os1del17_0004", "start": 580.74, "end": 726.08, "token_count": 503, "text": "så kommer det også null ut. Og det er bare i tilfelle én-én kommer inn, så kommer det en ener ut. Og dette er da én byggescene, én port. Det tar veldig kjapt. De andre er år, som har en litt annen virkemåte. Og not, som er rett og slett sånn at hvis det kommer en null inn, så kommer en ener ut. Hvis det kommer en ener inn, så kommer en null ut. Her snakker vi om spenninger. Hvis du kobler på en spenning null her, så vil det komme en spenning én ut i den andre enden. Det som er helt fantastisk, er at bare ved hjelp av de tre portene, så kan man lage en vilkårlig. Å få til alle mulige logiske kretser, sånn som dette her er eksempel på. Her setter vi sammen en and og en overport, og så får vi ut et resultat. Det vi skal se på i neste uke, er hvordan man generelt kan lage en stor, kompleks sak av sånne and og overporter. Og så kan man f.eks. få til det At man starter med to binære tall, kanskje 32-bits binære tall til og med. Og så setter man sammen en masse and-of-ar-porter på en sånn måte at i andre enden så kommer det som kommer ut da, er summen av de to tallene. Og det er veldig langt fra opplagt hvordan man kan sette sammen de. Men ved hjelp av binærlogikk så kan man få til... Og sette sammen en smørja masse and or not-porter på en sånn måte at hvis man sender to binære tall inn i denne svære boksen med and or not-porter, så kommer det alltid ut summen i den andre enden. Og sånn er generelt en datamaskin bygget opp. Og vi skal faktisk i ganske stor detalj bygge opp en virtuell sånn maskin. Som den skal teste ut. Og så skal vi kjøre programmer på den maskinen. For å se helt nøyaktig hvordan den sitter ut.", "source": "lecture"}
