{"lecture_id": "os1del6", "chunk_id": "os1del6_0000", "start": 0.0, "end": 186.9, "token_count": 595, "text": "Jeg har pratet lenge, har ikke presentert meg ennå. Dere ser kanskje navnet mitt også, men jeg heter Hårek Haugerud. Jeg pleide å sitte i P35, men nå har jeg flyttet opp til AI-laben, siden jeg jobber en del med de som jobber der. Så jeg sitter fysisk i P52. Det vil si, så langt har jeg hjemmekontor, men når jeg... Jeg kommer tilbake til campus og CT i P52. Det jeg kanskje ikke har gjort så klart hittil, er at kurset består av to uavhengige deler. Den ene er operativsystemer, OS. Og denne delen er mer teoretisk om hvordan et operativsystem er bygd opp. og kjente operativsystemer er bygd opp. Og hvordan alt dette her henger sammen helt fra grunnen. Og vi bruker en god del tid på også å se på hardware, datamaskinarkitektur. For målet er at dere, etter å ha tatt kurset, skal på en måte vite alt som skjer i en datamaskin. Helt nede fra 0 volt, 5 volt, spenninger... Bitte små, de aller minste delene i datamaskinen. Helt opp til operativsystemet og dokker og virtuelle maskiner og alt som skjer på toppen. Så tradisjonelt så er operativsystemet veldig spesifikt om schedulere og minnebruk og CPU-er og hvordan alt dette styres. Det jeg har prøvd å legge inn... Etter hvert er det også å ta med hva som skjer på litt høyere nivå. Spesielt det som vi har gjort med de siste årene, er å se på dokker. Altså se på konteinere, og bruke og kjøre og lage konteinere. Og også har vi sett på virtuelle maskiner. Sånn at dere... Når dere går ut i arbeidslivet og begynner å bruke dette her, Så vet dere hva en container er, og dere vet hva operatørsystemet er, og hvordan ting henger sammen. Så dette er en slags sånn... For å si det veldig fint, en dannelsesreise innen data. Dere skal kjenne til hvordan alt henger sammen. Og det er ikke nødvendigvis noe som dere får veldig nytt for akkurat der og da. Men jeg håper dere skal sitte med en dypere og grundigere forståelse", "source": "lecture"}
{"lecture_id": "os1del6", "chunk_id": "os1del6_0001", "start": 142.96, "end": 327.28, "token_count": 583, "text": "Sånn at dere... Når dere går ut i arbeidslivet og begynner å bruke dette her, Så vet dere hva en container er, og dere vet hva operatørsystemet er, og hvordan ting henger sammen. Så dette er en slags sånn... For å si det veldig fint, en dannelsesreise innen data. Dere skal kjenne til hvordan alt henger sammen. Og det er ikke nødvendigvis noe som dere får veldig nytt for akkurat der og da. Men jeg håper dere skal sitte med en dypere og grundigere forståelse av hvordan alt henger sammen. Sånn at når dere møter på et problem som ikke jeg vet om, og som ikke dere vet om eksisterer engang, som kanskje kommer i fremtiden, så har dere en dypere forståelse. Og da er det alltid lettere å takle problemer og forstå hva som skjer der oppe. Men sånn i praksis, hvis du er utvikler og jobber som konsulent, så tenker du ikke hele tiden på hva som skjer i operativsystemet. Men noen ganger så blir det plutselig viktig å vite hva som foregår. Så det er den første delen, den mer teoretiske delen. Den andre delen er mer praktisk bruk av operativsystem. Det vi først og fremst jobber med, er kommandolinje. Spesielt Linux-kommandolinje. Men vi kommer også til å drive noe med vindus og PowerShell. Og skrive PowerShell-skript. I Linux-delen kommer vi til å skrive såkalte Bæsj-skript. Linux-kommandolinjeskript, som egentlig består av bare å sette sammen kommandoer til et systematisk... Dette blir små systemskritt som brukes til å styre operativstemme og til å snakke med operativstemme. Jeg nevner også dokker her. Vi kommer til å holde på noen uker med dokker. Det som er nytt av året, er at... Jo, tidligere så har alle... Dere har blitt delt inn i grupper, og da har hver studentgruppe en virtuell maskin. VM som dere logger inn på. Nytt av året er at serverne har blitt så gamle og dårlige som kjørte disse, så de har begynt å bryte sammen. Derfor har vi lagd et nytt system. Og i år så ser dette ut på samme måte,", "source": "lecture"}
{"lecture_id": "os1del6", "chunk_id": "os1del6_0002", "start": 283.92, "end": 363.0, "token_count": 241, "text": "Jeg nevner også dokker her. Vi kommer til å holde på noen uker med dokker. Det som er nytt av året, er at... Jo, tidligere så har alle... Dere har blitt delt inn i grupper, og da har hver studentgruppe en virtuell maskin. VM som dere logger inn på. Nytt av året er at serverne har blitt så gamle og dårlige som kjørte disse, så de har begynt å bryte sammen. Derfor har vi lagd et nytt system. Og i år så ser dette ut på samme måte, Som ved litt ekstra detaljer ser ut som selvstendige virtuelle maskiner. Så dere får da tilgang til en sånn dockingcontainer som har en offentlig IP. Og som dere kan installere og kjøre f.eks. webservere på osv. Og som dere kan bruke og teste og eksperimentere med sånn som dere vil. Så dokker kommer vi til å bruke og jobbe en god del med. I den praktiske del.", "source": "lecture"}
