{"lecture_id": "os1del13", "chunk_id": "os1del13_0000", "start": 0.0, "end": 202.74, "token_count": 594, "text": "Det vi avslutter med, var å vise at operativsystemet forenkler. Hardware er fryktelig komplekst. Så én viktig hovedoppgave for systemet, er å forenkle grensesnittet fra brukerprogrammer mot Hardware. Men det er en annen oppgave også som er veldig viktig, og det er å... Mellom de forskjellige programmene og mellom de forskjellige brukerne. Det er en annen viktig hovedside. Her er et forsøk på en OUS-definisjon. Det er at et operativsystem er programvarer hvis hensikt er to ting. A. Gi applikasjonsprogrammer og brukere enhetlige, enklere og mer abstrakt adgang til maskinens ressurser. Så det er det vi så på med forrige med beautiful and ugly interface. De som skriver et applikasjonsprogram, skal ikke behøve å ta hensyn til detaljene ned i Hardware. Det fikser operativ systemet. Så det er én viktig del. Men så er det altså del B. Administrer ressurser, slik at prosesser og brukere ikke ødelegger for hverandre. Hvis en prosess gjør en eller annen jobb og får noe inn i minnet som den skal ta vare på og bruke senere, kan ikke en annen prosess komme inn og skrive over eller ødelegge noe av det den har. Den andre brukeren bruker. En prosess tar over all CPU på maskinen. Det vil også gå dårlig hvis ikke operativstemmen sørger for å fordele CPU-tip. Eller som det står i eksemplene her, et filsystem. Som brukes til å gi alle brukere og prosesser atskilt adgang til å lagre på disken. Da må opplagt ikke de kunne overskrive for hverandre. Prinsippskisse av Linux. Tidligere hadde vi et enkelt grensesnitt, og vi hadde operativsystemkjerne og hardware. Men dette er på en måte en litt mer detaljert skisse, med Linux som eksempel. Skal si at det er litt forskjellig fra Windows. I begge tilfeller har vi en operativsystemkjerne. Og det er... Når jeg sier OS, så tenker jeg ofte på OS-kjernen. Men det er ikke noen sånn helt klare definisjoner der. Hva som hører til OS-kjernen, og hva som ikke hører til OS-kjernen.", "source": "lecture"}
{"lecture_id": "os1del13", "chunk_id": "os1del13_0001", "start": 166.32, "end": 349.9, "token_count": 589, "text": "Men dette er på en måte en litt mer detaljert skisse, med Linux som eksempel. Skal si at det er litt forskjellig fra Windows. I begge tilfeller har vi en operativsystemkjerne. Og det er... Når jeg sier OS, så tenker jeg ofte på OS-kjernen. Men det er ikke noen sånn helt klare definisjoner der. Hva som hører til OS-kjernen, og hva som ikke hører til OS-kjernen. Grovt sett så kan vi si at operativsystemkjernen er den som kjører i corner mode. Men så kan den ha systembiblioteker og systemprogrammer som kjører på toppen. Og det er det vi ser litt her. Hvis vi starter nederst, ser vi at vi har hardware her nede. AMD X86 osv. Hardware kan være veldig forskjellig, men operativsystemkjernen styrer denne hardwaren. Men så ser vi... Her har vi et systemkaldt grensesnitt. Dette er virkelig da et API... Application Programming Interface. Dere er kanskje kjent med API-er fra forskjellige softwareløsninger. Men det er typisk at du inn mot en klasse eller en softwarepakke, så har du et gitt antall kall som du kan gjøre. Et helt klart definert grensesnitt. Og nøyaktig det samme er det når det gjelder operativstyrer. Da har man et systemkall-grensesnitt. Så det er bare et begrenset antall systemkall som vanlige programmer kan gjøre for å snakke med operativsystemkjernen. Basert på de systemkallene, og eksempel open-close, dette er om filer, eller ri, det er et annet systemkall, da kan en applikasjon her oppe be systemet om at det leser. Da vil ikke applikasjonen her oppe styre disken direkte. Den kan bare gjøre systemkall til operativstemkjernen. Dette er helt essensielt når det gjelder operativstemmer. At vi har dette grensesnittet. Men så ser vi også at vi har sånne... Her er et bibliotek, et systembibliotek. Det kan være math.ho. Det kan være en funksjon. En nettverksoppkobling fra denne applikasjonen til en annen et annet sted. Det er typisk systembiblioteker. I noen tilfeller kan man si at det er en del av operativsystemet,", "source": "lecture"}
{"lecture_id": "os1del13", "chunk_id": "os1del13_0002", "start": 311.52, "end": 504.8, "token_count": 599, "text": "Dette er helt essensielt når det gjelder operativstemmer. At vi har dette grensesnittet. Men så ser vi også at vi har sånne... Her er et bibliotek, et systembibliotek. Det kan være math.ho. Det kan være en funksjon. En nettverksoppkobling fra denne applikasjonen til en annen et annet sted. Det er typisk systembiblioteker. I noen tilfeller kan man si at det er en del av operativsystemet, men det er ikke en del av operativsystemkjernen. Forskjellen er hvis det er et systembibliotek. Hvis det snakker gjennom systemkall til Da er det ikke en del av kjernen. Da er det mer en system, software, som sitter på toppen. Men som mange vil betrakte som en del av operativsystemet. Det er derfor det står... Det er en 19 stiplet linje her. Her står det GNU slash Linux. Og GNU... Det er en liten stiplet linje her. Jeg ser... jeg ser... har ikke skrevet hva Gnu er, men Gnu, det er en sånn rekkurs i forkortelse. Gnus, not Unix. Vanligvis når man opptaler Linux, så sier man bare Linux. Men det egentlig riktige navnet for Linux er GnuLinux. Gnu, det er resten av systemet. Linux er egentlig bare Linux-kjernen. Men hvis du skal styre en maskin, eller ikke minst styre applikasjoner, så trenger du mer enn akkurat kjernen. Så Gnu er alle disse verktøyene sånn som det står her. Compulator f.eks., GCC, som er det aller viktigste. Alle disse verktøyene er da bygd opp på toppen av Linux. Og når du i dagligtallet snakker om et operativsystem, så tenker man ofte på at så tar man også med den biten. Hvis du f.eks. snakker om et vindusoperativsystem, så har du absolutt også med alle disse verktøyene. Også vindusgrensesnittet. Og der er det en stor forskjell. I vindus så er det Gui. Vindusgrensesnittet, grafiske brukerinterface, det er en del av vinduskjernen. Mens vi ser her på Linux, så er all grafikk... Det er brukerprogramvare som sitter på toppen av operativstømkjernen og bare snakker med kjernen gjennom grensesnitt.", "source": "lecture"}
{"lecture_id": "os1del13", "chunk_id": "os1del13_0003", "start": 462.68, "end": 561.62, "token_count": 324, "text": "så har du absolutt også med alle disse verktøyene. Også vindusgrensesnittet. Og der er det en stor forskjell. I vindus så er det Gui. Vindusgrensesnittet, grafiske brukerinterface, det er en del av vinduskjernen. Mens vi ser her på Linux, så er all grafikk... Det er brukerprogramvare som sitter på toppen av operativstømkjernen og bare snakker med kjernen gjennom grensesnitt. Vi kommer tilbake til disse tingene, men dette er... Én vesentlig forskjell på Windows og Linux. Men hovedideen som dere må huske å sitte tilbake igjen med i dag, det er operativsystemet kjernen. Det er det helt essensielle av operativsystemet. Det kjører i curl-mode. Det har lov til å gjøre absolutt alt av endringer. Da kan det også gjøre feil og ødelegge systemet, få det til å gå ned osv. Mens resten av operativsystemet, det snakker med kjernen gjennom et API. Gjennom systemkall. Og da er det opplagt mye sikrere. Det er ikke så lett for en applikasjon her oppe da å få hele systemet til å gå ned. Det får rett og slett ikke lov til å gjøre alt det vil.", "source": "lecture"}
