{"lecture_id": "os1del12", "chunk_id": "os1del12_0000", "start": 0.0, "end": 179.02, "token_count": 591, "text": "Dette er to viktige modig som vi kommer til å snakke mye om etter hvert. Her ser vi jeg prøver å gå litt dypere inn på hvor operativsystemet sitter. Da ser vi fortsatt så har vi hardware her nede. Men oppå der så sitter det masse software. Og på toppen så sitter det applikasjoner. Webrosere osv. Men så ser vi... Her på venstre side så ser vi user mode. Og dette er da programvare som kjører i såkalt user mode. Og det som er spesielt med user mode, er at da er det ikke... Da har man ikke alle rettigheter. Det er f.eks. ikke lov til å aksessere alle deler av ram eller internminne. Og det er ikke alle instruksjoner som kan utføres. Instruksjon som ikke kan utføres i usemode, det er holdt... Eller altså å be datamaskinen, hardware her, om å stoppe totalt. Og det ville vært kjedelig, for da kunne den som skrev en webbrovelse, liksom bare velge... Hvis brukeren lastet en spesiell side, så kunne en skru av datamaskinen. Så usemode er en... Ganske sterkt begrenset modus hvor programmene ikke har lov til å gjøre alle instruksjoner som Hardware kan utføre. Derimot, i cornerl mode... Der er alle instruksjoner mulig. Man kan aksessere alle deler av Hardware. Og operativsystemet må da naturlig nok kjøre i corner mode, for det må kunne... Akseptere alle deler av hardware. Må kunne gjøre absolutt alle operasjoner. Så dette kommer vi masse tilbake til, denne inndelingen. Det var én del, altså det å styre hardware. Men vi kan også si en annen viktig del som OS da gjør, er å forenkle. Og vi ser applikasjonsprogrammene her på toppen. De har et vakkert brukergrensenett mot operativsystemet. Alt er pent og enkelt. De har enkle operasjoner, read disk f.eks. Så leser de en fil fra disk. Applikasjonsprogrammene ber operativsystemet lese en fil fra disk. Og da sørger operativsystemet for å snakke med hardware. Og her er en skikkelig ugly interface. Dette er veldig grisete saker.", "source": "lecture"}
{"lecture_id": "os1del12", "chunk_id": "os1del12_0001", "start": 144.02, "end": 194.88, "token_count": 190, "text": "Og vi ser applikasjonsprogrammene her på toppen. De har et vakkert brukergrensenett mot operativsystemet. Alt er pent og enkelt. De har enkle operasjoner, read disk f.eks. Så leser de en fil fra disk. Applikasjonsprogrammene ber operativsystemet lese en fil fra disk. Og da sørger operativsystemet for å snakke med hardware. Og her er en skikkelig ugly interface. Dette er veldig grisete saker. Når du skal snakke med hardware. Og ikke minst finnes det en masse forskjellige harddisker. Sånn at når du snakker med hardware, så er det en masse grums. Og alt dette grumset, det må operativstemme.", "source": "lecture"}
