{"lecture_id": "os1del15", "chunk_id": "os1del15_0000", "start": 0.0, "end": 267.98, "token_count": 584, "text": "Her ser vi, forhåpentligvis ser dere også dette her, program eller kode. Hvis jeg sier at... Jo, vi har sagt at en prosess er et program som kjører. Men hva med... Hva om programmet eller koden som vi kjører, er DNA? Altså... Hva er da prosessen? Jeg ser Marius har et spørsmål, jeg kan ta det etterpå. Vanlige programmer som kjører. Det er koden. Og så har vi da prosesser som kjører på en datamaskin. Men hva kan da en prosess være hvis det er DNA som er koden? Ja, forslag... Enzymer, proteiner... Ja, det er godt forslag. Det er helt perfekt, men det tenker jeg kanskje er litt... Det blir jo ikke på en måte hardware. Det som er problemet med DNA, er at den både er hardware og prosessen i seg selv. Fordi du på en måte... DNA er kode som bestemmer hvordan alt blir. Menneske... ja. Det kom masse forslag her. Veldig bra. Alt som er programmert i DNA. Ja, jo, men det er med programmet. Og menneske, da tenker jeg mer at det kanskje er litt mer sånn hardware. Blod som pumpes rundt i kroppen. Ja, absolutt. Nervesignaler. Bevisstheten. Ja, det begynner å nærme dere. Men det er noe helt spesifikt som jeg er ute etter. Vi har jo sånn som hardware, da. Lurer på hva det er også. Og da tror jeg kanskje jeg kan være med på mennesker. Sjel og ånd. Men hvis jeg prøver å stille spørsmålet på en litt annen måte, da... Hvordan... Hvis du ser på deg selv... Eller se på meg, da. Jeg har et DNA. Og det er jo egentlig bare en kjempelang streng med kode. Så... Den prosessen at mitt DNA kjører, at det i det hele tatt, det DNA-et kjøres, hva kan det kalles? Eller for din del, at ditt DNA kjøres. Det var masse forslag her. Noen som har flere ideer? Hvordan er det relatert til deg? Ja, gener - igjen gener. Det er selve DNA. Så... Hjerte, ja, da er du inne på noe. For det er liksom det at... at det utføres. Men hva er selve prosessen?", "source": "lecture"}
{"lecture_id": "os1del15", "chunk_id": "os1del15_0001", "start": 200.68, "end": 471.96, "token_count": 590, "text": "Og det er jo egentlig bare en kjempelang streng med kode. Så... Den prosessen at mitt DNA kjører, at det i det hele tatt, det DNA-et kjøres, hva kan det kalles? Eller for din del, at ditt DNA kjøres. Det var masse forslag her. Noen som har flere ideer? Hvordan er det relatert til deg? Ja, gener - igjen gener. Det er selve DNA. Så... Hjerte, ja, da er du inne på noe. For det er liksom det at... at det utføres. Men hva er selve prosessen? At man lever, ja. Veldig bra. Mohammed kom med at man lever. Det jeg vil si, er at selve prosessen for DNA-et er livet. Altså det som et menneske... Helt fra man blir født til man dør. Og akkurat sånn er det med prosesser også. Man har jo sånn som kill eller kontroll C. Det vil jo være drap. Eller død, ikke sant. Jeg ser i chatten her om dette er fag i filosofi. Ja, absolutt! Det er veldig viktig å liksom... Prosesser skal vi snakke om hele tiden. Og det er veldig viktig at dette er mye mer enn bare et program som kjører. Og det er tanken med denne analogien, at hver gang dere hører ordet prosess, så skal dere da ikke bare tenke på det programmet som kjører, men dere skal tenke på at dette er hele livet for akkurat den koden som kjører. Hva kan hardware være, da? Der igjen blir det litt vanskelig... Organer, det var bra, var den som foreslo. Men jeg tenker at hardware også er sånn noe mer enn bare mennesket selv, ikke sant? For det kan jo ha sånn som hus, mat... Bygninger osv. Fordi at DNA på en måte opererer... DNA opererer over hele verden. Så... Kontroll C er close... Det er jo copy-og-do-s. Det er faktisk sant. Men hvis du kjører en Linux-prosess og du skal stoppe den, så hvis du tasser kontroll C, så blir den drept. Ja, så kill-kontroll C er drap, men vi har et par andre viktige ting her. Hva med... Eller for å sette det motsatt... Hva kan man si at staten eller lovverket... Lovverket... Hva er det i denne analogen? Analogien?", "source": "lecture"}
{"lecture_id": "os1del15", "chunk_id": "os1del15_0002", "start": 409.42, "end": 640.44, "token_count": 598, "text": "DNA opererer over hele verden. Så... Kontroll C er close... Det er jo copy-og-do-s. Det er faktisk sant. Men hvis du kjører en Linux-prosess og du skal stoppe den, så hvis du tasser kontroll C, så blir den drept. Ja, så kill-kontroll C er drap, men vi har et par andre viktige ting her. Hva med... Eller for å sette det motsatt... Hva kan man si at staten eller lovverket... Lovverket... Hva er det i denne analogen? Analogien? Andreas, supert. OS, operativsystemet, det er liksom staten eller lovverket, som da sørger for at prosesser ikke ødelegger for hverandre. For da er det sånn at hvis en av dere går inn i nabohybelen til en annen student, så kan ikke vi bare gå inn der og ta hva som helst. Og akkurat det er det operativsystemet sørger for. Det sørger for at de prosessene som kjører her på jorda, ikke er på jorda, operativsystemet sørger for at prosessene i en datamaskin ikke ødelegger for hverandre. De kontrollerer at de deler på godene sånn som det skal. Det samme kan man da si om operativsystemet. Det er en slags sånn overordnet sjef. Politi kunne også... Kanskje vært. Som overholder lovverket. Kan ta med det òg. Politi. Som passer av prosessene, ikke ødelegger for andre. Så kan man også spørre seg om hva med Rut eller administrator? Hvem er dette i den analogien? Brian kommer en gang til med... veldig bra. Sjelden noen sier det så fort. Men det er Gud. Administrator har all makt. Og det er en del regjering i Kongen, ja. Det er også litt det samme. Men Gud er kanskje enda bedre. Dere har sikkert opplevd en del Ruth. Men i denne analogien så er det det. For de er også en prosess. Det blir en litt omfattende diskusjon når vi skal diskutere om Gud også har DNA osv. Men det er en prosess som styrer de andre prosessene. En Gud kan jo da bare si OK, denne prosessen her gjør så mye galt, så den bare stopper vi. Så Rutel Administrator er på en måte en sånn... Er allmektig på toppen og styrer alle prosessene.", "source": "lecture"}
{"lecture_id": "os1del15", "chunk_id": "os1del15_0003", "start": 600.0, "end": 827.72, "token_count": 596, "text": "Men i denne analogien så er det det. For de er også en prosess. Det blir en litt omfattende diskusjon når vi skal diskutere om Gud også har DNA osv. Men det er en prosess som styrer de andre prosessene. En Gud kan jo da bare si OK, denne prosessen her gjør så mye galt, så den bare stopper vi. Så Rutel Administrator er på en måte en sånn... Er allmektig på toppen og styrer alle prosessene. OK. Jeg vet ikke om denne analogien er helt perfekt. Men det som er viktig med den, er at fra nå av, når dere tenker på en prosess, så må dere ta med alle de bitene som... Denne analogien... Viser at en prosess omfatter, da. For eksempel så skal vi senere se på hva som... At vi kan... Eller at operativsystemet... For å dele på godene, så driver operativsystemet hele tiden og stopper prosesser. Og hvis du stopper en prosess, så er det... Det er på en måte et drap, men det er mer sånn at du setter hele prosessen på hvile. Da må du også ta vare på alt det den prosessen hadde. Alle oppkoblinger, alt som ligger i registeret, internminnet. Alt det må lagres og på en måte fryses. Og det er mer sånn som... Dere har sikkert sett science fiction-filmer Og så tines opp 100 år senere. Og det er akkurat det operativsystemet gjør hele tiden. Her er det snakk om et hundredels sekund. Det fryses ned en prosess i et hundredels sekund. Men da må alt om prosessen også lagres, nøyaktig som når man skal vekke opp et menneske. Naturlover går under Ruteadministrator. Jo, du kan nok si det. Men kanskje... Men det er som sagt... Det er ikke alt som klaffer 100 % med denne analogien. Men det som er viktig, er at dere har med det som... Odeta oppsummerer veldig fint at prosessen er livsløpet av programmet. Og absolutt, det er det. For hvis du har et program, så har du en eller annen funksjon som du skal gjøre. som skal regne ut en sum fra 1 til 100. Da er hele livsløpet til programmet at det starter, og så kjører det nøyaktig sånn som DNA-et tilsier. Nemlig at det skal legge sammen alle disse tallene.", "source": "lecture"}
{"lecture_id": "os1del15", "chunk_id": "os1del15_0004", "start": 787.52, "end": 917.0, "token_count": 366, "text": "Men det som er viktig, er at dere har med det som... Odeta oppsummerer veldig fint at prosessen er livsløpet av programmet. Og absolutt, det er det. For hvis du har et program, så har du en eller annen funksjon som du skal gjøre. som skal regne ut en sum fra 1 til 100. Da er hele livsløpet til programmet at det starter, og så kjører det nøyaktig sånn som DNA-et tilsier. Nemlig at det skal legge sammen alle disse tallene. Det bruker da hardware. Det bruker da alle ressursene. Og så gjennom livsløpet til prosessen så utføres nøyaktig det det skal, som beskrevet. I DNA-et, eller i koden. Så kommer det fram til et resultat, og så gir det videre til noen andre. Så absolutt. Prosessen er hele livsløpet til et program. Men hva med CPU? Spør Floyd her. Jo, det blir mer sånn. CPU er da en del av hardwareet som mennesket lever på. Men i denne analogien er det kanskje litt mer sånn at hjernen er CPU-en. Altså at du... Det blir litt komplisert, for DNA er også oppskriften på hjernen. Men så vil jeg kanskje si mer at CPU er... At hjernen er CPU. Vi kan ta med det også. Men... ja. Nå begynner analogien å bli litt vanskelig. Så den er ikke perfekt, men prøv å huske å ta med dette her videre.", "source": "lecture"}
