{"lecture_id": "os1del16", "chunk_id": "os1del16_0000", "start": 0.0, "end": 183.48, "token_count": 585, "text": "Ja. Her ser vi utskrift fra topp i Linux. Og det viser da alle de prosessene som står her og kjører. Og hvor lenge de har levd. Eller det vil si da hvor lenge de har kjørt. Mye tid de har brukt, mye CPU de bruker osv. Og det ser veldig likt ut på Windows. Akkurat det samme med ID-er osv. Så dette er sånt som vi skal se på. Vi skal se på disse utskriftene senere i detalj, og hva alt betyr. Et annet prinsipp som er veldig viktig når det gjelder operativsystemer, det er abstraksjon og hierarkier. Det er nemlig det at man har bokser på høynivå, der har man oversikten. Dette kan være hele operativsystemet, kanskje. Og så tar man ut en del av operativsystemet som kanskje har med Hvordan fordeles CPU-tid? Og så går man enda lenger ned og ser på detaljene inni her. Dette er ekstremt viktig. Det vet dere fra f.eks. objektorientert programmering. At man lager moduler som gjør akkurat det man skal. Og så bygger man opp hierarkier av denne type systemer. Ikke mens hardware, som vi skal begynne å se på nå, så er det... Så er det veldig bygd opp av denne type abstraksjoner. Om man sier OK, dette er en liten boks som gjør sånn og sånn, så bygger vi et stort hele av masse små bokser. Et Linux-eksempel på hierarki, det er hvis man gjør en kommando sånn som dette... Cat, it's message of today. Det er en kommando som bare skriver ut litt tekst som ligger i den filen. For å få til det, så gjøres det en rekke systemcall. Dette er systemcall som er API til Linux-kjernen. F.eks. gjør man open, read, close og en mengde andre systemcall. Med kommandoen strace. Hvis man utfører den, så får man se alle... Her er det listet opp. Kjør en kommando, uname, break, access, open, old, close osv. Les filen. Det er en rekke systemcall som under huden på den ene kommandoen. Så ligger det en rekke systemcall. Alle applikasjonsprogrammer gjør.", "source": "lecture"}
{"lecture_id": "os1del16", "chunk_id": "os1del16_0001", "start": 127.96, "end": 190.28, "token_count": 159, "text": "Dette er systemcall som er API til Linux-kjernen. F.eks. gjør man open, read, close og en mengde andre systemcall. Med kommandoen strace. Hvis man utfører den, så får man se alle... Her er det listet opp. Kjør en kommando, uname, break, access, open, old, close osv. Les filen. Det er en rekke systemcall som under huden på den ene kommandoen. Så ligger det en rekke systemcall. Alle applikasjonsprogrammer gjør. De snakker med operativsystemet gjennom den typen systemkall når de skal gjøre noe spesifikt med Hardware.", "source": "lecture"}
