{"lecture_id": "os2", "chunk_id": "os2_0000", "start": 0.0, "end": 198.32, "token_count": 596, "text": "Der ser det ut som recordingen starter hos meg, i hvert fall. Ja, da skal vi starte med... Jeg tenkte vi kunne bare starte med å si litt om opplegget, så nå deler jeg kurstiden med dere. Sånn. Og da ser vi... Vi er nå i uke to, tirsdag 12. Og det vi skal snakke om i dag, er transistorer, porter og en krets om aldere tall. Så når du ser her hvor det står F, så er det forelesninger, sånn som nå, live. Mens for det andre temaet denne uken... Hver uke er det første temaet generelt om operativstemmer. Og det andre... Som er mer hands on, praktisk. Mye i starten er Linux og Linux-kommandoer. Her står den D for digital. Så her er det du kan kalle det digitale forelesninger som er spilt inn på forhånd. Da er tanken sånn at den digitale forelesningen fra forrige uke, som jeg la ut stort sett på onsdag, onsdag ettermiddag kanskje... Derfra er det oppgaver om denne uken. Jeg har også lagt ut oppgaver til uke tre. De som ligger litt foran, kan se på det nye temaet fra onsdag 13.11, med Linux filsystemer osv., og gjøre oppgaver fra uke tre. Da kommer jeg til å legge ut noen tilsvarende opptak hvor jeg diskuterer slider og stoff. Ja, i løpet av denne halvdagen. Du kan bare se kjapt hvordan det ser ut. Hvis man går inn på de de-forelesningene, så er det notater der. Litt mer utfyllende enn slides. Og så har jeg da lagd noen små demoer f.eks. av hvordan man flytter seg. Da ble det to stykker av meg på en gang. Men sånn er tanken at dere skal kunne gå inn og se på det dere ønsker. Det som er fint med at dere har alt direkte, alt, er jo det kan bli mye frihetsgrader. Men da har dere iallfall mulighet til å jobbe litt sånn som dere selv syns er best. Eller så kan dere begynne å jobbe med oppgavene. Og hvis alt går greit, så går det greit. Spesielt i den praktiske delen er det snakk om å få det inn i fingrene og øve på det og få det til. Det er ikke sånn at du må se alle videoene for å få det til.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0001", "start": 166.28, "end": 369.14, "token_count": 595, "text": "Det som er fint med at dere har alt direkte, alt, er jo det kan bli mye frihetsgrader. Men da har dere iallfall mulighet til å jobbe litt sånn som dere selv syns er best. Eller så kan dere begynne å jobbe med oppgavene. Og hvis alt går greit, så går det greit. Spesielt i den praktiske delen er det snakk om å få det inn i fingrene og øve på det og få det til. Det er ikke sånn at du må se alle videoene for å få det til. Men en måte å jobbe på kan være å prøve å jobbe med oppgavene. Hvis dere står fast, så kan dere gå inn og se en video eller lese en slide og lese dere opp på akkurat det. Så vil dere også se... jo, på denne, nei, litt frem og tilbake her... På den digitale forlesningen så ser vi også at jeg har den siste demoen her, er litt om oppgavene til denne uken, altså i uke to. Da kan det være lurt å prøve på oppgaven først, hvis dere står fast og ikke skjønner helt hva jeg mener. Så kan dere prøve å gå inn der og se på en mer detaljert forklaring. Ja, det er én kommentar om at det er gode videoer, og det er kjempebra. Takk for den tilbakemeldingen. Og kom gjerne med andre tilbakemeldinger også. Eller noe dere ikke forstår eller... Et eller annet med videoene som ikke er bra, lyd, bilde, hva som helst. Så gi tilbakemelding. Ja. Hvis det ikke er noen spørsmål da, så tenkte jeg å gå i gang med det som er temaet for i dag. Nei, ingen flere spørsmål. Da skal jeg dele noen slider med dere. Og så skal vi først og fremst se på hva som er dagens tema. Eller hva som er essensen i dagens tema. Sånn. Nå deler jeg en slide om transistorer. Så si ifra hvis dere ikke ser dem. Et lite spørsmål i chatten. Kunne vi bare bruke Putty istedenfor en Linux-terminal? Ja, absolutt. Det kan dere gjøre. Hva slags verktøy, om dere bruker Putty eller Linux-terminal fra Mac eller fra... Det spiller ingen rolle, det er bare en litt sånn teknisk greie. Så bruk det som fungerer for dere.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0002", "start": 322.18, "end": 520.8, "token_count": 590, "text": "Eller hva som er essensen i dagens tema. Sånn. Nå deler jeg en slide om transistorer. Så si ifra hvis dere ikke ser dem. Et lite spørsmål i chatten. Kunne vi bare bruke Putty istedenfor en Linux-terminal? Ja, absolutt. Det kan dere gjøre. Hva slags verktøy, om dere bruker Putty eller Linux-terminal fra Mac eller fra... Det spiller ingen rolle, det er bare en litt sånn teknisk greie. Så bruk det som fungerer for dere. OK. Før jeg begynner på selve slidene, så tenkte jeg å prøve å hoppe til slutten for å se på hva jeg egentlig ønsker å fortelle dere i dag. Og slutten er dette her, som vi skal komme fram til i løpet av dagen. Som vi skal bruke en del tid på. For dette gir på en måte essensen i hva en datamaskin er, og hvordan den er bygd opp fra helt enkle, logiske enheter. Og det vi skal komme frem til i dag, som vi skal jobbe videre med fra neste gang for å lage en hel CPU, det er å få til å få til... Hvordan en krets kan lage, kan gjøre en vilkårlig logisk operasjon. Og den spesielle logiske operasjonen vi ser på her, er hvordan kan en CPU legge sammen to tall. For det er på en måte lett å tenke seg at hvis en CPU kan legge sammen to tall, så kan du få til alle andre mulige ting. Å legge sammen tall er en kompleks logisk operasjon som man ikke uten videre gjør. Spesielt ikke i store tall, så er ikke det så enkelt. Men hvis vi får til dette, kan vi bygge videre. Da kan vi lage gange og subtraksjon og sammenligning og alt mulig annet. På tilsvarende måte. Det vi skal se på i dag, er å... Logisk, men også praktisk. Vise hvordan man kan lage innmaten i denne boksen her. Som er en slags trolldomsboks, som er sånn at hvis man putter inn binære tall på toppen, A og B, så kommer svaret ut som A pluss B. Og da må man starte med... Som du ser her, så starter man med nuller og enere. Det er temaet for neste gang. Da skal vi se på registeret, hvordan man lager bits inne i ICPU-en, sånn at man kan si", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0003", "start": 480.0, "end": 667.2, "token_count": 594, "text": "Vise hvordan man kan lage innmaten i denne boksen her. Som er en slags trolldomsboks, som er sånn at hvis man putter inn binære tall på toppen, A og B, så kommer svaret ut som A pluss B. Og da må man starte med... Som du ser her, så starter man med nuller og enere. Det er temaet for neste gang. Da skal vi se på registeret, hvordan man lager bits inne i ICPU-en, sånn at man kan si OK, jeg vil legge sammen A pluss B, hva blir det? Men det vi ser på nå, er hvordan kan man da kable dette sammen på en sånn måte at uansett hva du putter inn for AB, så kommer summen C ut i den andre enden. Det er ikke noen enkel oppgave. Hvis du fikk den oppgaven og aldri hadde hørt om transistorer og and or not, så ville det vært en relativt vanskelig oppgave. Men det går an å helt logisk bare sette opp dette her, og systematisk lage denne innhatten her med and or not-porter. Og når man har gjort det, så kan man i dag sende inn det til en... Produsent av halvlederblikker. Og så kan man få brent dette inn i hardware. Og man kan sette opp denne logikken med Andorra not porter, og så kan man brenne det i hardware. Og så får man ut i andre enden en dataship som gjør akkurat det man ønsker. Og det er i bunn og grunn det en CPU er. Så det vi skal se på i detalj i dag, er hvordan kan man logisk sett, eller i praksis... Få til dette og lage en vilkårlig krets som gjør en operasjon. Transistoren. Transistoren er grunnlaget for dette her. Altså for det å kunne i det hele tatt lage en datamaskin. De aller første datamaskinene, Det var en transistorrør som lagde disse logiske portene. Og de fungerte, men problemet med det var at de transistorrørene var store. Så datamaskinene ble helt ekstremt store. Så det som la grunnlaget for CPU-en, var halvledertransistoren. Og det var det Shockley Bardin og Bratt Hane som fikk nobelprisen i fysikk for dette. Mange argumenterer for at det er den viktigste oppdagelsen i forrige århundre.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0004", "start": 630.0, "end": 837.16, "token_count": 586, "text": "Det var en transistorrør som lagde disse logiske portene. Og de fungerte, men problemet med det var at de transistorrørene var store. Så datamaskinene ble helt ekstremt store. Så det som la grunnlaget for CPU-en, var halvledertransistoren. Og det var det Shockley Bardin og Bratt Hane som fikk nobelprisen i fysikk for dette. Mange argumenterer for at det er den viktigste oppdagelsen i forrige århundre. Det sier ikke lite, fordi den var grunnlaget for alt som har med datamaskiner å gjøre. Det som er så spesielt med halvleddetransistoren, er at den er ekstremt liten. Det er mulig å konstruere den ekstremt liten, helt nede i nanometer. Bitte små halvlederbitene, så kan man lage logiske and or or not porter. Og ikke bare logiske, men faktisk fysiske porter som utfører logikken. Man har teknologi helt nede i fem nanometer. Og da er det som komponenter av størrelsen fem nanometer, og det er ekstremt lite. Denne teknologien gjør at det er mulig å pakke sammen ekstremt mange små transistorer på et lite område. Der har det vært en fantastisk utvikling fra 70-tallet, hvor de første kommersielle CPU-ene kom. Den hadde noen tusen transistorer. Så har vi økt til i dag hvor det er 20 milliarder transistorer på de største CPU-ene. Det er et ekstremt antall. Så er det noe som heter Mores lov. Det er ikke en lov, men en empirisk lov. Man har vist at sånn ca. annethvert år, så dobler antall transistorer seg i CPU-er. Det har funka ganske bra fra 70-tallet og så helt opp til i dag. Det er logarismisk skala her. Hvis den oppførselen er sånn at den går som to i x-halvet... Hvor ekstra tid den er. Så vil det være en ganske rett strek når du bruker loggplott. Så dette er faktisk en dobling. Da kan man spørre seg hvordan i all verden... For det første er det en teknologisk bragd å få til. Om man har begynt å nærme seg slutten for hva som er mulig. Men for det andre...", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0005", "start": 791.64, "end": 995.66, "token_count": 597, "text": "Det har funka ganske bra fra 70-tallet og så helt opp til i dag. Det er logarismisk skala her. Hvis den oppførselen er sånn at den går som to i x-halvet... Hvor ekstra tid den er. Så vil det være en ganske rett strek når du bruker loggplott. Så dette er faktisk en dobling. Da kan man spørre seg hvordan i all verden... For det første er det en teknologisk bragd å få til. Om man har begynt å nærme seg slutten for hva som er mulig. Men for det andre... Dette gjør ikke bare at CPU-ene går raskere og kan utføre mer arbeid. En stor del av de ekstra transistorene de siste årene har kommet pga. cash. Men det som har vært viktig for utviklingen, er at jo mindre transistorer du har, jo hurtigere kan operasjonene kjøres. Så du får... Du kan kjøre Klokkefrekvensen har også økt hele veien. Her er noen tall på det. Den Intel 404 som lå helt til venstre i hjørnet på den forrige graffen, den hadde 2300 transistorer. Også Intel CEON, som ligger ganske høyt oppe til høyre, den har 7,2 milliarder transistorer. Så det er faktisk en økning på en faktor, en million. Basert tilsvarende på klokkefrekvenser, så har ikke de økt like mye. Men de har økt fra... Den Intel her hadde 500 kHz, eller en halv megahertz. I dag er det typisk fire gigahertz klokkefrekvens. Så det betyr en økning på 8000 omtrent. Da betyr det at siden 1970 så går ting minst åtte gigahertz. Det er gjort en masse andre forberedelser også. Men den største faktoren er at klokkefrekvensen har økt. Den teknologien man har nå, er ganske imponerende. Man kan få 100 millioner transistorer inn på en kvadratmillimeter. Det er helt vanvittige tall. Og man fortsetter nedover. TSMC, som er en halvlederprodusent på Taiwan, som f.eks. IMD nå har outsourcet sin produksjon til. Intel har også noe der. Men Intel produserer det meste selv av CPU-er og silisiumbrikker. Vi jobber også med to og tre nanometer.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0006", "start": 949.7, "end": 1135.06, "token_count": 595, "text": "Den teknologien man har nå, er ganske imponerende. Man kan få 100 millioner transistorer inn på en kvadratmillimeter. Det er helt vanvittige tall. Og man fortsetter nedover. TSMC, som er en halvlederprodusent på Taiwan, som f.eks. IMD nå har outsourcet sin produksjon til. Intel har også noe der. Men Intel produserer det meste selv av CPU-er og silisiumbrikker. Vi jobber også med to og tre nanometer. Men man begynner å nærme seg slutten. Etter hvert er det ikke mulig å gå lenger ned. Fordi radius til et silisiumatom er på 0,1 nanometer. Så det vil ha en diameter på 0,2. Så hvis du får fem silisiumatomer ved siden av hverandre, så vil det ta kanskje... Stort lenger ned enn det kan man ikke gå, man kan ikke bygge fysiske komponenter. For da må man begynne med kvantemekanikk. Effekter som kvantemekanisk tunnelering har faktisk noe å si. Og det skaper problemer for disse silikonprodusentene, halvledderprodusentene. Så de fysiske grensene nærmer seg, så man kan ikke nå lage... Enda mindre og enda raskere CPU-er. Og som jeg nevnte, CPU-frekvensen har ikke økt særlig mye de siste 15 årene. Den var oppe i 3 GHz i 2005 omtrent, og der har det stått stabilt. Det man i stedet har gjort, er å putte på mer cash, som vi skal snakke mye om senere. Putte på mer cash og lage flere CPU-er inn på samme. Altså multicore computing. Vi har noen servere som har kanskje 64 CPU-er. Tidligere hadde alle én. Så var det vanlig med to, og så hadde alle fire. Så økningen, eller måten man får servere til å bli mer effektive på nå, er først og fremst å ha flere CPU-er. Vi skal se litt om teknologien. Vi skal ikke gå så nøye inn på det, vi skal se mer på logikken. Men CMOS er en halvlederteknologi. Og er den som er brukt i så å si alt som er av halvledere. Og den består av to typer transitorer. NMOS og PMOS.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0007", "start": 1091.2, "end": 1278.38, "token_count": 595, "text": "Så var det vanlig med to, og så hadde alle fire. Så økningen, eller måten man får servere til å bli mer effektive på nå, er først og fremst å ha flere CPU-er. Vi skal se litt om teknologien. Vi skal ikke gå så nøye inn på det, vi skal se mer på logikken. Men CMOS er en halvlederteknologi. Og er den som er brukt i så å si alt som er av halvledere. Og den består av to typer transitorer. NMOS og PMOS. Forskjellen på de er at den ene har hull, og den andre har... Altså, det har positive hull, og den andre har elektroner. Men som sagt, vi skal ikke gå inn i tekniske detaljer her. Vi skal se mer på logikken. Og logikken er ganske enkel. Dette er en NMOS-transistor. Og den har en sannhetstabell. Som er ganske enkel. Den er sånn at... her står det X. Og så ser vi her streker her. Dette er ledninger. Hvis vi ser 10 nanometer-teknologi, så er ledningene av den størrelsesorden. Så det er bare noen atomer... Noen silisium... Eller i dette tilfellet er det kobberledninger. Så det er bare noen kobberatomer. Og så er det inni her som halvlederen ligger, her er silisium, som er lagd på en sånn måte at hvis det er en spenning... Vi kan starte med den første. Hvis det er null her, det betyr at det er null spenning. Null volt inn her. Og da opererer dette som en bryter. Hvis vi kan tenke oss at det kommer strøm inn på toppen, og strøm ut i bunnen her. Så hvis du har spenning 0 inn, så er den bryteren av. Da er det ingen kobling mellom toppen og bunnen. Men hvis du setter på en spenning, f.eks. 5 volt inn her, over den transistoren, så skrur man på denne bryteren. En transistor er egentlig bare en bryter. Man skrur på bryteren, og da går det strøm igjennom. Og det er egentlig hele greia. Med den type brytere så kan man... Men hvordan, det skal vi se på i detalj. Pemos er broren til NMOS. Bortsett fra at den virker helt motsatt.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0008", "start": 1234.68, "end": 1429.08, "token_count": 595, "text": "Da er det ingen kobling mellom toppen og bunnen. Men hvis du setter på en spenning, f.eks. 5 volt inn her, over den transistoren, så skrur man på denne bryteren. En transistor er egentlig bare en bryter. Man skrur på bryteren, og da går det strøm igjennom. Og det er egentlig hele greia. Med den type brytere så kan man... Men hvordan, det skal vi se på i detalj. Pemos er broren til NMOS. Bortsett fra at den virker helt motsatt. Han kunne tenkt seg at man... Logisk sett hadde man ikke trengt å ha denne. Man får mye mindre effekttap med denne måten å gjøre det på, å bygge logiske porter av PMOS og NMOS. En PMOS-transistor virker på motsatt måte. Hvis det kommer null inn her, null spenning, så er bryteren på. Da går det strøm igjennom. Hvis det kommer en ener inn, så er den av. Så kommer hele poenget. Hvordan kan man bygge logiske porter ved hjelp av transistor? Som vi så på tidligere, så kan alle logiske operasjoner, de kan utføres hvis man har and-or-or-not-porter. Så hvis vi kan bygge dem med de transistorene, så kan vi. Her ser vi et eksempel på hvordan man kan bygge en notport av to NMOS og PMOS-transistorer. Det sitter en PMOS her. PMOS var den med en liten runding på. Og så sitter det en NMOS her nede. Her ser vi hele koblingsskjemaet. En notport, det vet vi har en sannhetstabell som dette her. Hvis det kommer en spenning 0 inn, hvis det er 0 her, så skal det komme spenning 1 ut. Det kan vi se at vi får til med disse transistorene. For hvis det kommer 0 her, hva skjer da? Jo, da settes det på null spenning opp her til denne P-mossen her oppe. Og da vil den virke. Den vil skru på bryteren. Så da vil det være en lening fra 5 volt og ned til Y. Og dermed så kommer det en positiv spenning ut her. Samtidig når det kommer en null inn her i NMOS-transistoren her nede, så vil den stenge. Altså den stenger av denne her.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0009", "start": 1393.74, "end": 1557.92, "token_count": 594, "text": "For hvis det kommer 0 her, hva skjer da? Jo, da settes det på null spenning opp her til denne P-mossen her oppe. Og da vil den virke. Den vil skru på bryteren. Så da vil det være en lening fra 5 volt og ned til Y. Og dermed så kommer det en positiv spenning ut her. Samtidig når det kommer en null inn her i NMOS-transistoren her nede, så vil den stenge. Altså den stenger av denne her. Så hvis den ikke stengte av den, så ville det bli en spenningsforskjell, og det ville gå strøm gjennom. Og det er akkurat de spenningsforskjellene som man unngår. Ved å bruke to transistorer så gjør man at det momentant skifter. Hvis man bytter om fra 0 til 1 her, så skifter det momentant om fra 1 til 0. Og det går veldig lite strøm i kretsen. Og så tilsvarende. Hvis vi nå switcher, og så setter på en spenning her. Så ser vi, da vil det gå en ener ned hit. Denne vil åpnes. Skru på den bryteren. Dermed går det strøm gjennom her, og du får en positiv spenning ut her. Og tilsvarende en ener inn her vil lukke denne transistoren, sånn at du ikke går strøm ut hit. Uansett så har vi nå laget en port som er sånn at kommer det null spenning inn, så går det én positiv spenning ut. Kommer det positiv spenning inn, så kommer det null spenning ut. Og dette er den aller minste byggescenen i en datamaskin. Ved hjelp av sånne brytere så kan man da bygge hva som helst. Det vil si, man kan ikke bygge hva som helst med en nattport. Man trenger også or og and. Og or og and er litt mer kompliserte. Begge to. Da trenger man seks transistorer for å lage den riktige logikken. Her blir det litt mer innfløkt. Men hvis man setter seg ned og ser på dette, så er det ganske enkelt å overbevise om alle mulighetene. A og B skal da være 0, 0, 1, 1, 0 og 1, 1. Så kan man se på hver av de.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0010", "start": 1520.64, "end": 1718.76, "token_count": 586, "text": "Man trenger også or og and. Og or og and er litt mer kompliserte. Begge to. Da trenger man seks transistorer for å lage den riktige logikken. Her blir det litt mer innfløkt. Men hvis man setter seg ned og ser på dette, så er det ganske enkelt å overbevise om alle mulighetene. A og B skal da være 0, 0, 1, 1, 0 og 1, 1. Så kan man se på hver av de. B er 0, da stenges denne bryteren. Hvis A er 1, så åpnes denne, osv. Så kan man finne ut at den virker akkurat som den skal. Hvis det kommer 0-0 inn her, så kommer det 0 ut der. Hvis det kommer 0-1, så vil det alltid komme 1 ut her som resultatet. Og så ser vi da, med seks transistorer, så kan vi da bygge en sånn or-port fysisk. Og den blir da brent inn... Man lager transistorene, og så brenner man dette inn i små kretskort. Og så får man ut akkurat det man ønsker. Tilsvarende har man for ranporten. At man får dens virkemåte. Ved å sette sammen seks transitorer på en litt annen måte, som da gir en annen port. Ja. Så det vi ønsker å oppnå som sluttresultat... Altså helt til slutt i dag så skal vi ha en krets som legger sammen to tall. Generelt, det vi ønsker å oppnå, er binære funksjoner, At det kommer inn input abc. Dette kan da f.eks. være tall. Og så kommer det ut funksjoner i andre enden, f av abc og g av abc. Og da kunne f.eks. denne funksjonen være... Være en sum av... La oss si du har def også her. Abc pluss def som to tall. De til sammen gir det resultatet som kommer ut her. Eller at man har satt sammen not eron, not all and, sånn at man får ut akkurat den funksjonen man ønsker. Og for å kunne lage alle typer CPU-operasjoner, så trenger man generelt å kunne lage alle mulige slags binære funksjoner. En liten repetisjon av and or not fra forrige gang, var for å se hvordan...", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0011", "start": 1669.52, "end": 1859.0, "token_count": 581, "text": "Være en sum av... La oss si du har def også her. Abc pluss def som to tall. De til sammen gir det resultatet som kommer ut her. Eller at man har satt sammen not eron, not all and, sånn at man får ut akkurat den funksjonen man ønsker. Og for å kunne lage alle typer CPU-operasjoner, så trenger man generelt å kunne lage alle mulige slags binære funksjoner. En liten repetisjon av and or not fra forrige gang, var for å se hvordan... For de skal vi da bruke hele tiden når vi bygger de logiske funksjonene. Her ser vi and-tabellen. Og i digital teknikk er det vanlig å bruke et gangetegn, a ganger b. For dere som har hatt diskré matematikk, har dere typisk brukt dette tegnet av and. Det er samme operasjon. I bolsk algebra vil du ha uttrykk som dette. Null ganger null er null. Vi ser at alle disse uttrykkene stemmer med vanlig algebra. Dette er et symbol for en annen port. Det kommer A og B inn fra venstre, og ut på høyresiden får man A ganger B. Tilsvarende for År. I digital teknikk skriver man det vanlig som A pluss B. Dere er kanskje vant til... Noen av dere er vant til A eller B på denne måten? Og igjen så er dette bolsk algebra. Null pluss null er null. Her ser vi at det er én forskjell. Dette ligner jo på vanlig algebra. Helt fram til hit. Én pluss én er én. Og der vil de fleste susse, som er vant til... Men én pluss én er én. Det betyr at hvis det kommer to enere inn i en orf-port, så skal det gå en ener ut også. Not, som vi så veldig nær på hvordan man bygger fysisk. Den er veldig enkel. Kommer det null inn, så kommer det en ener ut. I digital teknikk så vil en strek over... I diskré matematikk brukte dere dette tegnet, og det som er mer vanlig i logikk sånn generelt. Så er dette tegnet for not. Det betyr det samme. Sannhetstabell er viktig for det vi skal jobbe med. En sannhetstabell er en tabell som sier nøyaktig hvordan en logisk funksjon er.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0012", "start": 1813.72, "end": 2009.98, "token_count": 588, "text": "Not, som vi så veldig nær på hvordan man bygger fysisk. Den er veldig enkel. Kommer det null inn, så kommer det en ener ut. I digital teknikk så vil en strek over... I diskré matematikk brukte dere dette tegnet, og det som er mer vanlig i logikk sånn generelt. Så er dette tegnet for not. Det betyr det samme. Sannhetstabell er viktig for det vi skal jobbe med. En sannhetstabell er en tabell som sier nøyaktig hvordan en logisk funksjon er. Og denne skal vi da bruke når vi f.eks. skal legge sammen tall. Så har vi noen ideer om hvordan skal disse a-ene og b-ene kobles sammen. Hva skal vi ha ut? Og denne fa-b-en her er bare et eksempel på en sannhetstabell. Det er et eksempel på en logisk funksjon. Og da er det rett og slett spesifisert på den måten at man setter av... Alle mulige verdier for A og B. Og så må man spesifisere i hvert tilfelle hva den logiske funksjonen skal bli. F.eks. hvis A lik 0 og B lik 0, altså ikke kommer spenning inn på noen av portene, da skal det være en positiv spenning ut. Og tilsvarende for de andre linjene. Logisk uttrykk. Det vi som regel gjør, er at vi vet sannhetsstabellen. Vi vet hva vi ønsker å få til, hva vi ønsker å skape med den logiske kretsen vår. Men så trenger vi å kunne tegne det med ære. Det er her de logiske uttrykkene kommer inn. Gitt en sandhetsstabell, vi ser nå på to variabler, men vi kan også ha mange variabler. Fire variabler f.eks. Da kan man helt tilsvarende sette opp sandhetsstabeller. Med fire variabler blir det 16 forskjellige linjer i sandhetsstabellen. Men uansett så kan man på samme måte ut ifra Sandnes-stabellen, så kan man skrive ned et logisk uttrykk. Det er en systematisk måte å gjøre det på. Og det man gjør, den teknikken man bruker for å få til det, det er at man ser på at et sånt som er et produkt A ganger B, det vil kun være lik én hvis både A og B er like.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0013", "start": 1974.14, "end": 2145.1, "token_count": 592, "text": "Med fire variabler blir det 16 forskjellige linjer i sandhetsstabellen. Men uansett så kan man på samme måte ut ifra Sandnes-stabellen, så kan man skrive ned et logisk uttrykk. Det er en systematisk måte å gjøre det på. Og det man gjør, den teknikken man bruker for å få til det, det er at man ser på at et sånt som er et produkt A ganger B, det vil kun være lik én hvis både A og B er like. I alle andre tilfeller så vil det produktet være lik null. Så hvis man da tar en... Så plukker man ut alle linjene i sannhetstabellen som skal være én. Og så lager man det... Og så lager man det produktet, det logiske produktet, som er sånn at det blir lik én i dette tilfellet. Det blir litt teoretisk, men vi kan se på for eksempel den... Skal vi se hvilket eksempel bruker jeg her... Jo, den første. I dette tilfellet så er det to ledd i sannhetstabellen som er igjen. Og da tar vi det... Hvis A og B skal bli lik 1, altså hvis A ganger B skal bli lik 1, så må jo... Da må vi gange sammen ikke A, gange ikke B. Altså hvis vi setter en not på a og en not på b, da får vi 1, og da får vi ut produktet 1. Så det vi da må gjøre, er å ha med dette leddet. Det er det første leddet man må ha med i den summen som skal utgjøre hele det logiske uttrykket. Hvis du har med dette leddet her, så er du sikker på at det leddet... Hvis a er 0 og b er 0, så blir dette leddet 1. Det smarte da er at da kan man starte med dette leddet, og så kan man legge til eller ta med en pluss, eller en logisk eller. Man tar med pluss og legger til alle de andre leddene i Sandnes-stabellen som skal bli én. I vårt tilfelle er det bare ett annet ledd som skal bli én. Det er dette leddet her. Og for å få med et produkt som alltid gir 1, så må dette bare være A ganger B. A ganger B er alltid 1 hvis A og B er 1. I alle andre tilfeller blir det 0.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0014", "start": 2100.0, "end": 2274.2, "token_count": 588, "text": "Det smarte da er at da kan man starte med dette leddet, og så kan man legge til eller ta med en pluss, eller en logisk eller. Man tar med pluss og legger til alle de andre leddene i Sandnes-stabellen som skal bli én. I vårt tilfelle er det bare ett annet ledd som skal bli én. Det er dette leddet her. Og for å få med et produkt som alltid gir 1, så må dette bare være A ganger B. A ganger B er alltid 1 hvis A og B er 1. I alle andre tilfeller blir det 0. Så hvis vi legger til A ganger B til dette leddet her, så vil vi få, som vi ser her nede, så får vi dette uttrykket som da er hele det logiske uttrykket for... Hele denne sannhetsstabellen. Dette oppsummerer hva vi gjør. Vi skriver ned tilsvarende uttrykk for alle linjer som gir 1 i sannhetsstabellen. I vårt tilfelle så var det to sånne linjer som ga 1. Og så til slutt så legger vi sammen alle disse med or. Og da blir det riktig for at... Ikke sant, sånn som a ganger b? At denne gir en logisk ener. I alle andre tilfeller så gir dette null. Men det å legge til null, det endrer ikke uttrykket. Hvis du har en variabel a pluss null, det gir a. Så det endrer ikke noe på uttrykket. Og dermed vil vi oppnå at denne logiske funksjonen her alltid er riktig. Så... De detaljene her er ikke så ekstremt viktige. Men det som er veldig viktig, det er, hvis vi går tilbake til sandelstabellen, at gitt en sandelstabell, så kan vi bare skrive ned med de enkle reglene vi ser, et logisk uttrykk. Og det er det logiske uttrykket som vi trenger. For nå skal vi ta det logiske uttrykket, og så skal vi tegne en kredits. Og da er vi på en måte i mål. Ja. Da har vi startet med en sannhetstabell, og så har vi skrevet ned et logisk uttrykk for den sannhetstabellen. Og da kan vi begynne å tegne krets. Og når vi har tegnet en krets, så kan vi bare sende inn til Intel", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0015", "start": 2242.28, "end": 2413.88, "token_count": 596, "text": "Og det er det logiske uttrykket som vi trenger. For nå skal vi ta det logiske uttrykket, og så skal vi tegne en kredits. Og da er vi på en måte i mål. Ja. Da har vi startet med en sannhetstabell, og så har vi skrevet ned et logisk uttrykk for den sannhetstabellen. Og da kan vi begynne å tegne krets. Og når vi har tegnet en krets, så kan vi bare sende inn til Intel og be dem om å brenne denne kretsen, og så får vi hardware som er akkurat som Men først må vi tegne kretsen. Det er ganske enkelt, for da har vi ledninger A og B som kommer inn her. Så må man sette spenning over. Og så, når man har et uttrykk som det her, A ganger B pluss A ganger B, så tenker vi oss først at først må jeg ha A ganger B. Og A ganger B, da trenger jeg en and-port. Og den har jeg her. Så da kommer A ganger B ut her på høyre side. Så trenger jeg å legge til, eller... legge til med en år, som jeg skal se... Jeg trenger å legge til dette uttrykket. Not A ganger Not B. Og da kan jeg bare sette på to not-porter her oppe av. For da kommer det en kabel her med A. Så går den inn i not-port. Da kommer ikke-A ut på andre siden. Og så kommer ikke-B her. Og de sendes inn and-port. Her står det en pluss, det er en år. Så da er det bare å ta de to, a ganger b og ikke a ganger b, og legge inn i årporten. Og vips, så har vi kretsen vi ønsker. Hvis vi har flere ledd her, så er det bare å legge dem inn i samme årport. Eller man kan også ha flere årporter. Hvis man har a ganger b ganger c, så kan man også legge det inn. Og på den måten så kan man skrive ned hardware for enhver logisk krets. Og så... Før man da... Før man da sender inn til brenning av kretser, så ønsker man gjerne å forenkle. Så... Det man... Ja. Bare for å vise litt forenkling, så kan vi se på en krets. For det første... Hva blir den bolske funksjonen for denne her?", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0016", "start": 2362.52, "end": 2605.48, "token_count": 599, "text": "Eller man kan også ha flere årporter. Hvis man har a ganger b ganger c, så kan man også legge det inn. Og på den måten så kan man skrive ned hardware for enhver logisk krets. Og så... Før man da... Før man da sender inn til brenning av kretser, så ønsker man gjerne å forenkle. Så... Det man... Ja. Bare for å vise litt forenkling, så kan vi se på en krets. For det første... Hva blir den bolske funksjonen for denne her? Jo, her ser vi at vi har to enere. Så den bolske funksjonen for dette her må bli ikke A ganger B pluss A ganger B. Ja, vi kan jo ta det her. Ikke A ganger B, det er det første uttrykket her, pluss A ganger B, siden dette også skal gi en ener. Dette logiske uttrykket vil alltid oppfylle sannhetstabellen, fordi det gir ener i de to tilfellene og null i de to andre. Men så kan man jo da tegne opp dette som en krets. Her har jeg tegnet opp denne kretsen. Men det vi skal se på nå, er hvordan kan man forenkle denne kretsen. Igjen så blir dette mer sånn ingeniørmessig. Kretsen virker som den skal. Men man kan spare enormt med porter hvis man forenkler kretser. Og det kan også gjøres på en sympatisk... Ikke sympatisk, men systematisk. Og det er at man først forenkler, og så brenner man kretsen. Ser det kommer en spoiler-alert her i chatten. Det er faktisk helt riktig, og det ser jo litt utrolig ut. Men vi skal se på etter pausen, hvordan man kan generelt forenkle det. Den er en liten spoiler av løk. Prøv å se på dette i pausen. Hvorfor er egentlig... Hvorfor er dette riktig? At f er lik b? OK. Men da tar vi en liten, eller et kvarters pause der. Vi tar pause til 9.30, så starter vi igjen da. ... og det er veldig vanskelig å forstå hva som skjer. Sånn. Der er også opptak i gang. Før vi fortsetter, så var det noen spørsmål i pausen, så jeg skal gå gjennom det. Og så tenkte jeg også å kjøre en liten quiz, eller en liten poll, på noen av disse kretsene.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0017", "start": 2535.06, "end": 2758.92, "token_count": 588, "text": "At f er lik b? OK. Men da tar vi en liten, eller et kvarters pause der. Vi tar pause til 9.30, så starter vi igjen da. ... og det er veldig vanskelig å forstå hva som skjer. Sånn. Der er også opptak i gang. Før vi fortsetter, så var det noen spørsmål i pausen, så jeg skal gå gjennom det. Og så tenkte jeg også å kjøre en liten quiz, eller en liten poll, på noen av disse kretsene. Bare så dere kan prøve dere litt. Og vise hva dere har fått med dere. Men aller først, det var et spørsmål... Nei, ikke kaot, bare en zoompoll. Kanskje det kommer noe kaot etter hvert. Skal vi se. Jeg skal dele slidene først. Men om denne kretsen her, og spesielt hvordan... Hvis det kommer en positiv spenning inn her ved X, altså XL1... Hvorfor det da går... Hvorfor det da kommer null ut? Fordi... Ja-spørsmålet var vel... Hvis det kommer en ener inn her, så... Skrus jo denne bryteren på, og da går det strøm herfra og opp hit. Og hvis det går strøm, er ikke da den også en ener? Men dette gjelder spenninger, så det er på en måte... Problemstillinga er hvis du måler spenningen som er her på Y i forhold til null. Hva får du da? Og da vil det være sånn at når... Når en ener kommer inn, altså når det er positiv spenning hos X, så er det riktig. Da skrus den bryteren på, og da tilsvarer det at det går en ledning herfra. Altså fra null volt så går det en ledning og opp til y. Og da vel, siden dette er en ledning, en kobberledning som leder veldig godt, så vil det på y, så vil det da være null spenning. Når du setter på spenning her, så åpnes porten. Denne blir strømførende, og det blir en ledning som går da direkte fra jord, fra 0 volt og opp til y. Så hvis du da måler spenningen her på y, så vil du få null. Så... Skrur du på den bryteren her, så betyr det at da er det en ledning mellom y og null, og da vil den være null.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0018", "start": 2715.76, "end": 2923.88, "token_count": 596, "text": "Og da vel, siden dette er en ledning, en kobberledning som leder veldig godt, så vil det på y, så vil det da være null spenning. Når du setter på spenning her, så åpnes porten. Denne blir strømførende, og det blir en ledning som går da direkte fra jord, fra 0 volt og opp til y. Så hvis du da måler spenningen her på y, så vil du få null. Så... Skrur du på den bryteren her, så betyr det at da er det en ledning mellom y og null, og da vil den være null. Vi skal ikke bruke veldig mye tid på dette og se på det i detalj, men ideen, eller hovedtanken, er at da kan dere se at dette... Sånn funker det. Og sånn er det mulig å få til alle de andre bitene også. Det er mer sånn at hvis det skjedde en tredje verdenskrig og alt gikk tapt, så skulle dere ved hjelp av de ideene her, Så skulle dere kunne tenke dere frem til hvordan kan man lage neste generasjon datamaskiner ved hjelp av dette her. For det er ganske enkel logikk med denne type brytere som lager all logikk i en datamaskin. Og verre er det ikke, men samtidig blir det komplisert når man setter det sammen. OK. Som sagt, før vi går videre, så tenkte jeg... Og prøve å kjøre en liten tål. Men da skal jeg bare dele en krets først. Skal vi se... Nå ser dere forhåpentligvis en liten krets. Og spørsmålet e, hva blir det logiske uttrykket FAB for denne kretsen? Hvor første spørsmål er...? Den vises hos meg i hvert fall. Nå er det noen som svarer også, så da funker det. Det er to spørsmål. Det første, hva blir det logiske uttrykket for kretsen på bildet? Og det neste er, hva kan kretsen forenkles til? Det går an å gjøre en forenkling på den kretsen. Bruk gjerne et... ja, folk er i gang med svaret. Bruk gjerne litt tid på å se på det. Ine? Ja. Nå er Ine her, så når som helst i forelesningen så send spørsmål i chatten. Enten til alle eller til Ine direkte, så kan hun svare.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0019", "start": 2864.54, "end": 3136.5, "token_count": 590, "text": "Det er to spørsmål. Det første, hva blir det logiske uttrykket for kretsen på bildet? Og det neste er, hva kan kretsen forenkles til? Det går an å gjøre en forenkling på den kretsen. Bruk gjerne et... ja, folk er i gang med svaret. Bruk gjerne litt tid på å se på det. Ine? Ja. Nå er Ine her, så når som helst i forelesningen så send spørsmål i chatten. Enten til alle eller til Ine direkte, så kan hun svare. Altså Ine, man ser ikke hva de andre svarer, ikke sant, på den pollen? Jeg tror ikke det, jeg kan teste å bare svare noe tilfeldig. Jeg bare ser hva som skjer, hvordan du ser ut. Nei, da forsvinner den hos meg etterpå. Jeg får bare opp den, og så får jeg spørsmålene, og når jeg da har svart, så forsvinner den. Ja, den er grei. Da... Tenk litt mer... Jeg ser halvparten av dere har svart. Bruk gjerne litt mer tid og prøv å tenke til svar. Dette er anonymt i tillegg, så ingenting vil... Det vil bli lagret, så ikke vær redd for å slenge av gårde et svar. Så skal vi se litt på svarene etterpå og prøve å forklare hvilke svar som er riktige. Jeg kan jo prøve det mens dere svarer. Det jeg tenkte å gjøre, var å tegne på et ark. Nå skal jeg se om jeg klarer å vise det til dere. Ja... Nå ser jeg 74 % av svart. Vi kan ta et minutt til, vi. Så stopper jeg pollen om 50 sekunder, og så ser vi på svarene. Ine er klar. Hvor lang tid har du å se hva jeg tegner, da? Den... siden når du har delt skjermen, så blir bildepokalen litt lite. Jeg ser det sånn lite grann, og så er den opp ned. Opp ned, ja. Eller for meg, da. Å ja. Er den riktig vei nå? Nei, det var ikke opp ned i stad. Jeg tror kanskje bilde av fryste eller noe sånt, for jeg har ikke sett at det endrer seg. Ja, akkurat. Men jeg kan prøve å stoppe å dele, så kan vi se om det ser bedre ut da.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0020", "start": 3094.8, "end": 3323.46, "token_count": 591, "text": "Den... siden når du har delt skjermen, så blir bildepokalen litt lite. Jeg ser det sånn lite grann, og så er den opp ned. Opp ned, ja. Eller for meg, da. Å ja. Er den riktig vei nå? Nei, det var ikke opp ned i stad. Jeg tror kanskje bilde av fryste eller noe sånt, for jeg har ikke sett at det endrer seg. Ja, akkurat. Men jeg kan prøve å stoppe å dele, så kan vi se om det ser bedre ut da. Ja, for den var litt liten mens den skjermdelingen var på. Ja, et øyeblikk. Sånn. Hvordan ser det ut nå, kan du se tegningen? Ja, jeg ser den. Ja, flott. Så det jeg tegner opp nå, er bare den tegningen som vi hadde i oppgaven? Så kommer F ut der. Da kan vi stoppe. Da ser jeg 80-80. Det er kjempebra. Da stopper jeg og så deler jeg resultatene. Ine, kan du se resultatene fra pollen nå? Ja, jeg får opp sånn prosentvis på svarene, og så markert med farge. Ja, da kan vi se på det første svaret. Og her ser vi at tre fjerdedeler av dere har svart A ganger B pluss B. Og det er kjempebra, for det er helt riktig. For det som skjer her, er at dette er en anport. Og da er det A og B kommer inn i anporten. I tillegg tar man en kabel fra B her og inn i denne årporten. Dette er en and, og dette er en år. Da kommer det inn i årporten, og da vil det som kommer ut da, være a ganger b pluss er år, pluss den b-en som kommer derfra. Veldig bra. En stor del av dere hadde fått med seg dette. Neste spørsmål er litt vanskeligere. Hva kan kretsen forenkles til? Og det er jo ikke så opplagt. Jeg kan se på et par måter å forenkle på. En måte er å ta utgangspunkt i det uttrykket. A ganger B pluss B. Ikke at vi skal drive veldig mye med bolsk algebra, men det er fint å være klar over muligheten. I bolsk algebra så kan man faktisk bruke en del av de metodene som man bruker i vanlig algebra. F.eks. kan jeg sette B utenfor parentes,", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0021", "start": 3278.96, "end": 3461.06, "token_count": 592, "text": "Neste spørsmål er litt vanskeligere. Hva kan kretsen forenkles til? Og det er jo ikke så opplagt. Jeg kan se på et par måter å forenkle på. En måte er å ta utgangspunkt i det uttrykket. A ganger B pluss B. Ikke at vi skal drive veldig mye med bolsk algebra, men det er fint å være klar over muligheten. I bolsk algebra så kan man faktisk bruke en del av de metodene som man bruker i vanlig algebra. F.eks. kan jeg sette B utenfor parentes, akkurat som om det skulle vært vanlig algebra, og så skrive A pluss 1. Og A pluss 1. Det er altså A år 1. Og man vet om en årport hvis man får inn en ener på en... Hvis én av inputene er én, så er årporten alltid én. Så det betyr det er en identitet i bord skalgebra at A pluss én, det er rett og slett én. Så dette her vil da være lik én ganger B. Og én and B... Det er også en identitet. Den vil alltid være lik B. Så riktig svar på den... Det har også flertallet fått til. Veldig bra. 43 % har svart at man kan forenkle den til en B. Det går også an å se dette her ved å prøve og feile. Så man kan f.eks. si sånn OK... Hvis det kommer en ener inn i B-en, så går den borti overporten. Og hvis det kommer en ener inn i overport, så kommer det alltid en ener ut. Så i det tilfellet at B ligger 1, da er det B. Hvis B er 0, så kommer det en 0 inn i overporten. Så det som kommer ut til slutt, er det som kommer inn her. Men hvis B er 0, så vil det da komme 0 inn i overporten. Så vil det gå en null inn der. Og da får man null ut. Dermed kan man også på den måten se at OK, dette er... Uttrykket er lik B. En siste måte å se dette på, det er å rett og slett skrive opp sannhetsstabellen. Det kan man alltid gjøre. Jeg skriver opp standardstabellen og sier at hvis jeg sjekker punkt for punkt... Hvis 0-0 kommer inn, så finner jeg ut at da kommer 0 ut.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0022", "start": 3420.0, "end": 3671.92, "token_count": 591, "text": "Så vil det gå en null inn der. Og da får man null ut. Dermed kan man også på den måten se at OK, dette er... Uttrykket er lik B. En siste måte å se dette på, det er å rett og slett skrive opp sannhetsstabellen. Det kan man alltid gjøre. Jeg skriver opp standardstabellen og sier at hvis jeg sjekker punkt for punkt... Hvis 0-0 kommer inn, så finner jeg ut at da kommer 0 ut. Hvis 0-1 kommer inn, så ser jeg hva alt blir. Da kommer en ener ut. Hvis 1-0 kommer inn, hva blir det da? Jo, da kommer det en null ut. Sjekker alle portene osv. Og så kan jeg rett og slett fra sandenstabellen se at... OK, men her ser vi at F er lik B, faktisk. I alle tilfeller så er F lik B. Så da kan vi bare lese ut fra sandenstabellen og se at en F er lik B. Sånn kan man forklare svaret på de to Poll-resultatene. Ok. Fint. Da skal vi gå videre. Og som jeg har sagt noen ganger, det er ikke så ekstremt viktig å kunne alle detaljene om obolske algebra osv. Men det er viktig å få med seg... Prinsippet er at hvis vi kjenner sannhetstabellen, så kan vi skrive ned en logisk krets. Og så kan vi faktisk da fysisk brenne og lage denne kretsen. Så tilbake til slidene. Da kan jeg kanskje bare endre... Bilde her også. Oi, det er... så jeg litt mer ut som... Et lite øyeblikk her. Oi. Ine, hører du meg? Ja. Du ser veldig morsom ut. Der. Det er tydeligvis et eller annet galt med screen her nå. Jeg blir rosa og grønn innimellom, så det hender den tuller litt. Det ble litt surrende, bittert kamera her. Men... Jeg fikk en beskjed om at den stoppet, men du kan høre meg fortsatt? Ja, hører deg og... jeg ser deg. Du er en litt mørk stripe i ansiktet, men ellers så syns det greit. Det har skjedd noen ganger at jeg har blitt rosa, og så har den stabilisert seg litt etter hvert, så vet ikke om... Kanskje det skjer.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0023", "start": 3615.24, "end": 3857.94, "token_count": 600, "text": "Jeg blir rosa og grønn innimellom, så det hender den tuller litt. Det ble litt surrende, bittert kamera her. Men... Jeg fikk en beskjed om at den stoppet, men du kan høre meg fortsatt? Ja, hører deg og... jeg ser deg. Du er en litt mørk stripe i ansiktet, men ellers så syns det greit. Det har skjedd noen ganger at jeg har blitt rosa, og så har den stabilisert seg litt etter hvert, så vet ikke om... Kanskje det skjer. Jeg kan bare prøve å skifte... Nei, det hjelper ikke. Ja, det er ikke så viktig. Jeg kan egentlig... Ja, da tar jeg bare vanlig green screen, så... OK. Det var noen spørsmål i chatten her som vi kan ta først. Er det slik at den siste kretsen er en forenkling av den foregående, siden begge kunne forenkles til FRLigB? I forhold til den vi antar spørsmålet er, Denne kretsen. Og den forenkler seg også til B. Men det er egentlig mer tilfeldig. Det er en forskjellig krets, men den... tilfeldigvis forenkles den til B. Ine, bare ett spørsmål. Ser du sliden her nå OK? Ja, nå ser du også helt normal ut. Så alt er bra. Ikke helt normal, kanskje, men sånn du pleier. Ikke som en superhelt i hvert fall. Det vi så på var hvordan kan denne kretsen forenkles, og da kom en spoiler-alert. Denne kretsen er bare lik B. I første omgang kan vi se dette sånn som jeg gjorde fra Sandnes-stabellen. En annen måte å se på det på er å bruke Bolsk-algebraa og forenkle. Da er det noen identiteter i Bolsk-algebraa som er enkle å skrive ned. I Bolsk-algebraa er det bare to muligheter. Enten A er 0 eller 1, så vil alltid dette være 1. Hvis X er 0, så er 1 og 0 er 0. Hvis X er 1, så er 1 og 1 1. Så kan man forenkle sånn som dette her, som jeg gjorde, man kan sette B utenfor i en parentes, og ikke A pluss A, det er én. Dermed får man én og B. Én og B er alltid B, så dette er B.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0024", "start": 3828.04, "end": 3998.8, "token_count": 596, "text": "Enten A er 0 eller 1, så vil alltid dette være 1. Hvis X er 0, så er 1 og 0 er 0. Hvis X er 1, så er 1 og 1 1. Så kan man forenkle sånn som dette her, som jeg gjorde, man kan sette B utenfor i en parentes, og ikke A pluss A, det er én. Dermed får man én og B. Én og B er alltid B, så dette er B. Og dermed så kan denne kompliserte kretsen forenkles til bare en direkte kobling mellom B og F. Det er klart. Det er klart at dette er... det er veldig viktig å gjøre den type forenklinger for at kretsene ikke skal bli så kompliserte. Men i prinsippet kunne man bare levert inn de tegningene på den opprinnelige stabellen. Men da ville man ikke kunne ha like høy klokke, folkens, på CPU-en man lager. Så dette er mer en sånn ingeniørmessig ting, at man forenkler før. Før man tegner og brenner kretsen, for at den skal bli mer effektiv. OK. Vi startet ut med at vi ønsket å lage en krets som utfører binær addisjon mellom to binære tall. Det vi må gjøre da, er at vi må implementere... Algoritmen for å legge sammen binært må vi implementere med logiske funksjoner. Etter vi har gjort det, kan vi tegne en krets som utfører det vi ønsker. Da må vi først se på hvordan virker binær adhesjon. Den virker nøyaktig som, om dere ikke har gjort dette før, så er metoden nøyaktig sånn som når man legger sammen desimaltall. Med mente osv. Vi kan se på hvordan vi legger sammen to tall her. Dette er 01 pluss 11. 01 er jo tallet 1. Det er en 0 toere og en ener. Og så legger man til en toer og en ener, som er tallet 3. Man starter her med 1 pluss 1. 1 pluss 1 er jo 2, men binært så er 1 pluss 1 10. Så vi får da 10, og 0 er det siste sifferet, så det skrives ned her. Og så gjør man akkurat samme operasjonen på neste to siffer, da, i det binære tallet.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0025", "start": 3968.16, "end": 4128.44, "token_count": 588, "text": "Det er en 0 toere og en ener. Og så legger man til en toer og en ener, som er tallet 3. Man starter her med 1 pluss 1. 1 pluss 1 er jo 2, men binært så er 1 pluss 1 10. Så vi får da 10, og 0 er det siste sifferet, så det skrives ned her. Og så gjør man akkurat samme operasjonen på neste to siffer, da, i det binære tallet. Da er det en ener der, en null der og en ener der. Så det blir igjen én pluss én er to. Og to er én null. Så da kommer en mente opp hit, og så kommer denne eneren ned hit. Og så får man svaret én null null. Og én null null det er da fire. Så det vi har gjort nå, er å regne ut én pluss tre er lik fire. Tilsvarende algoritme kan man bruke på absolutt alle binære addisjoner. Om du har 64-bit, så kjører du denne algoritmen 64 ganger. Så får du ut svaret. Det vi skal se på nå, er da... Ja, men hva om vi kan lage en krets som gjør akkurat denne operasjonen her. Ta mente og de to sifferne, og så får du ut et svar og et mente. Og det er akkurat det man gjør. Man lager 64 sånne kretser. Og så setter man sammen de 64 kretsene, og vips, så har du en aderi som kan legge sammen 64-bitstall. For å få til den fysiske boksen, den lille logiske kretsen, som gjør den ene operasjonen, Så kan man skrive ned sannhetsstabellen for en sånn addisjonskrets. En full adder, kalles det. En sånn boks. Og det er da ganske rett frem å skrive ned sannhetsstabellen. Det er denne operasjonen vi skal gjøre om og om igjen. Vi skal legge sammen X og Y. Og så har vi en mente fra før, Z. Så disse tre byttene er da input X, Y og Z. Og så får vi et svar S her. Da er det ganske enkelt for hver av tilfellene å se hva s og z er. Det første tilfellet vi hadde var at z var 1 og y var 1, og x var 0.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0026", "start": 4090.88, "end": 4256.74, "token_count": 596, "text": "Og det er da ganske rett frem å skrive ned sannhetsstabellen. Det er denne operasjonen vi skal gjøre om og om igjen. Vi skal legge sammen X og Y. Og så har vi en mente fra før, Z. Så disse tre byttene er da input X, Y og Z. Og så får vi et svar S her. Da er det ganske enkelt for hver av tilfellene å se hva s og z er. Det første tilfellet vi hadde var at z var 1 og y var 1, og x var 0. Det er det leddet her. Z av 1, i av 1 og x er 0. Hva skal vi få ut da? Jo, da får vi to, så det blir 1-0. S skal være 0 og C være 1. Så får vi en 0 her og en 1 der. Det var den operasjonen vi hadde tidligere. Og tilsvarende kan vi lett sette opp alle de andre. F.eks. hvis alle er 0, da blir det både 0 her og 0 der. Det er den første linja. Og så kan man gå videre sånn. Sånn. Så den generelle metoden... Når man skal lage en bolsk funksjon og putte det inn i en CPU som man kan gjøre en operator. Den anvender vi her i dette tilfellet. Vi skriver ned det bolske uttrykket for de to funksjonene. For disse to funksjonene her. Da bruker vi igjen samme metoden. For S så må vi ha med et ledd for hver gang den er én. Så f.eks. det første leddet her. Ikke X, ikke Y, ganger... Altså ikke X, ganger, ikke Y, ganger Z. Og så, etter man har gjort det, så forenkler man med Bolskalgebra. Eller noe som heter Carnot-diagram, som er en mer avansert måte, så man kan utføre ganske kompliserte forenklinger med diagrammer. Vi hadde tidligere et kurs som het datamaskinarkitektur. Da brukte vi Carnot-diagrammer og lagde sånne kretser. Nå ser vi mer på prinsippene, men etter at vi har forenklet, så kan vi da tegne en krets med det bortskrivne uttrykket. Som utfører nøyaktig den operasjonen vi ønsker. Så... Først forenkler vi. Så dette er skrevet rett ned fra sandstabellen.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0027", "start": 4225.92, "end": 4397.72, "token_count": 592, "text": "Vi hadde tidligere et kurs som het datamaskinarkitektur. Da brukte vi Carnot-diagrammer og lagde sånne kretser. Nå ser vi mer på prinsippene, men etter at vi har forenklet, så kan vi da tegne en krets med det bortskrivne uttrykket. Som utfører nøyaktig den operasjonen vi ønsker. Så... Først forenkler vi. Så dette er skrevet rett ned fra sandstabellen. Og det er det som dere må sitte igjen med. Har du... Så kan du bare skrive ned kretsen og tegne den og produsere den. Sandhetsstabellen får du fra den logikken du ønsker. Vi ønsket å kunne legge sammen tall. Da skrev vi ned en sandhetsstabell med det innholdet. Og så så vi at det som da skal komme ut av S og C, s er de to funksjonene. Og så kan man med Bols galgebra eller på andre måter vise at f.eks. den funksjonen her, den kan forenkles til dette uttrykket. Og så, når man har gjort forenklinger på begge, så kan man begynne å tegne. Nå tegner jeg bare opp C-en. C-en vil la oss se sånn ut. Du får X, Y, Z inn fra venstre, og så får du C-en ut til høyre. Så kan man gjøre det tilsvarende med... Når man har fått til det, kan man sette det sammen til en krets. Eller til en liten boks, en liten komponent, som kalles en full adder. En full adder gjør nøyaktig den operasjonen vi så på. Ved å legge sammen de sifrene her, sett deg mente, og så får den ut ett siffer. Summen og én carry, eller en mente, som da går videre til neste operasjon. Og det som er flott nå, når du har fått laget en liten boks som gjør dette her, så kan man da sette sammen flere sånne bokser for å utføre regneoperasjoner. Da setter man sammen to sånne fulleidere. Og da ser vi. Den første fulleideren her. I det første leddet er det aldri noe mente. Så den er null. Vi har konstruert denne boksen sånn at her kommer riktig S0 ut, og så kommer riktig C ut her nede, som er mente,", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0028", "start": 4357.64, "end": 4541.5, "token_count": 593, "text": "Og det som er flott nå, når du har fått laget en liten boks som gjør dette her, så kan man da sette sammen flere sånne bokser for å utføre regneoperasjoner. Da setter man sammen to sånne fulleidere. Og da ser vi. Den første fulleideren her. I det første leddet er det aldri noe mente. Så den er null. Vi har konstruert denne boksen sånn at her kommer riktig S0 ut, og så kommer riktig C ut her nede, som er mente, som skal sendes videre til neste operasjon. Så da utfører vi den operasjonen med X0 pluss Y0 lik S0 og mente. Og så utføres X1 pluss Y1 pluss mente, blir S1. Det ble første summen. Og så den carrien går opp, og så kommer den ut her. Og dermed så har vi på magisk vis lagd en liten boks som kan legge sammen tobitstall. Det er kanskje ikke noe å rope hurra over, men vi kan jo se da at dette kan vi ta videre. Vi kan... Hvis vi ønsker å legge sammen tre-bits tall, så bare legger vi på en fullader til. Og da kommer det tredje bittet i begge de tallene. De skal da inn i denne boksen. Og så ser vi at vi får en operasjon hvor vi utfører den algoritmen som vi lærte på skolen når vi skulle legge sammen tall. Den utføres nå ved hjelp av bit inne i CPU-en. Tallene strømmer bortover her. Og til slutt så kommer svaret ut. Det denne kretsen her gjør, er å legge sammen disse to tallene. X2, X1, X0. Det kan være f.eks. 101 pluss 001. To binære tall. Og så får vi et svar ut i den andre delen. Så på denne måten så kan man da lage enhver... Hvilken logisk ønsket operasjon kan man konstruere på denne måten? Man setter opp sandelstabellen, skriver ned det logiske bolske uttrykket og forenkler. Og så lager man kretsen. I SPU vil man hele tiden lage denne typen av små operasjoner,  Så setter man de sammen til større operasjoner. Sånn som dette her, som kan da, med 64 sånne fulleidere, så kan man legge sammen 64-bits-tall.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0029", "start": 4500.0, "end": 4697.36, "token_count": 596, "text": "Hvilken logisk ønsket operasjon kan man konstruere på denne måten? Man setter opp sandelstabellen, skriver ned det logiske bolske uttrykket og forenkler. Og så lager man kretsen. I SPU vil man hele tiden lage denne typen av små operasjoner,  Så setter man de sammen til større operasjoner. Sånn som dette her, som kan da, med 64 sånne fulleidere, så kan man legge sammen 64-bits-tall. Her startet vi i dag tidlig. Dette var det vi ønsket. Og jeg håper dere nå ser hvordan man generelt går fram for å lage en sånn type krets som dette her. Som adderer to firebits-tall. Hvis vi får tid skal vi se litt etterpå på hvordan man kan simulere dette. Men dere vil nå kunne... Det er vel en oppgave denne uken også. Hvor dere blir bedt om å lage en krets som legger sammen... Men det jeg håper dere ser, er hvordan man helt logisk kan sette opp sannhetsstabeller hvor man koder inn den logikken som man ønsker skal skje. Den operasjonen som skal skje med to binære tall. Og så skal man få ut det tredje. Alle mulige logiske operasjoner som man kan tenke seg en CPU trenger å gjøre. Og det er et ganske begrenset antall operasjoner av denne typen. Vi kan tenke oss at du må kunne trekke fra tall. Sammenligne tall, si om de er like eller ulike. Man må kanskje kunne gjøre skiftoperasjoner som tilsvarer å gange et tall med to. Multiplikasjon, som er en god del mer kompleks, men på samme måte så kan du bruke multiplikasjonsalgoritmene og lage den kretsen du måtte ønske. Divisjon er kanskje enda mer komplisert, men når du har addisjon og subtraksjon, så kan du bygge de andre kretsene. Litt på samme måte. Man vet hvilken logikk man ønsker. Og da kan man skrive ned en sanstabell, så kan man tegne en krets, og så får man akkurat den operasjonen man ønsker. Og så vet vi nå... Inni en notport så er det to transistorer. Inni ore og and så er det seks transistorer. Så da ser vi på... Ser vi hvordan en hel CPU er lagd bare av transistorer,", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0030", "start": 4657.96, "end": 4873.8, "token_count": 583, "text": "Divisjon er kanskje enda mer komplisert, men når du har addisjon og subtraksjon, så kan du bygge de andre kretsene. Litt på samme måte. Man vet hvilken logikk man ønsker. Og da kan man skrive ned en sanstabell, så kan man tegne en krets, og så får man akkurat den operasjonen man ønsker. Og så vet vi nå... Inni en notport så er det to transistorer. Inni ore og and så er det seks transistorer. Så da ser vi på... Ser vi hvordan en hel CPU er lagd bare av transistorer, som egentlig er bare små brytere som man setter sammen. OK. Ja. Ina, har det vært noen spørsmål som vi burde ta opp? Det har vært noen spørsmål i forhold til den forenklingen og sånt nå. Med funksjonen av portene. Men nå har de gått litt mer gjennom det. Ja, OK. Jeg kan kikke litt på hva dere har spurt om i chatten, så kan jeg eventuelt legge til noe i notatene. Men skal vi se... Det jeg tenkte å prøve å få til nå, var å se lite grann på... Det simuleringsverktøyet som dere skal bruke i oppgavene. Da kan dere laste det ned til egen... Hvis dere kjører Windows, så kan dere laste det ned til egen Windows-maskin. Alternativt så kan dere starte den virtuelle maskinen, som virtuelle Windows-VM-en, Så da skal jeg dele... dele det vinduet med dere, så vi kan se på det sammen. Sånn. Her er den virtuelle Windows-maskinen. Og så har jeg lastet ned det verktøyet som... Det sto vel en link i forrige ukes oppgaver. Så kan jeg kjøre det. Men sånn ser dette verktøyet ut. Så når jeg ser av designet, er det heller ikke veldig nytt. Men det funker som det skal. Så dere får noen oppgaver denne uken, eller det er noen oppgaver hvor dere skal laste ned noen komponenter og sette dem sammen. Men helt til slutt i dag, så kan jeg vise noen enkle ting, hvordan man bruker det. Her oppe så ser dere at vi har forskjellige gates, eller porter som det heter på norsk. Dette her f.eks. er en and-gate. Hvis man klikker på den,", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0031", "start": 4836.6, "end": 5009.3, "token_count": 587, "text": "Men det funker som det skal. Så dere får noen oppgaver denne uken, eller det er noen oppgaver hvor dere skal laste ned noen komponenter og sette dem sammen. Men helt til slutt i dag, så kan jeg vise noen enkle ting, hvordan man bruker det. Her oppe så ser dere at vi har forskjellige gates, eller porter som det heter på norsk. Dette her f.eks. er en and-gate. Hvis man klikker på den, og så klikker uti kanna sånn her, så ser du at du får opp en port.  Og så blir dere bedt om å gjøre noen oppgaver hvor dere skal sette sammen sånne porter. For i dette verktøyet kan man logisk sette sammen porter, sånn at de virker sånn som de ville virke hvis man brenner dette og lager det med halvledere. Så da er det noen sånne input man trenger. F.eks. her oppe står det en interaktiv input. Så hvis jeg klikker på den, og så plasserer den ut her. Dette er en bryter som kan skrus på som null og én. Og så ønsker jeg deg å putte den inn i en AND-port. Og da er det en liten blyant oppå hjørnet her, Viring Tool. Den vil jeg nå bruke for å koble sammen inputen der til AND-porten. Og da... Venstre-klikker jeg sånn, så har jeg koblet de to sammen. Så kan jeg gjøre det tilsvarende... Jeg ønsker å ha en input til. Da gjør jeg tilsvarende. Hvis man er litt forsiktig, så får man rette og fine linjer. Nå ble den kanskje litt skjev. Sånn. Da har jeg to input, og så ønsker jeg å se hva som blir output her. Her oppe har jeg en ledd. Et lite leddlys. Rødt kan vi tenke oss at det betyr én, mens hvitt eller ingenting, det er null. Og nå har jeg lagd en liten krets. Og så, i utgangspunktet, så... Skal vi se... Så kan vi prøve å kjøre den kretsen. For å kjøre kretsen, så trenger jeg å bruke den hånden der, altså peke. Da kan jeg skru på en ener. Da kommer det en ener inn i anden. Og nå setter jeg på en ener til. Så kommer det to enere.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0032", "start": 4973.28, "end": 5152.84, "token_count": 598, "text": "mens hvitt eller ingenting, det er null. Og nå har jeg lagd en liten krets. Og så, i utgangspunktet, så... Skal vi se... Så kan vi prøve å kjøre den kretsen. For å kjøre kretsen, så trenger jeg å bruke den hånden der, altså peke. Da kan jeg skru på en ener. Da kommer det en ener inn i anden. Og nå setter jeg på en ener til. Så kommer det to enere. Da burde det jo komme en null ut, men da må vi først kjøre kretsen. Her oppe står det rønn. Så hvis du trykker på rønn nå, så begynner kretsen å kjøre. Da virker kretsen. Og da ser vi... Av én og én, det gir en ener ut. Hvis jeg sender en null inn i en annen port, så får jeg null ut. Sender jeg to nuller, så får jeg også en null. Uansett, hvis jeg har en null inn i en annen port, så kommer det null ut. Det er kun hvis det er to enere at jeg får ut en ener. Så på denne måten så... Så kan man da bygge kretser, og så kan man teste det. Jo, des... Det som dere skal gjøre i oppgavene, det er vel å legge inn... Skal vi se om jeg får til det. Legge inn makroer. Skal vi se. Sånn, ja. Da trykker jeg på en bed makro her oppe. Det betyr legge inn en liten boks. I oppgaveteksten står det at dere skal legge inn en fulladder, f.eks. Det var den som vi bygde. Da har jeg lastet ned den til desktopen her, sånn at den har fulladder her. Og så legger jeg inn der. Og da ser vi... Da får vi en liten boks som er kodet inn med akkurat den logikken som vi så på. Med de metodene her, altså hvis dere ønsker å ha input til sett, så kan dere legge på en liten boks her, en null sånn, og så lage en wire herfra dit. Og så fortsette sånn. Da kan dere lage kretser. F.eks. skal dere sette sammen to sånne, for å kunne legge sammen to tall. Dette er da teknikken man bruker for å gjøre det. Da kan man også se... Hvis jeg peker på den og høyre klikker,", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0033", "start": 5119.96, "end": 5298.9, "token_count": 595, "text": "Med de metodene her, altså hvis dere ønsker å ha input til sett, så kan dere legge på en liten boks her, en null sånn, og så lage en wire herfra dit. Og så fortsette sånn. Da kan dere lage kretser. F.eks. skal dere sette sammen to sånne, for å kunne legge sammen to tall. Dette er da teknikken man bruker for å gjøre det. Da kan man også se... Hvis jeg peker på den og høyre klikker, så kan jeg se inne i boksen og se hva det er som foregår her. Og da ser vi. Dette er hele logikken i boksen. XYZ. Dette ser jo enklere ut enn det vi kom fram til, men her er det gjort noen enda mer smarte forenklinger. Og så bruker de noen også noen... Dette er vel en X-over-port. Vi bruker noen andre porter. Du kan uttrykke dette and or not. Det er en enda mer effektiv måte å gjøre det på. Dette er den mest effektive måten å kode en fullader på, med and-or og not-porter. Dvs. dette er en x-or, som igjen er and-og-or-porter. Dermed kan man lage dette med xi og z inn, og riktig c og s ut. Hovedpoenget er da... Da kan man ta... Legge inn flere sånne. Sånne makroer som dette her. Legge inn to og tre boksere av den typen. Og så sette det sammen og få en krets som da legger sammen tall med både to og tre siffer. Sånn, ja. Man må klikke på kanvasen for å få ut det. Så kan jeg så... Det man da må gjøre etter hvert, er liksom ta wire... Mente derfra. Det skal jo opp i Z. Så kan man kable det på den måten der. Sette sammen boksene, og vips, så har man... En operasjon... En liten bit av en CPU, som er den biten som legger sammen tall. En hel datamaskin som er bygd på denne måten. Det var en oppgave vi hadde tidligere i Datamaskinarkitektur. Da bygde alle stuntene en hel datamaskin som opererer akkurat som en vanlig CPU, men som er simulert med hand-off-rapporter på denne måten. Oi, men nå ser vi at vi har gått langt over tiden, så jeg trenger i hvert fall dere.", "source": "lecture"}
{"lecture_id": "os2", "chunk_id": "os2_0034", "start": 5260.58, "end": 5636.3, "token_count": 470, "text": "En operasjon... En liten bit av en CPU, som er den biten som legger sammen tall. En hel datamaskin som er bygd på denne måten. Det var en oppgave vi hadde tidligere i Datamaskinarkitektur. Da bygde alle stuntene en hel datamaskin som opererer akkurat som en vanlig CPU, men som er simulert med hand-off-rapporter på denne måten. Oi, men nå ser vi at vi har gått langt over tiden, så jeg trenger i hvert fall dere. En pause? Ikke en pause, men... Jo, en pause, for vi skal ha lab etterpå. Så som vanlig så lager vi noen sånne... Hva het... Hva kaltes de rommene, Ine? Hjelp meg. Breakout rooms. Yes. Vi lager noen breakout rooms. Og så kan dere gå inn der og stille spørsmål. Sånn én til én. Dere kan også stille spørsmål i chatten, for jeg holder dette rommet oppe ut dagen. Eller iallfall til klokka to. Så ikke nøl med å spørre om hjelp hvis dere står fast. Men da tar i hvert fall jeg en liten pause der. Nei, ok. Men jeg kan opprette det. Ja, det er litt... Kanskje det er noen andre innstillinger enn fra i fjor. Ja, jeg kan se på det senere. Men jeg opprettet det. Yes. Da slutter vi der. Still spørsmål i chatten og vær aktiv i BreakOutRules. Å... Hei! Jeg heter Ash. Jeg er 40 år og jeg er 40 år gammel. Takk! Det er vanskelig å forstå hvordan det er å være døv på skolen. Hvordan var det å få til det? Hvordan var det å få til det? Hvordan var det å få til det? Hvordan var det å få til det? Det er vanskelig å forstå hvordan det er å være gravid.", "source": "lecture"}
