{"lecture_id": "os2del18", "chunk_id": "os2del18_0000", "start": 0.0, "end": 179.8, "token_count": 585, "text": "Eller til en liten boks, en liten komponent, som kalles en full adder. En full adder gjør nøyaktig den operasjonen vi så på, ved å legge sammen de sifferne her, sette mente, og så får den ut ett siffer som summen, og én carry. Eller en mente som da går videre til neste operasjon. Og det som er flott nå, Når du har fått laget en liten boks som gjør dette her, så kan man sette sammen flere sånne bokser for å utføre regneoperasjoner. Da setter man sammen to sånne fulladere. Og da ser vi... Den første fulladeren her... Her kommer x0 inn og y0 inn. Og i det første leddet så er det jo alt drenomentet. Så den er null. Og så vet vi... Vi har konstruert denne boksen sånn at her kommer riktig S0 ut, og så kommer riktig C ut her nede, som er mente som skal sendes videre til neste operasjon. Så da utfører vi den operasjonen her med X0 pluss Y0 lik S0 og mente. Så sender vi mente videre til neste boks, og så utføres X1 pluss Y1 pluss mente blir S1. Det ble første summen. Og så den carrien går. Dermed har vi på magisk vis lagd en liten boks som kan legge sammen tobitstall. Det er kanskje ikke noe å rope hurra over, men vi kan jo se at dette kan vi ta videre. Vi kan... Hvis vi ønsker å legge sammen trebitstall, så bare legger vi på en fullader til. Det tredje bittet i begge de tallene, de skal da inn i denne boksen. Og så ser vi at vi får en operasjon hvor vi utfører den algoritmen som vi lærte på skolen da vi skulle legge sammen tall. Den utføres nå ved hjelp av bitt inne i CPU-en. Tallene strømmer bortover her, og til slutt så kommer svaret ut. Så det denne kretsen her gjør, er å legge sammen disse to tallene. Det kan være f.eks. 101 pluss 001. To binære tall. Og så får vi et starry til den andre. Så på denne måten så kan man da lage enhver logisk ønsket operasjon, kan man konstruere på denne måten. Man setter opp sanestabellen.", "source": "lecture"}
{"lecture_id": "os2del18", "chunk_id": "os2del18_0001", "start": 135.3, "end": 209.0, "token_count": 226, "text": "Den utføres nå ved hjelp av bitt inne i CPU-en. Tallene strømmer bortover her, og til slutt så kommer svaret ut. Så det denne kretsen her gjør, er å legge sammen disse to tallene. Det kan være f.eks. 101 pluss 001. To binære tall. Og så får vi et starry til den andre. Så på denne måten så kan man da lage enhver logisk ønsket operasjon, kan man konstruere på denne måten. Man setter opp sanestabellen. Skriver ned det logiske bolske uttrykket og forenkler. Og så lager man kretsen. Og i SPU vil man hele tiden lage denne typen av små operasjoner, og så setter man de sammen til større operasjoner. Sånn som dette her, som kan da... Med 64 sånne fulleidere så kan man legge sammen 64-bitstall.", "source": "lecture"}
