{"lecture_id": "os2del2", "chunk_id": "os2del2_0000", "start": 0.0, "end": 193.62, "token_count": 589, "text": "OK. Før jeg begynner på selve slidene, så tenkte jeg å prøve å hoppe til slutten for å se på hva vi egentlig ønsker å... Hva jeg egentlig ønsker å fortelle dere i dag. Og slutten er dette her som vi skal komme fram til i løpet av dagen. Som vi skal bruke en del tid på. For dette gir på en måte... Og hvordan den er bygd opp fra enkle, logiske enheter. Det vi skal komme frem til i dag, som vi skal jobbe videre med fra neste gang for å lage en hel CPU, det er å få til å forstå hvordan en krets kan lage, gjøre en eller annen. Den spesielle logiske operasjonen vi ser på her, er hvordan kan en CPU legge sammen to tall. Det er på en måte lett å tenke seg at hvis en CPU kan legge sammen to tall, så kan du få til alle andre mulige logiske operasjoner også. Å legge sammen tall er en ganske kompleks logisk operasjon, som man ikke uten videre gjør. Men hvis vi får til dette her, så kan vi bygge videre. Lage gange og subtraksjon og sammenligning og alt mulig annet. På tilsvarende måte. Det vi skal se på i dag, er å logisk, men også praktisk, vise hvordan man kan lage innmaten i denne boksen her. Som er en slags trolldomsboks. Hvis man putter inn binære tall på toppen, A og B, så kommer svaret ut som A pluss B. Og da må man starte med nulleregnere. Og på en eller annen måte så må man da få lagret dette. Og det er temaet for neste gang. Da skal vi se på registeret, hvordan man lager bits inne i ICPU. Si OK, jeg vil legge sammen A pluss B. Hva blir det? Men det vi ser på nå, er hvordan kan man da kable dette her sammen på en sånn måte at uansett hva du putter inn for AB, så kommer summen C ut i den andre enden. Og det er ikke noen enkel oppgave. Hvis du fikk den oppgaven og aldri hadde hørt om transistorer og and or not, så vil det... Det har vært en relativt vanskelig oppgave. Men det går an å helt logisk bare sette opp dette her, og systematisk lage denne innhatten her med Andor & Not-porter.", "source": "lecture"}
{"lecture_id": "os2del2", "chunk_id": "os2del2_0001", "start": 154.92, "end": 236.98, "token_count": 294, "text": "Men det vi ser på nå, er hvordan kan man da kable dette her sammen på en sånn måte at uansett hva du putter inn for AB, så kommer summen C ut i den andre enden. Og det er ikke noen enkel oppgave. Hvis du fikk den oppgaven og aldri hadde hørt om transistorer og and or not, så vil det... Det har vært en relativt vanskelig oppgave. Men det går an å helt logisk bare sette opp dette her, og systematisk lage denne innhatten her med Andor & Not-porter. Og når man har gjort det, så kan man... I dag så kan man sende inn det til en produsent av halvlederbrikker. Og så kan man få brent dette inn i hardware. Man kan sette opp denne logikken med Andorra night porter, og så kan man brenne det hardware, og så får man ut i andre enden en dataskip som gjør akkurat det man ønsker. Det er i bunn og grunn det en CPU er. Så det vi skal se på i detalj i dag, er hvordan kan man logisk sett, eller i praksis, få til dette og lage en vilkårlig krets som gjør en hopp.", "source": "lecture"}
