{"lecture_id": "os2del15", "chunk_id": "os2del15_0000", "start": 0.0, "end": 154.94, "token_count": 594, "text": "OK. Vi startet ut med at vi ønsket å lage en krets som utfører binær addisjon mellom to binære tall. Og det vi må gjøre da, er at vi må... implementere denne algoritmen for å legge sammen binært. Det må vi implementere med logiske funksjoner. Etter det kan vi tegne en krets som utfører det vi ønsker. Da må vi først se på hvordan virker binær adhesjon. Den virker nøyaktig som, om dere ikke har gjort dette før, så er metoden nøyaktig sånn som når man legger sammen desimaltall. Med mente osv. Vi kan se på hvordan vi legger sammen to tall her. Dette er 01 pluss 11. 01 er jo tallet 1. Det er en null toere og en ener. Og så legger man til en toer og en ener, som er tallet tre. Da kan man gjøre det ved å rett og slett... Man starter her med én pluss én. Én pluss én er jo to, men binært så er én pluss én én null. Så vi får da én null, og null er det siste sifferet, så det skrives ned her. Og så kommer det én i mente opp hit. Og så gjør man akkurat samme operasjonen på neste to siffer. Da er det en ener der, en null der og en ener der. Så det blir igjen 1 pluss 1 er 2, og 2 er 1,0. Så da kommer det en mente opp hit, og så kommer denne eneren ned hit. Og så får man svaret 1,00. Og 1,00, det er da 4. Så det vi har gjort nå, er å regne ut 1 pluss 3 er lik 4. Tilsvarende algoritme kan man da bruke på appen. Absolutt alle binære addisjoner. Om du har 64-bit, så kjører du da denne algoritmen, den med mente, 64 ganger. Og så får du ut svaret. Og det vi skal se på nå, er da... Ja, men hva om vi kan lage en krets som gjør akkurat denne operasjonen her? Ta mente og de to sifferne, og så får du ut et svar og et mente. Og det er akkurat det man gjør. Man lager 64. Så setter man sammen de 64 kretsene, og vips så har du en aderi", "source": "lecture"}
{"lecture_id": "os2del15", "chunk_id": "os2del15_0001", "start": 126.7, "end": 159.14, "token_count": 143, "text": "Om du har 64-bit, så kjører du da denne algoritmen, den med mente, 64 ganger. Og så får du ut svaret. Og det vi skal se på nå, er da... Ja, men hva om vi kan lage en krets som gjør akkurat denne operasjonen her? Ta mente og de to sifferne, og så får du ut et svar og et mente. Og det er akkurat det man gjør. Man lager 64. Så setter man sammen de 64 kretsene, og vips så har du en aderi som kan legge sammen 64-bitstall.", "source": "lecture"}
