{"lecture_id": "os2del1", "chunk_id": "os2del1_0000", "start": 0.0, "end": 185.9, "token_count": 579, "text": "Sånn. Og da ser vi... Vi er nå i uke to, tirsdag 12. Og det vi skal snakke om i dag, er transistorer, porter og en krets som av dere er tall. Så når dere ser her hvor det står F, så er det forelesninger, sånn som nå, live. Mens for det andre temaet denne uken... Hver uke er det første tema. Og det andre er mer hands on, praktisk. Mye i starten er Linux og Kommandoer. Her står den D for digital, så her er det digitale forelesninger som er spilt inn på forhånd. Den digitale forelesningen fra forrige uke, som jeg la ut stort sett på onsdag, Temaet derfra er det oppgaver om denne uken. Som dere ser, så har jeg også lagt ut oppgaver til uke tre. Så de som ligger litt foran, de kan se på det nye temaet fra onsdag 13.11, med Linux filsystemer osv., og gjøre oppgaver fra uke tre. Og da kommer jeg til å legge ut noen tilsvarende opptak hvor jeg diskuterer... ... ja, i løpet av denne halvdagen. Du kan bare se kjapt hvordan det ser ut. Hvis man går inn på de de-forelesningene, så er det notater der. Litt mer utfyllende enn slides. Og så har jeg da lagd noen små demoer... F.eks. av hvordan man flytter seg ut i Linux' kildesystem. Sånn er tanken, at dere skal kunne gå inn og se på det dere ønsker. Det som er fint med at dere har alt direkte, alt er jo... Det kan bli mye frihetsgrader, men da har dere mulighet til å jobbe litt sånn som dere selv syns er best. Se gjennom alt på en gang, eller så kan dere begynne å jobbe med oppgavene. Hvis alt går greit, så går det greit. Spesielt i den praktiske delen er det snakk om å få det inn i fingrene og øve på det og få det til. Du må ikke se alle videoene for å få det til. En måte å jobbe på kan være å prøve å jobbe med oppgavene. Hvis dere står fast, så kan dere gå inn og se en video eller lese en slide. Les dere opp på akkurat det, og så gå tilbake til oppgavene.", "source": "lecture"}
{"lecture_id": "os2del1", "chunk_id": "os2del1_0001", "start": 156.94, "end": 252.68, "token_count": 339, "text": "Hvis alt går greit, så går det greit. Spesielt i den praktiske delen er det snakk om å få det inn i fingrene og øve på det og få det til. Du må ikke se alle videoene for å få det til. En måte å jobbe på kan være å prøve å jobbe med oppgavene. Hvis dere står fast, så kan dere gå inn og se en video eller lese en slide. Les dere opp på akkurat det, og så gå tilbake til oppgavene. Så vil dere også se... Jo, på denne... Nei, litt frem og tilbake her. På den digitale forelesningen så ser vi også at jeg har... Siste demon her er litt om oppgavene til denne uken, altså i uke to. Da kan det være lurt å prøve på oppgaven først, hvis dere står fast og ikke skjønner helt hva jeg mener. Så kan dere prøve å gå inn der og se på en mer detaljert forklaring. Ja, det er én kommentar om at det er gode videoer, og det er jo kjempebra. Takk for den tilbakemeldingen. Og kom gjerne med andre tips. Gi tilbakemeldinger også hvis det er noe som mangler eller noe dere ikke forstår eller et eller annet med videoene som ikke er bra, lyd, bilde, hva som helst. Så gi tilbakemelding.", "source": "lecture"}
