{"lecture_id": "os2del5", "chunk_id": "os2del5_0000", "start": 0.0, "end": 178.96, "token_count": 592, "text": "Så kommer hele poenget. Hvordan kan man bygge logiske porter ved hjelp av transistor? Som vi så på tidligere, så kan alle logiske operasjoner, de kan utføres hvis man har and or or not-porter. Så hvis vi kan bygge dem med de transistorene, så kan vi bygge hva som helst. Her ser vi et eksempel på hvordan man kan bygge en notport av to NMOS- og PMOS-transistorer. Det sitter en PMOS her. PMOS var den med en liten runding på. Og så sitter det en NMOS her nede. Her ser vi hele koblingsskjemaet. En notport, det vet vi har en sannhetstabell som dette her. Hvis det kommer en spenning null inn, så skal det komme spenning én ut. Det kan vi se at vi får til med disse transistorene. Hvis det kommer null her, hva skjer da? Da sendes det null spenning opp her til denne P-mossen her oppe. Da vil den virke. Den vil skru på bryteren. Og dermed kommer det en positiv spenning ut her. Samtidig, når det kommer en null inn her i NMOS-transistoren her nede, så vil den stenge. Altså den stenger av denne her. Så hvis den ikke stengte av den, så ville det bli en spenningsforskjell, og det ville gå strøm gjennom. Og det er akkurat de spenningsforskjellene som man unngår, Når man bruker to transistorer, så gjør man at det momentant skifter. Hvis man bytter om fra 0 til 1 her, så skifter det momentant om fra 1 til 0. Og det går veldig lite strøm i kretsen. Og så tilsvarende, hvis vi nå switcher, og så setter på en spenning her. Så ser vi, der vil det gå en ener ned hit. Denne vil åpnes. Skru på den bryteren. Og du får en positiv spenning ut her. Tilsvarende en ener inn her vil lukke denne transistoren. Sånn at du ikke går strøm ut hit. Uansett så har vi nå laget en port som er sånn at... Kommer det null spenning inn, så går det én positiv spenning ut. Kommer det positiv spenning inn, så kommer det null spenning ut.", "source": "lecture"}
{"lecture_id": "os2del5", "chunk_id": "os2del5_0001", "start": 136.84, "end": 306.02, "token_count": 550, "text": "Og så tilsvarende, hvis vi nå switcher, og så setter på en spenning her. Så ser vi, der vil det gå en ener ned hit. Denne vil åpnes. Skru på den bryteren. Og du får en positiv spenning ut her. Tilsvarende en ener inn her vil lukke denne transistoren. Sånn at du ikke går strøm ut hit. Uansett så har vi nå laget en port som er sånn at... Kommer det null spenning inn, så går det én positiv spenning ut. Kommer det positiv spenning inn, så kommer det null spenning ut. Og dette er den aller minste byggescenen i en datamaskin. Ved hjelp av sånne brytere så kan man da bygge hva som helst. Det vil si, man kan ikke bygge hva som helst med en nattport. Man trenger også or og and. Og or og and er litt mer kompliserte. Begge to trenger... Da trenger man seks transistorer for å lage den riktige logikken. Her blir det litt mer infløkt. Men hvis man setter seg ned og ser på dette, så er det ganske enkelt å overbevise om alle mulighetene. A og B skal da være 0, 0, 0, 1, 0 og 1, 1. Så kan man se på hver av de. B er 0. Da stenges denne bryteren. Og hvis A er 1, så åpnes denne, osv. Og så kan man finne ut at den virker akkurat som den skal. Hvis det kommer 0-0 inn her, så kommer det 0 ut der. Hvis det kommer 0-1, hvis én av disse er 1, så vil det alltid komme én ut her som resultatet ku. Så ser vi da, med seks transistorer, så kan vi da bygge en sånn or-port fysisk. Og den blir da brent inn... Man lager transistorene, og så brenner man dette inn i små kretskort. Og så får man ut akkurat det man ønsker. Tilsvarende har man for ran-porten. At man får dens virkemåte ved å sette sammen... Som da gir en annen port.", "source": "lecture"}
