{"lecture_id": "os2del4", "chunk_id": "os2del4_0000", "start": 0.0, "end": 200.36, "token_count": 590, "text": "CMOS skal se litt om teknologien, men vi skal ikke gå så nøye inn på det. Vi skal se mer på logikken. Men CMOS er en halvlederteknologi. Og er den som er brukt i så å si alt som er av halvledere. Og den består av to typer transistorer. NMOS og PMOS. Ja, og den forskjellen på de er at den ene har hull, og den andre har altså positive hull, og den andre har elektroner. Men som sagt, vi skal ikke gå inn i tekniske detaljer her, vi skal se mer på logikken. Og logikken er ganske enkel. Dette er en NMOS-transistor. Og den har en sannhetstabell som vi ser her, som er ganske enkel. Den er sånn at her står det X. Og så ser vi her streker her. Dette er ledninger. Hvis jeg ser 10 nanometer teknologi, så er disse ledningene av den størrelsesorden. Så det er bare noen atomer, noen silisium... I dette tilfellet er det kobberledninger, så det er bare noen kobberatomers bredde på disse ledningene. Så er det inni her som halvlederen ligger. Her er silisium. Som er lagd på en sånn måte at hvis det er en spenning... Vi kan starte med den første. Hvis det er null her, betyr det at det er null spenning. Det kommer strøm inn på toppen, og strøm ut i bunnen her. Hvis du har spenning null inn, så er den bryteren av. Da er det ingen kobling mellom toppen og bunnen. Men hvis du setter på en spenning, f.eks. 5 volt inn her, over den transistoren, så skrur man på denne bryteren. En transistor er egentlig bare en bryter. Da går det strøm igjen. Det er egentlig hele greia. Med den type brytere kan man bygge CPU-er som gjør akkurat den logikken man ønsker. Men hvordan, det skal vi se på i detalj. Pemos er broren til NMOS. Bortsett fra at den virker helt motsatt. Logisk sett så hadde man ikke trengt å ha denne. Det er mer av ingeniørmessige årsaker. Man får mye mindre effekttap med denne måten å gjøre det på, å bygge logiske porter av PMOS og NMOS.", "source": "lecture"}
{"lecture_id": "os2del4", "chunk_id": "os2del4_0001", "start": 150.0, "end": 218.12, "token_count": 215, "text": "Da går det strøm igjen. Det er egentlig hele greia. Med den type brytere kan man bygge CPU-er som gjør akkurat den logikken man ønsker. Men hvordan, det skal vi se på i detalj. Pemos er broren til NMOS. Bortsett fra at den virker helt motsatt. Logisk sett så hadde man ikke trengt å ha denne. Det er mer av ingeniørmessige årsaker. Man får mye mindre effekttap med denne måten å gjøre det på, å bygge logiske porter av PMOS og NMOS. Men iallfall, en PMOS-transistor, den virker på en motsatt måte. Hvis det kommer null inn her, null spenning, så er... Da går det strøm igjennom. Hvis det kommer en ener inn, så er den av. Så den virker helt motsatt av en Moss.", "source": "lecture"}
