{"lecture_id": "os2del20", "chunk_id": "os2del20_0000", "start": 0.0, "end": 200.84, "token_count": 596, "text": "Sånn. Her er den virtuelle Windows-maskinen. Og så har jeg lastet ned det verktøyet som... Det sto vel en link i forrige ukes oppgaver. Så kan jeg kjøre det. Den sier no default printer. Det er OK. Men sånn ser dette verktøyet ut. Men det funker som det skal. Så dere får noen oppgaver denne uken, hvor dere skal laste ned noen komponenter og sette det sammen. Men helt til slutt i dag kan jeg vise noen enkle ting, hvordan man bruker det. Dette er en And-gate. Hvis man klikker på den, og så klikker uti kanalen her, så ser du at du får opp en port. Og så blir dere bedt om å gjøre noen oppgaver hvor dere skal sette sammen sånne porter. I dette verktøyet kan man logisk sette sammen porter, sånn at de virker sånn som de vil virke. Og lager det med halvledere. Så da er det noen sånne input man trenger. F.eks. her oppe står det en interaktiv input. Så hvis jeg klikker på den og plasserer den ut her... Dette er en bryter som kan skrus på som null og én. Og så ønsker jeg deg å putte den inn i en an-port. Og da er det en liten blyant oppi hjørnet her, wiring tool. For å koble sammen inputen der til add-porten. Og da venstreklikker jeg sånn, så har jeg koblet de to sammen. Så kan jeg gjøre det tilsvarende. Jeg ønsker å ha en input til. Da gjør jeg tilsvarende. Hvis man er litt forsiktig, så får man rette og fine linjer. Litt skjev. Sånn. Da har jeg to input. Og så ønsker jeg å se hva som blir output her. Her oppe har jeg et lite leddlys. Rødt, det kan vi tenke oss at betyr én. Mens hvitt eller ingenting, det er null. Og nå har jeg lagd en liten krets. Og så... I utgangspunktet så... Så kan vi prøve å kjøre den kretsen. Og da, for å kjøre kretsen, så trenger jeg å bruke den hånden der, altså peke. For det jeg kan gjøre da, er at jeg kan skru på en ener. Da ser vi det kommer en ener inn i anden, og nå setter jeg på en ener til.", "source": "lecture"}
{"lecture_id": "os2del20", "chunk_id": "os2del20_0001", "start": 166.28, "end": 347.12, "token_count": 593, "text": "Mens hvitt eller ingenting, det er null. Og nå har jeg lagd en liten krets. Og så... I utgangspunktet så... Så kan vi prøve å kjøre den kretsen. Og da, for å kjøre kretsen, så trenger jeg å bruke den hånden der, altså peke. For det jeg kan gjøre da, er at jeg kan skru på en ener. Da ser vi det kommer en ener inn i anden, og nå setter jeg på en ener til. Så kommer det to ener. Da burde det jo komme en null ut, men da må vi først kjøre kretsen. Du ser her. Hvis vi trykker på run nå, så begynner kretsen å kjøre. Da virker kretsen, og da ser vi at av én og én, det gir en ener ut. Så hvis jeg nå skrur av... Hvis jeg sender null inn i en annen port, så får jeg null ut. Hvis jeg sender to nuller, så får jeg også en null. Uansett, hvis jeg har en null inn i en annen port, så kommer det null ut. Så på denne måten så... Så kan man da bygge kretser, og så kan man teste det. Og det som... Jo, dets... Det som dere skal gjøre i oppgavene, det er vel å legge inn... Skal vi se om jeg får til det. Legge inn makroer. Skal vi se. Sånn, ja. Nå trykker jeg på en bed makro her oppe. Det betyr legge inn en liten boks. I oppgaveteksten står det at dere skal legge inn en full lader, f.eks. Det var den som vi bygde. Da har jeg lastet ned den til desktopen her. Sånn at jeg har full lader her. Og da ser vi... Da får vi en liten boks som er kodet inn med akkurat den logikken som vi så på. Og nå kan dere med de metodene her... Altså hvis dere ønsker å ha input til sett, så kan dere legge på en liten boks her, en null sånn, og så lage en wire herfra dit. Og så fortsette sånn. Da kan dere... F.eks. skal dere sette sammen to sånne, for å kunne legge sammen to tall. Dette er da teknikken man bruker for å gjøre det. Hvis jeg peker på den og høyre-klikker, så kan jeg se inne i boksen", "source": "lecture"}
{"lecture_id": "os2del20", "chunk_id": "os2del20_0002", "start": 314.96, "end": 485.98, "token_count": 540, "text": "Altså hvis dere ønsker å ha input til sett, så kan dere legge på en liten boks her, en null sånn, og så lage en wire herfra dit. Og så fortsette sånn. Da kan dere... F.eks. skal dere sette sammen to sånne, for å kunne legge sammen to tall. Dette er da teknikken man bruker for å gjøre det. Hvis jeg peker på den og høyre-klikker, så kan jeg se inne i boksen og se hva det er som foregår her. Da ser vi... Dette er hele logikken i boksen. X, Y, Z. Dette ser jo enklere ut enn det vi... Men her er det gjort noen enda mer smarte forenklinger. Dette er vel en exor-port. Vi bruker noen andre porter. Du kan uttrykke dette hver and or og not, men dette er en enda mer effektiv måte. Dette er den mest effektive måten å kode en fullader på, med and or og not-porter. Dvs. dette er en exor, som igjen er and or-porter. Dermed kan man lage dette med X, Y og Z inn, og riktig C og S ut. Og hovedpoenget er da... Da kan man legge inn flere sånne. Sånne makroer som dette her. Legge inn to og tre boksere av den typen. Og så sette det sammen og få en krets som da legger sammen... Sånn, ja. Man må klikke på kanvasen for å få ut det. Det man da må gjøre etter hvert, er liksom ta wire mente derfra. Det skal jo opp i Z. Så kan man kable det på den måten der. Sette sammen boksene, og vips, så har man settes sammen. En operasjon, en liten bit av NCPU, som er den biten som legger sammen tall. Det vi skal se på senere, er en hel datamaskin som er bygd på denne måten her. Det var en oppgave vi hadde tidligere i datamaskinarkitektur. Da bygde alle stuntene en hel datamaskin som opererer i prinsippet akkurat som en datamaskin. Men som er simulert med and or-rapporter på denne matten.", "source": "lecture"}
