{"lecture_id": "os2del8", "chunk_id": "os2del8_0000", "start": 0.0, "end": 208.44, "token_count": 597, "text": "Sannhetstabell er viktig for det vi skal jobbe med. En sannhetstabell er en tabell som sier nøyaktig hvordan en logisk funksjon er. Denne skal vi bruke når vi f.eks. skal legge sammen tall. Så har vi noen ideer om hvordan skal A-ne og B-ene kobles sammen. Hva skal vi ha ut? Denne FAB-en her er bare et eksempel. Det er et eksempel på en logisk funksjon. Da er det rett og slett spesifisert på den måten at man setter opp alle mulige verdier for A og B, og så må man spesifisere i hvert tilfelle hva den funksjonen skal bli. F.eks. hvis A er lik 0 og B er lik 0, altså ikke kommer spenning inn på noen av portene, da skal det være en positiv spenning ut. Og tilsvarende for de andre linjene. Logisk uttrykk... Så det vi som regel gjør, er at vi vet... Vi vet hva vi ønsker å få til, hva vi ønsker å skape med den logiske kretsen vår. Men så trenger vi å kunne tegne det med and or not-porter. Det er her de logiske uttrykkene kommer inn. Gitt en sannhetsstabell... Vi ser nå på to variabler, men vi kan også ha mange... Da kan man helt tilsvarende sette opp sandnesstabeller. Med fire variabler blir det 16 forskjellige linjer i sandnesstabellen. Med to så blir det fire linjer. Men uansett så kan man på samme måte ut ifra sandnesstabellen, så kan man skrive ned et logisk uttrykk. Det er en systematisk måte å gjøre det på. Det man gjør... Den teknikken man bruker for å få til det, er at man ser på at et sånt som et produkt A ganger B... Det vil kun være lik 1 hvis både A og B er like 1. I alle andre tilfeller så vil det produktet være lik 0. Så hvis man da tar en... Så plukker man ut alle linjene i sannhetstabellen som skal være 1. Og så... Og så lager man det produktet, det logiske produktet, som er sånn at det blir lik én i dette tilfellet. Det blir litt teoretisk, men vi kan se på f.eks. den... Skal vi se hvilket eksempel bruker jeg her. Jo, den første.", "source": "lecture"}
{"lecture_id": "os2del8", "chunk_id": "os2del8_0001", "start": 165.68, "end": 336.92, "token_count": 600, "text": "I alle andre tilfeller så vil det produktet være lik 0. Så hvis man da tar en... Så plukker man ut alle linjene i sannhetstabellen som skal være 1. Og så... Og så lager man det produktet, det logiske produktet, som er sånn at det blir lik én i dette tilfellet. Det blir litt teoretisk, men vi kan se på f.eks. den... Skal vi se hvilket eksempel bruker jeg her. Jo, den første. I dette tilfellet så er det to ledd i sandelstabellen som er igjen. Og da tar vi det hvis A og B skal bli lik 1, altså hvis A ganger B skal bli lik 1. Da må vi gange sammen ikke A, gange ikke B. Altså vi setter en not på A og en not på B. Da får vi 1, og da får vi ut produktet 1. Så det vi da må gjøre, er å ha med dette leddet. Det er det første leddet man må ha med. I den summen som skal utgjøre hele det logiske uttrykket. Hvis du har med dette leddet her, så er du sikker på at det leddet... Hvis A er 0 og B er 0, så blir dette leddet 1. I alle andre tilfeller så blir det 0. Det smarte da er at da kan man starte med dette leddet, og så kan man legge til eller ta med en pluss eller en logisk li. Man tar med pluss og legger til alle de andre leddene i Sandnes-stabellen som skal bli 1. I vårt tilfelle er det bare ett annet ledd som skal bli 1. Det er dette leddet her. Og for å få med et produkt som alltid gir 1, så må dette bare være A ganger B. A ganger B er alltid 1 hvis A og B er 1. I alle andre tilfeller blir det 0. Så hvis vi legger til A ganger B til dette leddet her, så vil vi få... Som vi ser her nede, så får vi dette uttrykket, som da er hele det logiske uttrykket for hele denne sannhetsstabellen. Så dette oppsummerer hva vi gjør. Vi skriver ned tilsvarende uttrykk for alle linjer som gir 1 i sannhetsstabellen. I vårt tilfelle så var det to sånne. Og så, til slutt, så legger vi sammen alle disse med o-er.", "source": "lecture"}
{"lecture_id": "os2del8", "chunk_id": "os2del8_0002", "start": 300.0, "end": 408.82, "token_count": 384, "text": "Så hvis vi legger til A ganger B til dette leddet her, så vil vi få... Som vi ser her nede, så får vi dette uttrykket, som da er hele det logiske uttrykket for hele denne sannhetsstabellen. Så dette oppsummerer hva vi gjør. Vi skriver ned tilsvarende uttrykk for alle linjer som gir 1 i sannhetsstabellen. I vårt tilfelle så var det to sånne. Og så, til slutt, så legger vi sammen alle disse med o-er. Og da blir det riktig for at... Ikke sant, sånn som a ganger b? Det er bare hvis a liker 1 og b liker 1 at denne gir en logisk ener. I alle andre tilfeller så gir dette null. Men det å legge til null endrer ikke uttrykket. Hvis du har en variabel A pluss null, det gir A. Så det endrer ikke noe på uttrykket. Og dermed vil vi oppnå at denne logiske funksjonen her alltid er riktig. De detaljene her er ikke så ekstremt viktige, men det som er veldig viktig, det er, hvis vi går tilbake til sandelstabellen, at gitt en sandelstabell så kan vi bare Skrive ned, med de enkle reglene jeg viste til, et logisk uttrykk. Og det er det logiske uttrykket som vi trenger. For nå skal vi ta det logiske uttrykket og så skal vi tegne en krets. Og da er vi på en måte i mål.", "source": "lecture"}
