{"lecture_id": "os3bdel11", "chunk_id": "os3bdel11_0000", "start": 0.0, "end": 207.96, "token_count": 595, "text": "Og i oppgaven denne uken så blir dere bedt om å laste ned en maskin. Det er da hele maskinen. Det er denne maskinen. Og her ligger da... Her kan man gå inn og se... Velge Edith Makro, så kan man gå inn og se, OK, her har vi Alle-Hund. Så kan man bevege seg innover. Her er Alle-Hund, og her ser vi de fire fulleiderne. for bl.a. å kunne legge sammen. Det er en sånn Bionary Full Ladder som vi forrige gang konstruerte. Vi ser at dette er et stort byggverk hvor man hele tiden abstraherer lagerbokser. Dette er register file. Denne inneholder da registrene. R0, R1, R2, R3. Det er da de små registrene som vi har. Og dette er da logikken i registrene, men vi ser hovedbiten er vippene. Så her er det fire d-vipper som lagrer da fire-bit i fire-bitsregisteret. Helt til slutt skal jeg bare vise hvordan maskinen kjører. Hvis man tar høyreklikker og edit på den, så ser man det programmet. Dette er da maskinkode som viser det programmet som regner en fåløkke. Og så kan man trykke på rønn og kjøre. Alternativet som kanskje er bedre, er å trykke på step. Da tar man én instruksjon av gangen. Nå utførte jeg den første instruksjonen her. Så trykker jeg på steppe en gang til. Dvs. to ganger må man trykke, for klokka går av og så på. Og så utføres instruksjonen. Det som ble gjort nå, det var at én ble lagt i r1. Og så blir null lagt i r2, og null i r3. Det ser man ikke, men så adderer man. Man skal gjøre nå å ta R2 lik 0 pluss R1. Og da får man en ener i R2. Og så gjør man en test. Man øker R3 med én. Det er telleren. Og så sjekker man om den er lik R0. Nei, den er ikke lik R0, og det er jump not equal, så da hopper man opp hit. Det man gjør nå, er R2 lik R2 pluss telleren R3. Da får man to i R2. I telleren R2 så er det R3. Det er her summen ligger.", "source": "lecture"}
{"lecture_id": "os3bdel11", "chunk_id": "os3bdel11_0001", "start": 156.24, "end": 308.98, "token_count": 469, "text": "Og da får man en ener i R2. Og så gjør man en test. Man øker R3 med én. Det er telleren. Og så sjekker man om den er lik R0. Nei, den er ikke lik R0, og det er jump not equal, så da hopper man opp hit. Det man gjør nå, er R2 lik R2 pluss telleren R3. Da får man to i R2. I telleren R2 så er det R3. Det er her summen ligger. Er vi ferdig med løkka? Nei, det er vi ikke, så vi gjør det én gang til. Da skal vi til slutt ta... Telleren R2 blir nå 3, og så skal vi legge R3 lik R3 pluss R2. Da ser vi at vi får 6, som er sluttresultatet. Så når nå R2 sammenlignes med R0, så er den... Equal. Og da fortsetter den rett frem. Og da har vi kjørt hele programmet. Og så kan... Nå kjører jeg programmet bare hurtig gjennom. Og da, om og om igjen, så utføres hele den samme operasjonen ved at man legger sammen. Helt til slutt så kan... Det er en oppgave som går ut på at dere skal endre. Litt på koden. Det dere må gjøre da, er å klikke her. Og så kan man gå inn sånn, og så endre. Nå endret jeg verdi fra én til tre, og da vil programmet gjøre noe annet. Men etter at du har endret, så må du ikke bare trykke på OK. Du må endre først, og så trykke på neste. Og så kan programmet kjøre. Hvis dere endrer noe feil, og et eller annet galt skjer, så er det enkleste Det er bare å krasje hele maskinen, ta ned simuleringen og starte på nytt. For da starter de med et ferskt program.", "source": "lecture"}
