{"lecture_id": "os3bdel5", "chunk_id": "os3bdel5_0000", "start": 0.0, "end": 196.12, "token_count": 589, "text": "Von Neumann-arkitektur. Den aller vanligste datamaskinarkitekturen som brukes, ble definert av en matematiker som het John von Neumann. Han var virkelig et universalgeni og hadde... Sto bak veldig mye av konstruksjonen av en moderne datamaskin. Det vi har sett på nå, det er først og fremst aluen. Så dette er den sentrale beregningsenheten. I tillegg har vi registeret. Når man gjør beregninger, så kobler man registrene til input på aluen. Og så kommer man andre registeret til outputs, og så gjøres det beregninger. Og dette gjøres om og om igjen. Vi har en kontrollenhet som styrer alt dette. I tillegg så har man main memory, secondary memory, main memory, det er RAM, internminne. Og internminne går ut til en buss, en databuss, som sender data inn til kontrollenheten. Altså kommer data ut igjen til RAM. Og det som er spesielt med von Neumann-arkitektur, er at her i RAM så ligger De institusjonene som kontrollerer hva som skal gjøres. Og i tillegg så ligger data. Det er typisk variabler. Hvis du har en variabel i et program, så vil den variabelen lagres. Og så gjør du beregninger, og så lagrer du dataene i den variabelen. De ligger da i ramm, og da må hele tiden trafikken gå inn og ut til Søppel. Og det som er spesielt med von Neumann-arkitekturen, er at samme buss brukes til både instruksjoner og data. I den såkalte Harvard... Hva heter den? Hardford... Arkitekturen. Harvard. Universitetet Harvard. Arkitekturen. Så er det litt annerledes, for da er det to busser. Én buss som sender institusjoner, og en atskilt buss som sender data. I virkeligheten, i moderne arkitektur, så brukes egentlig en slags blanding. Der har man Cash, som vi skal se på senere. Og LNCash, det har to... Én for data og én for instruksjoner. Så det er en sannhet med modifikasjoner, at alle bruker von Neumann-arkitektur, men i hovedsak så ligner det på denne arkitekturen.", "source": "lecture"}
{"lecture_id": "os3bdel5", "chunk_id": "os3bdel5_0001", "start": 154.5, "end": 274.0, "token_count": 375, "text": "Én buss som sender institusjoner, og en atskilt buss som sender data. I virkeligheten, i moderne arkitektur, så brukes egentlig en slags blanding. Der har man Cash, som vi skal se på senere. Og LNCash, det har to... Én for data og én for instruksjoner. Så det er en sannhet med modifikasjoner, at alle bruker von Neumann-arkitektur, men i hovedsak så ligner det på denne arkitekturen. I tillegg så har man secondary memory, det er disk, og så har man en rekke forskjellige enheter som kommuniserer med dette. Men CPU og main memory er liksom hovedbiten som vi skal se på nå. De delene van Normann-arkitekturen består av, er som vi så på forrige figur, det er Ramm, så er det Alu, og så er det en kontrollenhet som henter inn instruksjoner fra Ramm. Så dekodes instruksjonene og sender signaler til Aluen, sånn at riktige operasjoner blir utført. Sånn at Alun gjør en ad i det ene tilfellet og en sammenligning i det andre osv. Så er det registeret som vi har slitt med i dag og lagd. Det er det et internlager som lagrer alle instruksjonene og lagrer alle dataene som kommer ut av Alun. I tillegg så har vi InputUpput, som... Og kommuniserer med utenverdenen.", "source": "lecture"}
