{"lecture_id": "os3bdel7", "chunk_id": "os3bdel7_0000", "start": 0.0, "end": 179.98, "token_count": 595, "text": "Da skal vi til slutt se litt på en simulering av en CPU. Dette skal dere studere i detalj. Og faktisk kjøre denne simuleringen i simuleringsmaskinen for Windows. Dette er arkitekturen til en komplett firepint CPU. Som kan utføre programmet skrevet i maskinkode. Og vi ser her... Ja... Her er datapath, og det er den som inneholder Alun og registeret. Det som er på høyre side her, er registeret. Fire biter i registeret. Så for eksempel R0 her, der står det egentlig 0010. Så det er tallet fire. Mens i R1 så står det tallet én. I tillegg har vi ram som er koblet til, sånn at man kan skrive ut resultater. Vi kommer ikke til å bruke den delen. Men det vi kommer til å bruke, er rom, som er her. Og inni her så ligger instruksjonene. Og instruksjonene, det er da maskinkode. Og etter hvert skal vi se, når vi komplerer høynivåkode, så får vi maskinkode. Og i vårt tilfelle så ligger den maskinkoden her i rom. Men her har vi ikke noen kompulator. Her må vi skrive maskinkode rett. Det en maskininstruksjon gjør, det er å styre alle kontrollbitene til Datapath, sånn at operasjonen som den ønsker å utføre, faktisk blir utført. Vi ser det er... Masse nuller og enere som går inn her og styrer disse bitene. Oppcode sier hvilken institusjon som skal utføres. Da kan vi f.eks. tenke oss at vi ønsker å ha dere to tall. Og da er institusjonsdekoderen, den jobben den gjør, er at den dekoder institusjonen sånn at den skrur på de riktige bryterne her. F.eks. S0 og S1, det styrer Alun. Hvis den er der, så må S0. Settes til de verdiene som gir en addisjon inne i Alun. Skal se på det i litt mer detalj etterpå. Her er vi inne i datapath. Her nede er Alun, som vi har konstruert tidligere i dag. Vi ser det er noen sånne mux-er, eller multiplex-ere. Og de er ganske enkelt et system for å velge hvilken kanal.", "source": "lecture"}
{"lecture_id": "os3bdel7", "chunk_id": "os3bdel7_0001", "start": 138.48, "end": 297.96, "token_count": 590, "text": "er at den dekoder institusjonen sånn at den skrur på de riktige bryterne her. F.eks. S0 og S1, det styrer Alun. Hvis den er der, så må S0. Settes til de verdiene som gir en addisjon inne i Alun. Skal se på det i litt mer detalj etterpå. Her er vi inne i datapath. Her nede er Alun, som vi har konstruert tidligere i dag. Vi ser det er noen sånne mux-er, eller multiplex-ere. Og de er ganske enkelt et system for å velge hvilken kanal. Man sender inn i aluen. Her er en mux som kommer inn i aluen. Den kan velge mellom å enten sende noe fra et register, eller å sende inn en konstant. Da kan man, hvis man velger... Nei, ikke å... Jo, enten fra registeret her, eller fra den konstanten her. Det velges ved det valgbyttet her. Det er noe av det instruksjonsdekoderne gjør, hvis det skal komme inn en konstant. Så må den kanskje skrus på én, sånn at konstanten kommer inn. Hvis du skal få noe fra et register, så må den settes til null, sånn at det som kommer fra A-bussen, kommer inn. Til syvende og sist så kommer det da to tall inn i A-lun. A og B. Og så ser vi det går ett resultat det ut. Og da ser vi at... Her igjen så kan... Det går ett resultat det ut. Man kan velge enten å ha data inn her, som da kommer fra ramm, eller så kan man ta resultatet fra Alu. Det vi har sett på tidligere i dag, er at man legger sammen to tall. Det foregår ved at man tar to registre, la oss si R0 og R1. Så kobles verdien av de ved hjelp av multiplexerne sånn at R0 går inn i A. R1 går inn i B. Og så setter man en viktig bit her for å addere. Og så kommer resultatet i D. Og så kobles denne multiplexeren, sånn at resultatet fra D sendes opp igjen i registerfilen. Og avhengig av instruksjonen man gjør, så kan man f.eks. velge å legge resultatet i R0. Det man utfører da, er R0 er lik R0 pluss R1. Og på denne måten så...", "source": "lecture"}
{"lecture_id": "os3bdel7", "chunk_id": "os3bdel7_0002", "start": 261.42, "end": 307.34, "token_count": 170, "text": "Så kobles verdien av de ved hjelp av multiplexerne sånn at R0 går inn i A. R1 går inn i B. Og så setter man en viktig bit her for å addere. Og så kommer resultatet i D. Og så kobles denne multiplexeren, sånn at resultatet fra D sendes opp igjen i registerfilen. Og avhengig av instruksjonen man gjør, så kan man f.eks. velge å legge resultatet i R0. Det man utfører da, er R0 er lik R0 pluss R1. Og på denne måten så... På denne måten så virker en datamaskin. Det er akkurat samme prinsippet i alle sider.", "source": "lecture"}
