{"lecture_id": "os3bdel6", "chunk_id": "os3bdel6_0000", "start": 0.0, "end": 199.76, "token_count": 597, "text": "Beregningsenheter. Her er det listet opp en rekke forskjellige beregningsenheter. Bare for å sette det vi har sett på i perspektiv. I dag har vi sett på aluen, som er CPU-ens hjerne. Og CPU, Central Processing Units, det er da den viktigste biten av en datamaskin, hvor all prosessering gjøres. Så har vi noen andre varianter. Vanligvis er det integrert i CPU, og det er egentlig bare en spesiell alu som også kan brukes i floating point. Da trenger man mer komplekse og kompliserte kretser som utfører det. Det tar typisk litt lengre tid å dele to floating points på hverandre i forhold til helt annet. Det trengs mye prosessorkraft, og mye gjøres i parallell. Så da har man typisk tusenvis av små aluer som gjør beregninger samtidig i parallell. Og alt dette sitter vanligvis i vanlige datamaskiner. Til slutt har Lisset et par andre FPGA, Field Programmable Gate Array. Hvis man har et logisk diagram, så kan man programmere det inn i en FBGA. Og det går veldig hurtig. Men det fine med den er at den brennes ikke engang for alle. Den kan da reprogrammeres. ASIC derimot, Application Specific Integrated Circuit, det er virkelig en integrert krets. Da tar du en logisk krets, så sender du den til en ASIC-fabrikk, og så lager du nøyaktig den. Det er da... Det er da ekstremt hurtig. Hvis du har fulgt med på sånn som bitcoin, hvor man da... Hvor man da bruker CPU-kraft for å regne ut og finne bitcoins, så starter man gjerne på... Men etter hvert gikk man over til GPU for å kunne gjøre dette raskere. Men nå går det for sakte med både CPU-er og GPU-er, så man gikk over til FPGA. Og helt til slutt så har man lagd ASIC, altså helt spesifikke integrerte kretser som regner ut bitcoins hurtigst mulig. Et spørsmål i chatten om man snakker om flere kjerner i en CPU. Er det da snakk om flere? Ja, det er et godt spørsmål. Ja, man har da... Man må da ha minst... Eller man har én alu per core. Så når vi snakker om flere course, så er det uavhengig regneenheter.", "source": "lecture"}
{"lecture_id": "os3bdel6", "chunk_id": "os3bdel6_0001", "start": 157.36, "end": 246.02, "token_count": 269, "text": "Men nå går det for sakte med både CPU-er og GPU-er, så man gikk over til FPGA. Og helt til slutt så har man lagd ASIC, altså helt spesifikke integrerte kretser som regner ut bitcoins hurtigst mulig. Et spørsmål i chatten om man snakker om flere kjerner i en CPU. Er det da snakk om flere? Ja, det er et godt spørsmål. Ja, man har da... Man må da ha minst... Eller man har én alu per core. Så når vi snakker om flere course, så er det uavhengig regneenheter. Men det hender det varierer litt. F.eks. så er det noen versjoner av IMD. Som har 40 course. Og da... Men da... I noen tilfeller har den 20 course som er hypertrening. Sånn at... Man har 40 alluer, men så har man bare 20 FPU-er. Så det varierer litt. Men stort sett så kan du bare si at... Hver kår er en alu, altså en uavhengig, rene enhet.", "source": "lecture"}
