{"lecture_id": "os3bdel8", "chunk_id": "os3bdel8_0000", "start": 0.0, "end": 193.08, "token_count": 590, "text": "Ja, da skal vi til slutt se på høynivåkode. For det til syvende og sist, når du skriver et program, så skriver du ikke maskinkode, men du skriver høynivåkode. Så det vi skal se litt på nå, er hvordan høynivåkode sånn som dette er... En liten forløkke som summerer. Den starter på I liker 1, så den går til... Når vi har en sånn høynivåkode, det vi ønsker at CPU-en skal utføre, det er de følgende tre operasjonene. Først starter vi med i lik 1. Summen er 0 pluss 1 er lik 1 osv. Så øker verdien i til 2. Så legger vi til den summen 3. Så til slutt får vi et tall av 6, som blir summen. I oppgavene senere i dag så skal du prøve å overbevise deg om at denne simuleringsmaskinen utfører nøyaktig dette. Så skal du etter hvert endre den lite grann, sånn at den løkka går til tre. Og da må du faktisk skrive maskinkode. Eller du må endre på maskinkoden for å få den til å gjøre nøyaktig dette her. Men for å virkelig se hva som skjer, så skal vi utføre dette selv. For å få til det, så trenger man å kjenne til instruksjonene for denne maskinen. Instruksjonssettet til maskinen, det utgjør arkitekturen, f.eks. X86-arkitekturen. Den har et gitt sett med instruksjoner. Det er fastlåst, for det er definert av arkitekturen. Og det brennes fast i kretskortene som utgjør Alu og CPU og alle delene. Da har man bare bestemt, sånn som jeg bestemte for denne maskinen her... F.eks. addisjon. Den skal ha binært nummer 0100. Det er altså da fire. Institusjon nummer fire. Det skal være en add-institusjon. Og den skal addere operand 1. Og den skal legge til operand 2.  Og det betyr at man da utfører DR erlik DR pluss SR. Og vi ser de fire første bitene der. Det er da de fire første bitene i institusjonen. Det definerer hvilken institusjon vi skal gjøre.", "source": "lecture"}
{"lecture_id": "os3bdel8", "chunk_id": "os3bdel8_0001", "start": 150.0, "end": 208.86, "token_count": 170, "text": "F.eks. addisjon. Den skal ha binært nummer 0100. Det er altså da fire. Institusjon nummer fire. Det skal være en add-institusjon. Og den skal addere operand 1. Og den skal legge til operand 2.  Og det betyr at man da utfører DR erlik DR pluss SR. Og vi ser de fire første bitene der. Det er da de fire første bitene i institusjonen. Det definerer hvilken institusjon vi skal gjøre. De neste fire bitene definerer operand 1 og operand 2. Og det kan variere ut fra hvilken institusjon det er, nøyaktig hva disse... Disse operandene gjør.", "source": "lecture"}
