{"lecture_id": "os3del10", "chunk_id": "os3del10_0000", "start": 0.0, "end": 190.56, "token_count": 597, "text": "Så skal vi prøve å bruke disse fire delåsene for å gjøre noe praktisk med det. For det oppstår faktisk fortsatt et problem. Selv etter at vi har lagd den fine devicen her, så har vi fortsatt et problem. Ja, og det er et litt mer komplekst problem. Men vi ser... Dette er måten man setter sammen biter på. Her ønsker jeg å lage et såkalt skiftregister, hvor vi har lagret 1-0-1-0. Og så ønsker vi at... Ved å skru på den bryteren her, så ønsker jeg å flytte alle bitene til høyre. Sånn at den nullen kommer inn her. Sånn at vi utfører da operasjonen ved å gå fra 1.01.0 til 0.101. Og denne operasjonen er faktisk da å dele på to, hvis man tenker på dette som et tall. Og denne konstitusjonen ser jo helt fin ut, fordi vi husker at q er det som lagres. Så hvis vi f.eks. ser på den siste enheten her, som har lagret en null, så ser vi at den leser en ener, verdien på... På den latchen, den låsen som står til venstre, det er en ener. Og den kommer inn som input på det. Og så lenge c er lik 1, så vil den da lese den verdien. På samme måte så vil denne her lese den nullen og få en null. Denne vil lese eneren og få en én. Denne leser null og får en null der. Og da vil det etterpå så vil det stå 0, 1, 0, 1. Og så kan vi da tenke oss at nøyaktig når vi har gjort det, så skrur vi av C, setter den til null, og dermed har vi utført den skiftoperasjonen. Men så er det et problem, og det som er problemet, er timing. Jeg sa at vi etter en stund så skrur vi av den eneren her. Men da er... Setter den til null. Men da er spørsmålet hvordan får vi riktig timing her? Hvordan får vi skrudd av den i rett tid? Og det er en del av problemet. Fordi at... Dette er jo fysiske komponenter. Så når man skrur på den eneren og får denne til å virke, så vil det ta bitte litt tid, kanskje i underkant av et nanosekund,", "source": "lecture"}
{"lecture_id": "os3del10", "chunk_id": "os3del10_0001", "start": 156.6, "end": 342.54, "token_count": 583, "text": "Jeg sa at vi etter en stund så skrur vi av den eneren her. Men da er... Setter den til null. Men da er spørsmålet hvordan får vi riktig timing her? Hvordan får vi skrudd av den i rett tid? Og det er en del av problemet. Fordi at... Dette er jo fysiske komponenter. Så når man skrur på den eneren og får denne til å virke, så vil det ta bitte litt tid, kanskje i underkant av et nanosekund, når disse komponentene er ekstremt små. Men likevel litt tid. Fra denne nullen propagerer... For det er jo strøm... Bitte små strømmer som strømmer. Propagerer sånn at den blir til en null. Og det tar litt tid. Og dermed så kan det være litt forskjell i hvor lang tid det tar. Og dette kan være enda større forskjeller hvis disse enhetene ikke er like. Da kan det virkelig være en avgjørende forskjell i tid på hvor lang tid det tar, før den strømmer herfra hit. Og med en gang det skjer, så får man et problem med at Denne leser jo en ener. Men hva om den nullen har propagert hit før den her har rukket å lese eneren? Da vil den jo lese null. Og hvis man har en liten usikkerhet i tiden her, så vil ikke dette her fungere. I tidligere år hvor vi hadde fysiske forelesninger, så prøvde jeg å... Ved at dere som studenter ble stilt opp i en rekke, sånn som dette. Med jenter og gutter. Jeg fant ingen gode studentillustrasjoner, så det ser jo ikke akkurat sånn ut. Men ideen var da at man setter opp åtte menneskelige dayloser på rad. En arm opp, sånn som de to her. Det betyr en ener. Og en arm ned. Det betyr en null. Og ideen var da at disse menneskene skulle virke som vipper. Og opplegget var da sånn at hun som står sist her, hun skal da se på den personen som står foran seg. Nei, det var faktisk motsatt. Han som står her, han skal se... Se på hun som står til høyre for seg. For dette skal også være et skifteregister. Og så her er det null. Hun har armen nede, og da skal han ta armen ned.", "source": "lecture"}
{"lecture_id": "os3del10", "chunk_id": "os3del10_0002", "start": 300.0, "end": 469.96, "token_count": 500, "text": "Det betyr en null. Og ideen var da at disse menneskene skulle virke som vipper. Og opplegget var da sånn at hun som står sist her, hun skal da se på den personen som står foran seg. Nei, det var faktisk motsatt. Han som står her, han skal se... Se på hun som står til høyre for seg. For dette skal også være et skifteregister. Og så her er det null. Hun har armen nede, og da skal han ta armen ned. Hun ser på han, så hun skal fortsette å holde armen opp. Han skal se på henne og skal løfte opp hånden, sånn at man får et skift. Altså at de to enerne går til venstre. Det viser seg når man setter opp dette og gjør det i praksis, så fungerer det veldig dårlig. Det er fordi det alltid er litt forskjell, når et menneske gjør noe sånt, i hvor lang tid man bruker. Det som hele tiden oppstår da, er sånn som her. Det er to enere, og så plutselig blir det tre enere, for du får en ener til. Det kan være fordi det er forskjell i hvor fort hun som står her, ser den hånden her. Så hvis han løfter den hånden veldig fort opp fordi han ser hunda-hånden i været, så vil hun plutselig ta hånden opp. Og dermed så oppstår det en bitt som kommer ut fra ingenting. Og dette er opplagt... Dette er opplagt ikke bra for en sånn enhet. Dette gjør at man overhodet ikke kan stole på et sånt skifteregister. Så da kommer den siste fiksen som gjør at man får en enhet man kan stole på. Og det er en såkalt debippe. Det man gjør da, er at man setter sammen to låser. Dette er master og slave. Det er to låser som man setter sammen til en såkalt vippe. Og dette er da den endelige enheten som man lagrer på.", "source": "lecture"}
