{"lecture_id": "os3del7", "chunk_id": "os3del7_0000", "start": 0.0, "end": 149.94, "token_count": 587, "text": "Her har vi en litt mer komplisert krets, hvor vi da kan endre en bitverdi. Etter pause tenkte jeg å ta en liten poll, hvor vi får noen spørsmål fra dette. Så her gjelder det å følge med. Det ser jo litt komplisert ut, men det er egentlig ikke så komplisert. Her fremme så har vi den samme konstitusjonen med not-porter. Men i tillegg, for å kunne legge inn en... Verdien D er den som vi ønsker å lagre. For å legge inn den, har vi satt opp et system med to overporter, altså en not-port foran der. Da kan man overbevise om at hvis man setter inn en null her, så lagres en null. Hvis man setter inn en ener, så lagres en ener. Vi kan jo se på hva som skjer hvis man setter inn en null. Jo, da kommer det en null inn her. Går inn i not-porten. Da må det bli en ener her. Og så vet vi det at når det kommer en ener inn i en orport, så vil det alltid komme en ener ut. For den or-porten gir bare null hvis det kommer to nuller inn. Så kommer det en ener inn her, så uansett hva som er der, så kommer det da faktisk en ener ut. Og dermed får vi lagt inn denne verdien null i denne kretsen. For det kommer en ener inn her, og da blir det en null der. Og så får vi på samme måte som tidligere. At det er en lukket krets. Det går null inn i denne orporten. Og så kommer det en null herfra. Da er det null som går videre. Og så blir det en ener der. Og så kommer den eneren inn her igjen. Og én og én gir én og null, og så videre. Og hvis man da ønsker å switche og legger inn en ener her, så får vi akkurat det motsatte. Og da vil det til slutt bli en ener her. Det som skjer da, er at da kommer det en ener inn her. Og en ener inn i en orport. Så kommer det null her. Og da kommer det null inn der. Da kommer det to nuller inn der, og så blir det en ener her. Så på samme måte så funker den også. Men hva er problemet nå? Problemet nå er ikke like lett å se. Men det vi skulle ønske, er at man på en måte kan skape...", "source": "lecture"}
{"lecture_id": "os3del7", "chunk_id": "os3del7_0001", "start": 112.4, "end": 198.72, "token_count": 286, "text": "Og da vil det til slutt bli en ener her. Det som skjer da, er at da kommer det en ener inn her. Og en ener inn i en orport. Så kommer det null her. Og da kommer det null inn der. Da kommer det to nuller inn der, og så blir det en ener her. Så på samme måte så funker den også. Men hva er problemet nå? Problemet nå er ikke like lett å se. Men det vi skulle ønske, er at man på en måte kan skape... Man ønsker å ha en vippe, eller en lagerenhet, som er sånn at hvis du setter på null her, så lagres nullen, men så skulle man ønske å skru av kretsen, sånn at den nullen blir bevart. Uansett om D-en her endres. Jeg ønsker å ha et system som er sånn at om jeg endrer D-en til 1 her nå, så kan jeg velge. Velge at VIP-en, eller et register som holder denne verdien, det skal være uendret. Og det kan du ikke få til med denne kretsen her. Med en gang du gjør en endring her, så forplanter den endringen seg, og så lager vi en annen bit.", "source": "lecture"}
