{"lecture_id": "os3del4", "chunk_id": "os3del4_0000", "start": 0.0, "end": 179.98, "token_count": 597, "text": "Det man lager da, er en alu. Det skal vi snakke mye om i dag. Arithmetic Logic Unit, som det står ALU for. Altså en aritmetisk og logisk enhet. Den heter det fordi den både kan gjøre aritmetikk, altså legge sammen og trekke fra osv. Og i tillegg kan den gjøre logikk, sammenligne og ande over osv. At det viser seg at en del kretser kan ligne litt på hverandre. F.eks. hvis du skal trekke fra, så kan du bruke addisjon. Altså gjøre noen smarte triks med toer-kompliment, som er en måte å representere negative tall. Hvis du representerer negative tall med toer-kompliment, så kan man nesten bruke akkurat det samme som en adderer, og så får man inn fortegn også. Og tilsvarende med andre komponenter. Man kan bruke litt av de andre portene, sånn at det blir mer effektivt. Og så kommer det smarte at man putter inn noen kontrollbit i aluen. Her står det S0 og S1. I dette tilfellet har jeg lagd en alu som er sånn at f.eks. hvis S0 er 0 og S1 er 1, så adderer denne kretsen. Men hvis begge to er null, så kanskje så utføres a minus b. Og hvis det er to e-ener inne her, så kanskje det som kommer ut da, er a pluss 1. Og det er tilfellet i dette tilfellet her. At det som kommer ut av c, er a pluss 1. Altså man øker verdien med igjen. Ja, det er spørsmål om man når ser slides. Ja, det er fint at de fleste ser slides her. Ja, det er meningen. På denne måten så kan man få kretsen til å gjøre akkurat det. Den operasjonen. Ved å sette inn kontroll dit. Det er viktig å ha med seg videre. Når vi skal bygge opp en CPU, så bruker vi nøyaktig den biten der. Det er dette som fører til såkalte instruksjoner, eller maskininstruksjoner. En viktig del av en maskininstruksjon er disse bitene som kontrollerer nøyaktig hva Alun gjør. For Alun, det er virkelig hjernen til CPU-en. Og CPU-en er hjernen til datamaskinen. Så det er...", "source": "lecture"}
{"lecture_id": "os3del4", "chunk_id": "os3del4_0001", "start": 150.02, "end": 322.2, "token_count": 587, "text": "Ved å sette inn kontroll dit. Det er viktig å ha med seg videre. Når vi skal bygge opp en CPU, så bruker vi nøyaktig den biten der. Det er dette som fører til såkalte instruksjoner, eller maskininstruksjoner. En viktig del av en maskininstruksjon er disse bitene som kontrollerer nøyaktig hva Alun gjør. For Alun, det er virkelig hjernen til CPU-en. Og CPU-en er hjernen til datamaskinen. Så det er... Det er her det skjer. All logikk og alt som du programmerer, det vil til syvende og sist utføres inni ALU. Ja, her har jeg listet opp mulige ALU-operasjoner. Som å addere, som vi så på. Riktignok med 3D-er. Men subtrahere, eller subtrahere, det er å trekke fra. Og increment eller pluss-pluss... Decrement skulle være minus-minus. Altså du trekker fra én. Og litt mer komplekse operasjoner som å multiplisere og dividere. De aller enkleste aluene kan ikke multiplisere og dividere. Hvis de skal lage noen små multiplikasjoner, så må de legge sammen mange ganger. Men i de mer komplekse aluene så har man en egen krets som multipliserer. Men det betyr at disse operasjonene kan ta litt lengre tid enn av dere. De første her er aritmetiske operasjoner. Så de tre siste er logiske. Så det er den logiske delen med logiske operasjoner. Skift, f.eks., som flytter alle bitt i én retning. Det skal vi se på etterpå. En NIF-test er å sammenligne to størrelser. Finne ut om de er like eller forskjellige. Eller eventuelt den ene er større eller mindre enn den andre. Hvis det f.eks. er 4-bit, så kan du spesifisere 16 operasjoner til denne alderen. Ofte har de enda flere operasjoner. På en maskin som het Edzak 2, som ble lagd i 1958. Dette var akkurat på overgangen til man begynte med transistorer. Men disse maskinene hadde radiorør. Og da er det liksom et helt sånt radiorør tilsvarer da en transistor.", "source": "lecture"}
{"lecture_id": "os3del4", "chunk_id": "os3del4_0002", "start": 277.94, "end": 347.0, "token_count": 208, "text": "Eller eventuelt den ene er større eller mindre enn den andre. Hvis det f.eks. er 4-bit, så kan du spesifisere 16 operasjoner til denne alderen. Ofte har de enda flere operasjoner. På en maskin som het Edzak 2, som ble lagd i 1958. Dette var akkurat på overgangen til man begynte med transistorer. Men disse maskinene hadde radiorør. Og da er det liksom et helt sånt radiorør tilsvarer da en transistor. Og da sier seg selv at da ble disse maskinene ganske enormt store. Det er ikke så langt tilbake, men det illustrerer den enorme revolusjonen som transistoren gjorde, hvor vi kan få i dag milliarder av sånne transistorer inn på en liten brikke.", "source": "lecture"}
