{"lecture_id": "os3del8", "chunk_id": "os3del8_0000", "start": 0.0, "end": 218.0, "token_count": 598, "text": "Så dette er foreløpig løsningen. Det er en såkalt de-lås, eller de-latch på engelsk. Det er en enhet som lager et bitt, men i tillegg kan man velge å skru av enheten, sånn at den ikke reagerer på input. Vi har fått inn en C her i tillegg. Den virker sånn, det er en kontrollenhet. Den er sånn at hvis jeg liker én, så vil verdien som kommer inn på det her, den vil lagres. Og hvis jeg liker null, så vil denne lagrede verdien beholdes. Helt uavhengig av hva som kommer inn her. Og det ser vi at vi har fått til ved å endre litt på den forrige. Vi ser vi har lagt inn to and-porter. Ellers så er de to. Konstruksjonen er helt lik, bortsett fra at vi har lagt inn to and-porter. Da kan man igjen overbevise seg selv om at vi ser lik én. Da vil denne løsningen virke akkurat som den forrige løsningen. Vi vet at med and, hvis det kommer en ener inn i en and-port, så... Så er det den andre verdien som gir oppet, for eksempel hvis... Hvis det kommer en ener inn her og en ener inn der, så får man en... Men det er ikke helt riktig. Hvis det kommer en null inn, så kommer det alltid en null ut. For å overbevise om at denne virker, så kan vi kanskje se på... Hva skjer f.eks. hvis en er igjen? Og denne nå skal virke og skal endre. Jo, da... Hvis det kommer en ener inn på D og CL1, så kommer det en ener inn der. Og samtidig vil det komme null inn der. Og da vil kretsen fungere akkurat som denne her, på samme måte. Men så ser vi... Vi ser likt null. Det er på en måte av innvirkningen fra kretsen. Får vi se litt null, så vil det komme en null inn i begge anportene. Og da går det null videre til begge årportene. Og når det kommer null inn i begge årportene, så vil denne kretsen bli helt isolert. Så den vil ikke endre seg. Uansett om man endrer på det. Så man kan... Man kan være overbevist om det er slik kretsen virker. Det er egentlig bare å prøve alle kombinasjoner.", "source": "lecture"}
{"lecture_id": "os3del8", "chunk_id": "os3del8_0001", "start": 180.0, "end": 326.0, "token_count": 473, "text": "Det er på en måte av innvirkningen fra kretsen. Får vi se litt null, så vil det komme en null inn i begge anportene. Og da går det null videre til begge årportene. Og når det kommer null inn i begge årportene, så vil denne kretsen bli helt isolert. Så den vil ikke endre seg. Uansett om man endrer på det. Så man kan... Man kan være overbevist om det er slik kretsen virker. Det er egentlig bare å prøve alle kombinasjoner. Men det aller viktigste er bare å vite at sånn funker den kretsen. Hvis c er lik 1, så leser den intet-verdien og lagrer den. Hvis c er lik 0, så beholdes verdien som er lagret, uavhengig av hva det er. Som vi hele tiden gjør på i datamaskinarkitektur. Vi lager da en liten sånn logisk boks som inneholder alt dette. Akkurat som vi lagret den aritmetiske enheten. Nei, akkurat som vi lagde den adereren. Så lagde vi en kompleks aderer, og så lagde vi en liten boks. Spørsmål i kretsen om i disse lukkede kretsene, hvordan kommer verdien ut? Går den ikke rundt og rundt i evighet? Jo, de går på en måte rundt og rundt i en evighet. Det er sånn vi ønsker å lagre f.eks. denne kretsen her. Her vil den gå rundt og rundt i evighet. Men når vi lager en krets som dette, så kan vi koble de sammen. Og da vil vi se at når vi setter c-lik 1 og endrer på input-verdien det, så vil vi få en endring her. Og dermed får man en endring. Og da endres systemet hele tiden, og det er nøyaktig det som skjer i en CPU.", "source": "lecture"}
