{"lecture_id": "os4del15", "chunk_id": "os4del15_0000", "start": 0.0, "end": 194.16, "token_count": 589, "text": "Foreløpig så kan jeg på en måte ikke... Jeg kan ikke kompilere denne biten alene, for alt henger sammen. Men det som går an å gjøre, er å dele opp seerprogrammet, sånn at vi har én bit som... Som utfører summen, og en annen bit som er main. Så da ser det... Skal vi se hvis jeg finner den funksjonen... Jeg tror det er en som heter Sumfunksjon. Sånn, ja. Sumfunksjon, den inneholder da bare denne funksjonen. Og det går da an å kompilere det for seg. Og så kan man i tillegg ha... En main som kaller denne funksjonen. Så her har vi en extern int sum i den sum main. Og den kaller da sum. Kattens sum er to m-er, for ikke å blande. Sum kaller funksjon sum, og så skriver den ut hva den gjør. Og dette er mulig å gjøre i C. Og her har jeg gjort det eksplisitt, fordi vi da etterpå skal kunne gå inn og se på maskinkode for denne summen. Hvis vi ser på den samlede maskinkoden for hele sum, så er det mye mer oversiktlig, for da inkluderer det main og all kommunikasjon med operativsystemet osv. Men da kan vi se hvordan vi kan kompilere dette. Og én måte å kompilere det på er å kompilere alt sammen. Sum main og sum funksjon. Og så kalle det gjensum. Og på samme måte så får vi da et program som vi kan kjøre. Men det som er fint for oss nå, og som generelt er fint, er at man kan f.eks. ha samme main, og så gjør man bare endringer her i sum.  Det hadde vært fint å kunne kompilere de uavhengig av hverandre. Og så skjøte de sammen etterpå. Og det er mulig. Jeg kan først kompilere main. Men da må jeg legge... Hvis jeg legger på en... Hvis jeg legger på en opsjon minus c, så betyr det bare kompiler. Og ikke... Ikke load systembiblioteket. Biblioteker og alt annet som trengs for å få en ferdig kjørbar kode. Bare kompler akkurat den koden inni her. Og så kan jeg kanskje kalle den for... La oss si...", "source": "lecture"}
{"lecture_id": "os4del15", "chunk_id": "os4del15_0001", "start": 156.4, "end": 314.38, "token_count": 434, "text": "Jeg kan først kompilere main. Men da må jeg legge... Hvis jeg legger på en... Hvis jeg legger på en opsjon minus c, så betyr det bare kompiler. Og ikke... Ikke load systembiblioteket. Biblioteker og alt annet som trengs for å få en ferdig kjørbar kode. Bare kompler akkurat den koden inni her. Og så kan jeg kanskje kalle den for... La oss si... Main er vel et naturlig navn på den. Jeg kaller den Main. Det jeg fikk nå, var et eksekverbar kode som heter Main, som inneholder bare den biten. Samme med... Med den symfunksjonen her borte. Den ønsker jeg å kompilere i en annen bit. Og så kan jeg kalle den for eksempel Funk. Sånn. Og da gir dette maskinkode som inneholder bare... Så for å lage en eksekverbar kode der totalt sett, så må jeg legge sammen... Den operasjonen jeg gjør nå, er å linke programmet. Og da oppfører Jesus seg som en linker. Jeg linker nå main og funk sammen. Og så får jeg ut et... En kjørbar fil som heter SUM. Så kjører jeg den, og så ser vi at det fungerer. Så i praksis er det samme operasjonene jeg gjorde her oppe da jeg kompilerte hele programmet og kjørte det. Men jeg har delt dem opp nå i to biter. Så hvis vi ser på sum, det eksekverbare programmet, ser vi det er 8672 bytes. Enn summen av disse to. Det er fordi det da er linke til biblioteker inn i den ferdige, eksekverbare koden. Og så er den da klar til å kjøre.", "source": "lecture"}
