{"lecture_id": "os4del17", "chunk_id": "os4del17_0000", "start": 0.0, "end": 205.08, "token_count": 591, "text": "Vi kan se på... denne, ja. Dette er da et assembly-program som jeg har skrevet. Det er egentlig bare å sette seg ned med en taxidoor og skrive assembly-kode. Den gjør akkurat det samme som den... sum-metoden. Så det jeg prøver å etterligne... Egentlig ikke den. Det er den funk... Sum-funksjonen. Denne. Det jeg gjør nå, er at jeg prøver å skrive et assembly-program som kan erstatte denne funksjonen her. Så skal vi også se at den kan erstatte den funksjonen, sånn at jeg kan kompilere det inn. Og den erstatter da direkte denne funksjonen. Kanskje vi kan gjøre det først? Så kan vi se... Vi kan se veldig kjapt her. Hvis dere ser godt etter, så er dette et program som ligner helt på programmet fra simuleringen. Den eneste forskjellen er at her hadde... Her hadde vi så maks i løkka, så kalte vel kanskje den for R0. Men det er fire registre, akkurat som vi i simuleringen brukte R0, R1, R2, R3 og R4. Så denne skal gjøre den løkka, og så skal den sende resultatet tilbake til main. Vi kan se på hvordan det fungerer i praksis først, sånn at vi vet hvor vi er. Så det jeg skal gjøre nå, er densummain.c. I stedet for å kompilere den sammen med dette C-programmet, så vil jeg nå kompilere den sammen med as.s. Og det kan jeg gjøre på samme måte. Jeg kan si jeg vil ha med Summain. Og så vil jeg sende ut en eksekverbar kode, som er sum. Hvis jeg gjør det, og så kjører den, så ser vi... Ja, vi får tallet seks. Men man er på en måte ikke helt overbevist om at det er denne koden her som kjører. Og da kan vi jo teste det veldig raskt ved å si at det tallet der er en maks. Som man sammenligner med. Skal se litt nøyere på koden etterpå. Men jeg kan i hvert fall save den der. Og så prøve å kompilere på nytt. Og så kjøre det. Og da ser vi... Jo, det ser ut til å virke, dette her. Det er den assembly-koden som nå utfører denne løkken her.", "source": "lecture"}
{"lecture_id": "os4del17", "chunk_id": "os4del17_0001", "start": 169.16, "end": 344.44, "token_count": 578, "text": "Men man er på en måte ikke helt overbevist om at det er denne koden her som kjører. Og da kan vi jo teste det veldig raskt ved å si at det tallet der er en maks. Som man sammenligner med. Skal se litt nøyere på koden etterpå. Men jeg kan i hvert fall save den der. Og så prøve å kompilere på nytt. Og så kjøre det. Og da ser vi... Jo, det ser ut til å virke, dette her. Det er den assembly-koden som nå utfører denne løkken her. Og da har jeg hele clouet at... Jeg som programmerer kan nå velge å si at... Nei, jeg stoler ikke på GCC. GCC lager ikke bra nok kode. Jeg vil skrive denne koden i stedet. Og så skriver jeg denne koden, som jeg håper er mer effektiv enn koden som GCC lager. Men fra vårt ståsted så er det viktigste å se hvordan henger dette her sammen? Altså hvordan går man fra Høyre... Sånn her - til maskinkode. Og det vanligvis er det da kompilatoren som gjør den jobben. Den kompilerer da symfunksjon.c og lager eksekverbar kode. Men i stedet nå så kan vi... Vi kan gjøre sånn også - kompilere as.s, og så lage eksekverbar kode som jeg kan kalle as. Og så kan jeg kompilere den sammen med... SumMain, var det jeg kalte den. Og så kan jeg kalle den Main. Og så kan jeg lime sammen de to bitene, AS og Main, og lagre det som en kjørbar filsum. Og så kan jeg kjøre det igjen. Og da ser vi... Nå er dette på en måte to uavhengige biter. Så jeg kan gå inn her og endre tilbake. Endre den til 3, sånn at summen skal bli 10. Da trenger jeg ikke kompilere sum main på nytt, men jeg må kompilere... Assemblykoden. Den må jeg kompilere på nytt, og så må jeg linke den sammen med main. Til en ny eksekuerbar kode. Og så må jeg kjøre den. Så jeg kunne gjort det etter én operasjon, men dette var bare for å illustrere at nå er det denne koden jeg kompilerer, og bare denne.", "source": "lecture"}
{"lecture_id": "os4del17", "chunk_id": "os4del17_0002", "start": 309.86, "end": 349.0, "token_count": 145, "text": "Endre den til 3, sånn at summen skal bli 10. Da trenger jeg ikke kompilere sum main på nytt, men jeg må kompilere... Assemblykoden. Den må jeg kompilere på nytt, og så må jeg linke den sammen med main. Til en ny eksekuerbar kode. Og så må jeg kjøre den. Så jeg kunne gjort det etter én operasjon, men dette var bare for å illustrere at nå er det denne koden jeg kompilerer, og bare denne. Og det er uavhengig av meg. Og det gjorde jeg ved denne operasjonen.", "source": "lecture"}
