{"lecture_id": "os4del16", "chunk_id": "os4del16_0000", "start": 0.0, "end": 219.68, "token_count": 594, "text": "Men vi har da gått denne lange veien for å... For å kunne se på hva som egentlig er innholdet i... I sumfunksjon. Så skal vi kanskje hoppe litt i... I fremstillingen her. Og så kan vi prøve å be kompilatoren om å lage... Såkalt assembly-kode. Og måten man gjør det på, er at man... I stedet for sånn som her... At jeg bruker minus C. Minus C sie, lag maskinkode av denne funksjonen. I stedet så kan jeg be GCC-kompulatoren om å lage assembly-kode. Så lages det en fil med assemblerkode som heter sumfunksjon.s. Og den ser vi. Den er ganske liten. Og vi kan se på den her... Hvordan... Hvordan ser den ut? Jo, den er ikke større enn dette her. Og her ser vi... Her begynner det å ligne på noe vi har sett. Her er det \"... Og dette her er såkalt assembly-kode. Og denne koden kan man skrive for hånd selv. Så tidligere i de tidligste datamaskinene var det veldig vanlig å skrive i assembly. I dag også så skriver man assembly i noen få tider. Noen tilfeller hvor man ønsker å få ting til å gå veldig fort for å optimalisere. Men det har blitt mindre og mindre vanlig å skrive assembly. Kanskje litt vanligere for ARM, for der er det veldig viktig at ting er effektive. Mobile devices. Men... For det vi ser her, det er nå da assembly-versjonen av den maskinkoden som GCC vil lage hvis jeg legger på minus C i stedet for minus S. Så det jeg ba GCC om nå, var vis meg assembly-versjonen av den maskinkoden du vil lage. Og da ser vi at fra høynivåspråket så er det kompilatoren som da bestemmer nøyaktig Hvordan denne loopen skal være, osv. Og vi ser her, for eksempel, så har vi en jump less equal. Det er hopp hvis... Hvis de to tallene, altså tallet tre og dette her, som er en referanse til ram, hvis... Jeg tror det er sånn at hvis denne er mindre enn tre, så skal det hoppe. Metoden som kompulatoren har valgt for å få til å lage en løkke. Da skal vi hoppe til L3, og det er opp her igjen.", "source": "lecture"}
{"lecture_id": "os4del16", "chunk_id": "os4del16_0001", "start": 180.0, "end": 367.48, "token_count": 597, "text": "Hvordan denne loopen skal være, osv. Og vi ser her, for eksempel, så har vi en jump less equal. Det er hopp hvis... Hvis de to tallene, altså tallet tre og dette her, som er en referanse til ram, hvis... Jeg tror det er sånn at hvis denne er mindre enn tre, så skal det hoppe. Metoden som kompulatoren har valgt for å få til å lage en løkke. Da skal vi hoppe til L3, og det er opp her igjen. Den utfører da akkurat den helt tilsvarende kode som vi lagde. Da skal vi se litt mer på den koden. Men før vi gjør det, så kan det være greit å kjenne litt mer til X86. Assembly, og hva de forskjellige tingene her... hva de gjør. Så det vi skal se på nå, er hvordan man skriver assembly-kode direkte. Men det som kan være greit å ta med videre, er denne konsesjonen her. Den ser litt rar ut. Og... dette er et register. Så... Denne konstruksjonen er en referanse til ram. Og det er en referanse til den adressen i ram som ligger da inn i dette registeret RBP. Så akkurat som i simuleringen. Hvis inni RBP ligger tallet 2, så er dette en referanse til byte nummer 2 i ram. Men så er det litt en sånn minus 4 her etter, og det betyr at... Det er egentlig ikke bite nummer to, men det er minus fire, så det blir da... Ja, la oss si RBP var åtte, da. Så blir denne adressen egentlig til bite nummer fire. For det er åtte minus fire. Du trekker fra fire bite. Eller du trekker fra adressen med fire bite. Og dette kan være... Det ser jo ganske gresk ut til å begynne med, men vi skal bruke litt tid på å se på assembly. Forstå hva som foregår. Det er også veldig nyttig senere, i andre sammenhenger, å kunne forstå hva assembly-koden er. Og så er dette på en måte linken fra transistorene og opp til høynivåkode. Så litt må vi forstå av registeret og hvordan de brukes. Når jeg snakker om registeret, og da ser vi EAX... Det er etter registeret. Sånn tradisjonelt i X86 så er det fire viktige registre. AX, BX, X og DX.", "source": "lecture"}
{"lecture_id": "os4del16", "chunk_id": "os4del16_0002", "start": 333.08, "end": 533.88, "token_count": 584, "text": "Det er også veldig nyttig senere, i andre sammenhenger, å kunne forstå hva assembly-koden er. Og så er dette på en måte linken fra transistorene og opp til høynivåkode. Så litt må vi forstå av registeret og hvordan de brukes. Når jeg snakker om registeret, og da ser vi EAX... Det er etter registeret. Sånn tradisjonelt i X86 så er det fire viktige registre. AX, BX, X og DX. Og E, det betyr at det er et 32-bitsregister. Og Move L, det betyr at vi skal flytte en long. Og en long det er da 32-bit. Så Movel, Adel og disse her, de opererer på 32-bit. Jeg skal skrive litt assemblykode, da skal vi bruke i stedet... Og det er en utvidet versjon. Det er 64-bits-registeret. Men vi kan gå tilbake og så kan vi se litt på... Vi kan se litt på det som står i notatene om Assembly. Jeg har lagt inn et par referanser. Det er et company fra Erik Hjelmås som ligger i Canvas. Det inneholder litt om assembly. Og så er det masse referanser på nettet også, sånn som denne her. Så vi skal ikke gå veldig dypt i assembly-programmering. Enkle sammenhenger. Men det som er viktig å vite, er at nøyaktig som i den simulerte maskinen, så fins det assembly-institusjoner. Og det er ikke noe annet enn at i X86, når det finnes en institusjon MOVE, så har den bare et nummer i rekken. Det er en rekke institusjoner. Kanskje MOVE er institusjon nummer 24. Av en X86-maskin står tallet 24 der, og da er det kodet akkurat som i vår simulering. Tallet 24 betyr - legg sammen. Og så er det da en syntaks for alle instruksjoner, sånn som for Move. Så angir man... Man starter med en assemblelinje med Move, og så angir man Source og destination. Så Move... Hvis jeg da her skriver \".move ax til bx\", så betyr det rett og slett... Ta det som ligger i register ax, og legg i bx. Og så er assembly lagd av en masse sånne institusjoner som tilsvarer alle maskininstitusjoner.", "source": "lecture"}
{"lecture_id": "os4del16", "chunk_id": "os4del16_0003", "start": 488.84, "end": 613.6, "token_count": 374, "text": "Tallet 24 betyr - legg sammen. Og så er det da en syntaks for alle instruksjoner, sånn som for Move. Så angir man... Man starter med en assemblelinje med Move, og så angir man Source og destination. Så Move... Hvis jeg da her skriver \".move ax til bx\", så betyr det rett og slett... Ta det som ligger i register ax, og legg i bx. Og så er assembly lagd av en masse sånne institusjoner som tilsvarer alle maskininstitusjoner. Så når maskinen er lagd, så definerer den alle institusjoner. Det betyr da... Hvis jeg så nå ad AXBX, så vil det bety... Legge sammen det som ligger i BX med AX, og lagre det i Destination, nemlig BX. Og tilsvarende for andre instruksjoner. Det vi trenger for å gjøre akkurat den samme løkken som vi hadde i simuleringen, er disse instruksjonene. Compare, som er akkurat den samme som vi hadde i simuleringen. Sammenlign verdien av de to registrene. Og så etterpå har vi en jump not equal. Den finnes også i Exo 86. Og da jump not equal, den hopper da til den riktige linjen i... i programmet. Og da må vi ha med det. Så vet vi... Da vet vi omtrent hva som skal til for å skrive en sånn summeringsfunksjon. Så da kan vi prøve å gå inn og se på hvordan det ser ut.", "source": "lecture"}
