{"lecture_id": "os4del14", "chunk_id": "os4del14_0000", "start": 0.0, "end": 227.6, "token_count": 599, "text": "Det vi skal se på da aller først, det er et C-program som summerer. Så her har jeg et C-program som egentlig gjør akkurat det samme som vi kjørte i simuleringen vår, nemlig den S-løkken som går. Den går tre ganger. Eller faktisk... Hvor mange ganger går denne her? Den starter på I lik null. Så den går en ekstra gang hvor den ikke legger til noe. Så det hadde vel egentlig vært riktigere å starte på én her, hadde ikke det? Hvis jeg starter på 1, så gjør den det samme som vår simulering. Altså den starter med i lik 1, og s er initiert til 0. Og så økes den første runde, så blir den 1. Så legges i lik 2, så legges 2 til, så blir det 3. Så går i opp i lik 3, og så legges den til, så får vi resultatet 6. Vi skal se hvordan dette utføres når vi kompilerer og kjører dette programmet. Hvordan blir egentlig maskinkoden? Da er det viktig å vite at når man deklarerer en variabel, s lik 0 her, så tilordnes det en adresse i ramm til denne variabelen. Den er på 4 byte, eller 32 bit. Og det igjen er bare en konvensjon. I C så skal integer være 4 bite, eller 32 bit. Det samme med tallet her, I. Den er også 4 bite. Men så har man andre variabler. F.eks. så går det an å lage en long-long int, som er 64 bit. Så når det lages plass til denne variabelen her i ramm, så settes det av fire bites som ligger rett etter hverandre. Og det... Når man da skal aksessere den variabelen, så sender man ut på bussen en adresse. Adresse 100.045. Der ligger vår variabel. Og så er det fire bite etter hverandre som ligger der. OK... Jeg kunne ha skrevet dette, all koden, inne i Maine. Men det er lov å definere eller deklarere funksjoner på denne måten. Så nå har jeg gjort det for å kunne skille ut dette fra Maine. Hva skjer med akkurat denne koden? Hvordan ser den ut i maskinkode? Men før vi kommer så langt, så kan vi vise hvordan vi komplerer og kjører dette programmet. Sum.ce. Og så kan jeg kalle det SUM.", "source": "lecture"}
{"lecture_id": "os4del14", "chunk_id": "os4del14_0001", "start": 173.64, "end": 310.28, "token_count": 365, "text": "Og så er det fire bite etter hverandre som ligger der. OK... Jeg kunne ha skrevet dette, all koden, inne i Maine. Men det er lov å definere eller deklarere funksjoner på denne måten. Så nå har jeg gjort det for å kunne skille ut dette fra Maine. Hva skjer med akkurat denne koden? Hvordan ser den ut i maskinkode? Men før vi kommer så langt, så kan vi vise hvordan vi komplerer og kjører dette programmet. Sum.ce. Og så kan jeg kalle det SUM. Ja, det er spørsmålet hvorfor det står int-main og ikke void-main. Det er et litt for vanskelig spørsmål. Det fungerer hvis du skriver void main også, så vidt jeg husker. Men... Jeg tror det er en konvensjon fordi den returnerer et... Main returnerer et tall. Altså den returnerer en integer. Men det... Jo, det er mulig jeg returnerer det til operativstemme som en sånn feilkode etter at det har kjørt. At Maine da returnerer en integer-feilkode. Jeg tror det er det det kommer av. OK. Mens jeg kopierer programmet og kjører det, så ser vi at de får sum lik 6. Og siden vi var inne på det, skjer det noe annerledes hvis vi... Hvis vi starter med ild i knull? Nei. Det bør være det samme. Det er bare egentlig en overflødig linje. Så vi kan like gjerne starte på én.", "source": "lecture"}
