{"lecture_id": "os4del13", "chunk_id": "os4del13_0000", "start": 0.0, "end": 196.28, "token_count": 596, "text": "Ok, da skal vi gå videre med C-programmering og se på... Ja, og se på hvordan denne maskinkoden som vi så i simuleringen, hvordan den faktisk er mer eller mindre akkurat den samme når vi... Kompilerer høynivåspråk ned til maskinkode. For heldigvis så slipper programmerere å skrive maskinkode. Det ville vært ekstremt tungvint hvis man skulle begynne å putte inn nuller og enere helt direkte, på samme måten som vi skriver inn i rom i simuleringen. Hvor du da skriver maskinkoden direkte inn. På de aller første datamaskinene så... Så gjorde man det. Da... På de aller første datamaskinene så var det nettopp det man gjorde. Man skrev inn enere og nuller direkte inn i maskinen. Hadde gjerne hullkort som man da skrev enere og nuller på med hull på kortet. Det var nuller og ener. Og så ble det lagret inn i maskinen som et program. Og da var det maskinkode. Til å begynne med hadde man ikke kopulator. Men så fant man ut at... Dette ble ofte veldig feil. Fordi med de gamle maskinene så puttet man inn en bunke med hullkort med maskinkode. Og så gikk det en time, så fikk man resultatet, og så så man... Oi, her hadde man gjort én bit feil. Og denne operasjonen med å skrive maskinkode gir opplagt ekstremt mange feil. Så for å ordne på det så fant man opp høynivåspråk og kompulator. Og det som er ganske fantastisk, er at en kompulator kan oversette til maskinkode absolutt alle mulige former for høynivåkode. Så lenge syntaksen er riktig. Det er noen restriksjoner. Syntaksen var riktig. Men hvis du da skriver inn for-løkker og if-tester og wil-løkker osv., så vil kompilatoren lage maskinkode som gjør nøyaktig det du ber om. Ja, det er en kommentar om at man klarte å lande på månen med hullkort og maskinkode, og det er riktig. Eller ikke helt riktig. Når man landet på månen i 69, så hadde man Men hullkort var det mange som brukte fortsatt. Ok. Så... Det vi skal se på nå, er hvordan...", "source": "lecture"}
{"lecture_id": "os4del13", "chunk_id": "os4del13_0001", "start": 150.0, "end": 365.96, "token_count": 591, "text": "Men hvis du da skriver inn for-løkker og if-tester og wil-løkker osv., så vil kompilatoren lage maskinkode som gjør nøyaktig det du ber om. Ja, det er en kommentar om at man klarte å lande på månen med hullkort og maskinkode, og det er riktig. Eller ikke helt riktig. Når man landet på månen i 69, så hadde man Men hullkort var det mange som brukte fortsatt. Ok. Så... Det vi skal se på nå, er hvordan... Det er hvordan... Hva skjer når vi prøver å kompilere en sånn løkke? Den løkken vi hadde med et C-program, som regner ut en sum. Så skal jeg først finne frem de riktige programmene som gjør det. Ja, eller kanskje før vi går videre, så skal vi prøve å se litt på Denne Adotops eller Helloed. Hello... Og da er det et... Det fins mange programmer som kan dumpe sånn bitekode. Eller ikke bitekode, men binær kode. For dette er en binær... Dette er nå en binær fil. Så XX3, den dumper ut innholdet av den binære filen. Og da ser vi... Kommer det en masse tegn. Vi kan pipe den til More, sånn at vi ser hva den inneholder. Og da ser vi... Ja, dette er da... Dette er da Heks. Så ser vi det står 7F. Og det betyr at... Det første er vanlige tallet, 7, men hva er F? Jo, F er... Dette er Heks, og det går opp til 16. Altså 10 er A. B, B, 12 C, 13 D, 14 E... Altså F er 15. Så F betyr da... F betyr da fire enere. Så... Så dette er da to bite. Så dette er på en måte en kortform og binært. Hvis vi skrev med nuller og enere, vil det bli mye lengre. Er en vanlig måte å skrive ut binær kode. Men ELF er hva slags type binær kode dette er. Men vi kan se... Her nede så ser vi... Her kommer det... Hvis jeg tar... Sorry, en gang til... Her nede så kan man se at det står LIB64 Linux X86. Og det er en av de situasjonene hvor... Vi ser at i denne maskinkoden så snakker man med operativsystemet.", "source": "lecture"}
{"lecture_id": "os4del13", "chunk_id": "os4del13_0002", "start": 326.48, "end": 423.24, "token_count": 320, "text": "Hvis vi skrev med nuller og enere, vil det bli mye lengre. Er en vanlig måte å skrive ut binær kode. Men ELF er hva slags type binær kode dette er. Men vi kan se... Her nede så ser vi... Her kommer det... Hvis jeg tar... Sorry, en gang til... Her nede så kan man se at det står LIB64 Linux X86. Og det er en av de situasjonene hvor... Vi ser at i denne maskinkoden så snakker man med operativsystemet. Det er ikke bare institusjoner som adder og mover osv. Det er også kode her som snakker med operativsystemet, for man må be operativsystemet om å skrive ut resultatet. Og dette kommer vi masse tilbake til, hvordan operativsystemet og programmer snakker sammen. Og så ser vi også at det er LIBC... Det er et bibliotek som da linkes inn. Og dette er typisk biblioteker som brukes for å kunne skrive ut Printf. Men det vi skal prøve å fokusere på, er den koden som utfører algoritmen. Altså den forløkken som vi har sett på mange ganger. Hvordan utføres egentlig den? Men jeg ser det er masse koder der, og så rett og slett kommer det... En god del som bare er tomt.", "source": "lecture"}
