{"lecture_id": "os4time1", "chunk_id": "os4time1_0000", "start": 0.02, "end": 220.22, "token_count": 589, "text": "Nå starter jeg recording. Det jeg tar opp nå, det tar jeg opp i OBS Studio, sånn at dere vil ikke høre den... Dette blir nå tatt opp fra Zoom, men jeg tar opp i bakgrunnen. Og det opptaket har jeg testet før. Det blir i hvert fall bra. Så jeg tar det nå opp, men min er gjerne på opptak. Så jeg ikke glemmer det. Da skal vi starte med å se på dagens tema. Som alltid, spør i chatten underveis hvis det er noe dere lurer på. Eller enda bedre, spesielt hvis det er noe skikkelig kritisk. Dere ikke ser noen ting, eller lyden er borte, eller... Og rop ut. Ja... Fra forrige... Fra forrige uke så... Nei, dette er neste uke. Her. Her har jeg lagt ut en del demoer. Det tok litt tid denne gangen, men de har kommet sånn... Det mangler vel kanskje én liten video her. Men tanken er at når dere jobber med oppgavene, så kan dere se på disse videoene, altså Uke fire-oppgaver. Gjerne begynn på oppgavene og så gå til videoene hvis det er noe dere lurer på. Tilsvarende så har jeg lagt ut tema for neste uke innen Linux. Og de kommer jeg til å legge ut dette temaet. Ja, så i tillegg, eller av praktisk art, så... Ser vi at Oblig1 kommer her, og den har innleveringsfrist fredag 5.2. Men det er viktig at det kun er uke 4 som er inkludert i obligen. Så oppgavene til neste uke, uke 5, de er... De skal leveres først i Oblig2 her nede. Så når du er ferdig med ukesoppgaven denne uken, så kan du levere inn Oblig1. Og som sagt, alle må levere inn som en OS-gruppe i Kanas. Men nå til dagens tema, som er maskinkode og assembly. I dag skal vi se på maskinkode og assembly og C-programmering. Det vi holdt på med i... Eller aller først så skal vi ta en ekstra titt på simuleringsmaskinen. For det er et par ting der som vi skal gjøre, som vi ikke så så nøye på forrige gang. Så vi tar en liten rekapitulering av det vi holdt på med sist, med den simulerte maskinen.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0001", "start": 167.84, "end": 389.2, "token_count": 595, "text": "Men nå til dagens tema, som er maskinkode og assembly. I dag skal vi se på maskinkode og assembly og C-programmering. Det vi holdt på med i... Eller aller først så skal vi ta en ekstra titt på simuleringsmaskinen. For det er et par ting der som vi skal gjøre, som vi ikke så så nøye på forrige gang. Så vi tar en liten rekapitulering av det vi holdt på med sist, med den simulerte maskinen. Men det vi skal gjøre videre i dag, er å se hvordan den maskinkoden og ensemble-koden som vi har i simuleringen, faktisk er mer eller mindre nøyaktig den samme som man har i X86-arkitekturen. Det er én maskinarkitektur som er den mest vanlige, som de aller fleste PC-er og servere kjører på, er X86. Så det er én helt spesiell arkitektur, hvor det er definert maskininstitusjoner, akkurat som vi definerer maskininstitusjoner i den simulerte maskinen. Og det er den som lager maskinen, som bare definerer sånn skal institusjonene se ut. Ad skal være institusjon nummer fire. For andre arkitekturer vil dette være forskjellig. Forskjellig nummerering på instruksjoner, og de kan være litt forskjellige. Et annet eksempel er ARM, som er maskinarkitekturen som er brukt av alle prosessorene som sitter i mobiler. Så ARM er det som det er laget mest av av CPU-er. 100 mrd. eller noe sånt. Det er ekstremt mange CPU-er. Arm har andre institusjoner enn X86. Og X86 har andre institusjoner enn vår simulering. Men da skal vi aller først gå tilbake til vår simulering. Her. Og så skal vi starte på den. Litt øyeblikk... Sånn. Der starter simuleringen, og så åpner jeg opp... Selve maskinen. Ja, og da ser vi at... her. Og inni her, som vi har sett tidligere, så sitter alle maskininstruksjonene. Så når vi skal la denne maskinen kjøre, så kan vi f.eks. steppe gjennom. Da ser vi... Her gjorde vi den første instruksjonen, som var å legge tallet 3, som er de to siste bitene i denne instruksjonen.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0002", "start": 346.2, "end": 531.96, "token_count": 593, "text": "Selve maskinen. Ja, og da ser vi at... her. Og inni her, som vi har sett tidligere, så sitter alle maskininstruksjonene. Så når vi skal la denne maskinen kjøre, så kan vi f.eks. steppe gjennom. Da ser vi... Her gjorde vi den første instruksjonen, som var å legge tallet 3, som er de to siste bitene i denne instruksjonen. Den ble lagd i R0, som var det bit nummer tre... Eller nummer fem og seks, blir det. Der er det to nuller. De to der. Det står for R0. De to siste bitene er det tretallet som legges inn i R0. Og de fire første bitene, det er et tall som sier at nå... Og så skal vi gjøre institusjon nummer to. Og alt dette med hvordan de bitene er satt sammen, og hva som skjer når de gjøres, det er definert av maskinarkitekturen. Og den maskinarkitekturen er på en måte brent inn her. I instruksjonsdekoderen og i Datapath. Inni Datapath er alt som skjer av beregninger osv. Og vi ser i denne maskinen så ligger institusjonene i rom. Og da er det ledninger som går fra rom og inn i institusjonsdekoderen. Og det er ledninger som sender alle disse åtte bitene som en institusjon gjør. Inn til institusjonsdekoderen. Så oversetter institusjonsdekoderen denne koden til alle de bitene som må trykkes på. Alle de rette bitene som må trykkes på for at Datapath skal gjøre nøyaktig. Senere så skal vi se at... Ja, for... Eller vi har sett tidligere at andre institusjoner her nede, det er sånn som den. Det er en ad-institusjon. Og ad har et annet nummer. Den er 0100, som den er nummer fire. At når det kommer en ID-instruksjon, så oversettes disse åtte tallene her. Eller dvs. UPP-koden her er det som definerer hvilken instruksjon det er. De oversettes, så og så trykker man på de riktige knappene på Datapath, sånn at Alun legger sammen to tall. I tillegg kommer da de andre som sier hvilke registre man skal lagre i.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0003", "start": 496.24, "end": 667.7, "token_count": 583, "text": "Og ad har et annet nummer. Den er 0100, som den er nummer fire. At når det kommer en ID-instruksjon, så oversettes disse åtte tallene her. Eller dvs. UPP-koden her er det som definerer hvilken instruksjon det er. De oversettes, så og så trykker man på de riktige knappene på Datapath, sånn at Alun legger sammen to tall. I tillegg kommer da de andre som sier hvilke registre man skal lagre i. De sier hvilket register skal jeg da legge seg i. Sånn som R0 pluss R1, og så resultatet legges i R0. Så alt dette er styrt av maskininstitusjonene. Og dette er nok det samme som i X86, bare at akkurat enkelttallene er annerledes. Nummereringen av institusjonene er annerledes. Men i prinsippet er alt akkurat det samme. Det er et spørsmål om... Hvis man skulle lagt inn 4, er ikke det med... Nei, det er et godt spørsmål fordi at vi har sett på... Vi kan gå tilbake, så kan vi se på... Instruksjonene til denne maskinen. Det hadde vi om på slutten forrige gang. Vi håpet kanskje litt raskt over det. Men her hadde vi... Så over på instruksjonene, hvordan de var definert. Og det jeg tenker... Den som spør referert til, er det ikke mulig å legge inn fire? Og nei, det er faktisk ikke mulig, fordi at vi ser... Her er det en institusjon som heter Move-e. Den kan brukes til å legge inn tall. Men så ser vi at den har to operander. Den første operanden er hvilket... Den andre operanden er selve tallet. Der er det bare satt av to bit til dette tallet. Dermed er det største tallet man kan legge inn, tre. Så for å legge inn fire til register, hva kan man gjøre da? Det er faktisk en oppgave, den siste oppgaven i dag, vi går ut på akkurat det, en utfordring. Jo, da kan man trikse det til ved at man først legger inn et tretall. Og så adderer man, og så får man et firetall. Men det er riktig, man kan ikke legge firetall rett inn.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0004", "start": 632.94, "end": 842.48, "token_count": 586, "text": "Dermed er det største tallet man kan legge inn, tre. Så for å legge inn fire til register, hva kan man gjøre da? Det er faktisk en oppgave, den siste oppgaven i dag, vi går ut på akkurat det, en utfordring. Jo, da kan man trikse det til ved at man først legger inn et tretall. Og så adderer man, og så får man et firetall. Men det er riktig, man kan ikke legge firetall rett inn. På andre arkitekturer så er dette fikset ved at man har flere bits. Sånn at et tall... Her er det kanskje da plass til 32 biter Som man kan legge inn. Dette er en veldig minimalistisk arkitektur. Men det finnes en del tilsvarende CPU-er for veldig enkle embedded systemer. Sånn vaskemaskin her, f.eks. Den første Intel... Eller en av de aller første Intel-integrerte kretsene, Intel 404, den hadde bare fire bit. Og det er størrelsesorden det denne her har også. Ca. 2000 transistorer totalt sett. Tilbake til simuleringen. Og et annet spørsmål er de ledningene som går mellom boksene på bussen. Ja, det er et godt spørsmål. Det er ikke det man vanligvis kaller databussen. Men det som man vanligvis kaller databussen, er dataene som går til RAM. Og det skal vi komme litt innpå etterpå. Så det som er databussen, vil i vårt tilfelle er de fire linjene her og de fire linjene her. Addresse out og data out. Og det er da en buss som går mellom CPU-en. Disse linjene internt, det er mer... Du kunne kalle det busser òg, men det er interne linjer i CPUD. Enda et spørsmål. Og det er kjempebra. Kommer flere spørsmål, så tar vi så mange vi rekker. Neste spørsmål var om Harvard-arkitektur. Og det er... Og det er et litt vanskelig spørsmål i denne sammenhengen. For det vi vet, er for Neumann-arkitekturen... Den er sånn at både instruksjoner og data sendes gjennom den samme bussen. Så det betyr at hvis dette hadde hatt en von Neumann-arkitektur,", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0005", "start": 789.38, "end": 981.9, "token_count": 590, "text": "Enda et spørsmål. Og det er kjempebra. Kommer flere spørsmål, så tar vi så mange vi rekker. Neste spørsmål var om Harvard-arkitektur. Og det er... Og det er et litt vanskelig spørsmål i denne sammenhengen. For det vi vet, er for Neumann-arkitekturen... Den er sånn at både instruksjoner og data sendes gjennom den samme bussen. Så det betyr at hvis dette hadde hatt en von Neumann-arkitektur, så skulle programmet som ligger her, det skulle ha ligget i RAM. Og maskinen skulle da lese inn institusjonene, og så utføre de institusjonene. Og samtidig, når den skulle skrive data, så skulle de gå ut disse kanalene til RAM. Så derfor ligger denne nærmere Harvard-arkitekturen. Og det er rett og slett fordi bussen, eller dataene fra institusjonene, følger en annen vei enn dataene fra variablene som lagres i ramm. Altså dataene som lagres i ramm. De har én buss. Og så er det en annen buss eller en annen kanal som går mellom institusjonene. Så derfor kan man si at dette er en hardware-arkitektur. OK. Da skal vi se veldig raskt på dette med bransjekontroll. Bransjekontroll er de kablene som går bort hit. Så ser vi her er det statusregister og load PC osv. Og det er ekstremt viktig for at man ikke bare skal fortsette ned. Nedover hele tiden. Og det går an å se at det skjer noe her... Jeg skal ikke gå inn i altfor mye detalj, men jeg kan legge på en liten kabel her på den bransjekontrolledningen. Og da vil vi se at når det blir et hopp i koden, så vil denne bransjekontrollen her sende en ener. Vi kan prøve å se på det først. Vi kjører litt nedover i koden. Hvis man følger med på den bransjekontrollen, den er null hele veien. Og så går vi nedover. Og så kommer vi et valg, og da ser vi. Her lyser det opp i bransjekontrollen. Og det er den forrige compere-instruksjonen.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0006", "start": 945.14, "end": 1140.9, "token_count": 594, "text": "Og da vil vi se at når det blir et hopp i koden, så vil denne bransjekontrollen her sende en ener. Vi kan prøve å se på det først. Vi kjører litt nedover i koden. Hvis man følger med på den bransjekontrollen, den er null hele veien. Og så går vi nedover. Og så kommer vi et valg, og da ser vi. Her lyser det opp i bransjekontrollen. Og det er den forrige compere-instruksjonen. Den har slått til. Jump not equal. Og da kommer jump not equal etterpå. Og den institusjonen gjør at det sendes en ener her. Her er et statusregister, et register som ligger inni her. Og det har lagret resultatet fra forrige operasjon. Vi gjør en compare først, og etterpå sjekker vi om vi skal hoppe. Og da er det basert på det som er lagret i statusregisteret. Så sendes det en ener. Og det betyr, hvis jeg går opp her til den PC-en som er program counter, den teller vanligvis bare nedover i instruksjoner. Sånn at den starter på null. Program counteren starter på null her oppe. Så blir den én, så blir den to, og så videre. Men akkurat her når det kommer et hopp, så vil program counteren settes til... Den verdien som man skal hoppe til. Og den ligger inne i institusjonen. Man skal hoppe da til linje nummer fire. Og da utfører maskinen et hopp. Og sånn... Og dette fører til at man ikke bare går rett gjennom programmet, men at man gjør en branch. Da skal vi se på... Da skal vi se på Ramm. Det vi skal prøve å gjøre nå, er altså å endre eller legge til en institusjon, sånn at maskinen skriver til Ramm. Da kan jeg legge programmet her, og så kan vi gå inn og... se på... Skal vi prøve... Vi kan lukke den av. Jeg må ha riktig peker, så skal vi prøve å komme inn i ramme der. Her er altså ramme. Dette er et ekstremt lite ramme, 16 ganger 4. Vanligvis er ramme på milliarder av bytes. Kan ha gigabyte med ramme. En bitte liten ram. Det er bare plass til 16 bites.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0007", "start": 1094.78, "end": 1285.94, "token_count": 592, "text": "Da kan jeg legge programmet her, og så kan vi gå inn og... se på... Skal vi prøve... Vi kan lukke den av. Jeg må ha riktig peker, så skal vi prøve å komme inn i ramme der. Her er altså ramme. Dette er et ekstremt lite ramme, 16 ganger 4. Vanligvis er ramme på milliarder av bytes. Kan ha gigabyte med ramme. En bitte liten ram. Det er bare plass til 16 bites. Og det er ikke bites engang, det er 4 bites. Så dette er... På en måte var halve bites. Hvis vi åpner den, så ser vi at dette her er bare 4 bits som er lagret for hver linje. Og det er totalt 16 linjer. Så kan vi legge merke til at her ligger det nå... Hva ligger her...? 2, 4, 8. Så det vi skal prøve å gjøre nå, er å legge resultatet fra beregningen inn i ramm. For det er det som vanligvis skjer i en beregning. Til å begynne med så skjer alle beregningene inni registrene lokalt i maskinen. Og så, til slutt, så skriver man resultatet ut i ramm. For å gjøre det, så trenger man da en instruksjon som gjør akkurat det. Da må vi gå tilbake hit, og så må vi se at... Jo, her er det to instruksjoner som vi ikke har brukt - load og store. Og store, den gjør akkurat det. Den lagrer resultater i ramm. Og så ser vi at denne instruksjonen er sånn at første operande er... Det er Destination Register, og andre er Source register. Så det betyr at vi må angi til slutt hvilket... Eller det tallet i et register. Eller et av registrene, så må vi ha adressen til dit vi skal legge det. Og da kan jeg f.eks. si at i R0, der ligger tallet 3. Så da kan jeg legge inn R av 3. Ut i ramm. Og så la oss si... I R1 så ligger vel tallet 1. Så jeg kan velge Destination Register. Det er som 1. Ja, nå sa jeg feil. R av denne, det er jo det som legges ut. Og den skal jo være R3, som resultatet vårt ligger i. Så jeg må ta R3.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0008", "start": 1241.42, "end": 1440.94, "token_count": 581, "text": "Eller et av registrene, så må vi ha adressen til dit vi skal legge det. Og da kan jeg f.eks. si at i R0, der ligger tallet 3. Så da kan jeg legge inn R av 3. Ut i ramm. Og så la oss si... I R1 så ligger vel tallet 1. Så jeg kan velge Destination Register. Det er som 1. Ja, nå sa jeg feil. R av denne, det er jo det som legges ut. Og den skal jo være R3, som resultatet vårt ligger i. Så jeg må ta R3. Og så legge ut i en gitt adresse. Og det viktigste er store. Det er 1010. Vi bruker litt tid på dette, for dette her er... Dette er hvordan man programmerer en maskin direkte i maskinkode. Heldigvis så slipper vi å gjøre det med Exo86. Da har vi compulatorer som fikser den jobben, men nå skal vi prøve å gjøre det. Det er da altså Store. Og da må jeg gå inn i R-rommet her oppe. Nå er jeg over i Rom, så nå er det Instrukt maskininstruksjonene. Så tenker jeg nå at nå kan jeg legge til en maskininstrukt 2. Oi... Vi ser ikke. Supert. Bra du sier ifra. Ja, da går jeg... litt tilbake. Det jeg skal prøve å gjøre nå, er å legge til en... En institusjon som lagrer sluttresultatet, som ligger i R3, inn i ramm. Går jeg nå ned til institusjon nummer åtte, altså etter den siste jumpen... For i dag fortsetter programmet bare nedover. Og så må jeg her... må jeg skrive inn riktig institusjon. Og det var vel... Institusjonen var 1.01.0 for Store. Skal jeg passe på å gå tilbake... Sånn. Så må jeg gå inn her. Og skrive 1,0, 1,0. Og så ønsker jeg å lagre det som ligger i R3. Og det var... Da skulle jeg skrive 3 der. For det betyr legg verdien av register 3 i denne adressen. Adressen er nå 0,0. Men la oss si jeg bruker R1. Altså det tallet som ligger i R1. Sånn. Har jeg programmert en linje,", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0009", "start": 1398.66, "end": 1616.12, "token_count": 600, "text": "Skal jeg passe på å gå tilbake... Sånn. Så må jeg gå inn her. Og skrive 1,0, 1,0. Og så ønsker jeg å lagre det som ligger i R3. Og det var... Da skulle jeg skrive 3 der. For det betyr legg verdien av register 3 i denne adressen. Adressen er nå 0,0. Men la oss si jeg bruker R1. Altså det tallet som ligger i R1. Sånn. Har jeg programmert en linje, så må jeg i denne editoren gå ett hakk ned, og så er det lagret. Ok. Da kan jeg prøve å kjøre, og så prøver jeg å se i Ramm etterpå om dette fungerer som det skal. Så da fortsetter jeg å kjøre programmet. Hva betyr R1 her? R1 er da... Det er da adressen i ram. Det er den linjen i ram som resultatet skal lagres i. Så etter kjøringen så er vel R1 lik 1, og da skal resultatet lagres i rammelinje nummer 1. Nå kjører vi sakte gjennom. Nå har vi fått ut tallet 6 i R3. Og så ser vi... Nå hopper vi ikke. Nå lyste det ikke her. Så vi hopper ikke, og nå utføres da ram-operasjonen. Og det den skal gjøre... Nå er den ferdig. Det er... Den skulle legge resultatet, det som ligger i R3, altså tallet 6, i... Iram på adresse 1 sin RR1. Da må vi bare gå inn og sjekke. Iram, har dette skjedd? Hvis vi er heldige, så har vi fått til det. Skal vi se. Oi. Ja, faktisk så har vi fått dette til å virke. For vi ser... Dette er adresse 0. Men dette er adresse 1. Og her har vi lagret tallet 6, som var sluttresultatet. Og det er nøyaktig slik det virker på X86 også. F.eks. lagre en integersum, som resultatet 6 skal legges i, eller integer S, som vi vel brukte... Så er det en kobling sånn at S ligger på en spesiell adresse. En eller annen adresse i RAM. Her ser vi at S ligger i adresse 1. Så det vi gjorde akkurat nå, var å programmere maskinkode som lagret sluttresultatet i RAM.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0010", "start": 1569.78, "end": 1782.54, "token_count": 593, "text": "Og her har vi lagret tallet 6, som var sluttresultatet. Og det er nøyaktig slik det virker på X86 også. F.eks. lagre en integersum, som resultatet 6 skal legges i, eller integer S, som vi vel brukte... Så er det en kobling sånn at S ligger på en spesiell adresse. En eller annen adresse i RAM. Her ser vi at S ligger i adresse 1. Så det vi gjorde akkurat nå, var å programmere maskinkode som lagret sluttresultatet i RAM. På adresse 1. Og det gjøres hele tiden i vanlig kode. Kan man lagre ting på adresse 0 også? Ja. Hvis jeg ønsket å lagre noe i adresse 0, så måtte jeg bare endret på den maskinkoden her nede på kode 8. Og da hadde det ikke vært så lett egentlig å... Da kunne jeg ikke bare brukt én institusjon, for det jeg da måtte gjort først, var å ta en move-i-institusjon, legge tallet null i r1. Før denne institusjonen. Eller så kunne jeg beholdt institusjonen, for da ville jeg... Hvis jeg før dette la inn tallet null i r1 med move-in, move-i, og så etterpå utført... Så vil jeg oppnå akkurat det og lagre resultatet på adresse 0. Ja... Så... Så det betyr at på denne måten så kan man programmere CPU-en. Og dette skjer da om og om igjen inni programmer. Og det vi skal se på sånn konkret nå, er hvordan vi... Hvordan dette helt tilsvarende skjer når vi kompilerer C-programmer og får ut maskinkode. Vi tar oss tid til et par spørsmål til. Så det var en oppsummering her. Vi brukte bare verdien til R1, som altså var 1, som referanse til en adresse vi skulle lagre. Helt riktig. F.eks. om R1 hadde vært lik 2, så hadde vi lagret adresse 2 i RAM. Det er helt riktig, og dette er veldig viktig, så det må vi ha med videre. For hele tiden refererer vi til RAM. Så vi kan vise et eksempel på det. F.eks. hvis jeg... Det heter R3 på begge. Da betyr de... Legg svaret som ligger i R3, i adressen som har samme nummer som R3.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0011", "start": 1740.3, "end": 2001.26, "token_count": 593, "text": "som referanse til en adresse vi skulle lagre. Helt riktig. F.eks. om R1 hadde vært lik 2, så hadde vi lagret adresse 2 i RAM. Det er helt riktig, og dette er veldig viktig, så det må vi ha med videre. For hele tiden refererer vi til RAM. Så vi kan vise et eksempel på det. F.eks. hvis jeg... Det heter R3 på begge. Da betyr de... Legg svaret som ligger i R3, i adressen som har samme nummer som R3. Så det vil da være... Hvis jeg lagrer den... Nå bør tallet 6 da lagres på adresse nummer 6. Klikker gjennom fra starten av nå. Altså klikker raskt igjennom. Vi kan jo følge med her. Så ser vi... Der kommer først tre. Så blir svaret seks. Og der... Nå skal vi da legge... Det den skal gjøre, er å legge svaret seks inn i adresse nummer seks. Og da kan vi gå inn i RAM, og så kan vi se... Har det det som har skjedd...? Ja, da ser vi her nede. På adresse 6 så ligger nå resultatet som også er tallet 6. Så nøyaktig på den måten så er det maskinkode aksesserer RAM. Det er en ny remse med adresser, som er adresser til én og én byte. Ok. Da... Da avslutter vi den... den delen. Og det vi skal se på nå, det er da... Vi kan begynne så vidt. Hvordan dette ser ut i en X86-maskin når vi kjører Linux-programmer. Da skal jeg gå inn på Studies SO. Sånn som... oi... Det så ikke så bra ut. Jo, det var bare en feilstavelse. Studies og så, skal vi gå med på. Og alle C-programmer. For å kunne få til å skrive ut noe, så trenger vi det Standard-in-out. Std.io. Dette er et bibliotek som vi inkluderer. Og så har alle C-program det. Jeg har en maine, altså en hovedfunksjon eller hovedmetode. Og i praksis så kan man kjøre alt inn i maine. Og i dette enkle programmet så er det eneste som jeg gjør, er å skrive 'Tellow World' med funksjon printf. Og for å få dette her til å kjøre, så må vi kopulere.", "source": "lecture"}
{"lecture_id": "os4time1", "chunk_id": "os4time1_0012", "start": 1953.76, "end": 2138.74, "token_count": 543, "text": "For å kunne få til å skrive ut noe, så trenger vi det Standard-in-out. Std.io. Dette er et bibliotek som vi inkluderer. Og så har alle C-program det. Jeg har en maine, altså en hovedfunksjon eller hovedmetode. Og i praksis så kan man kjøre alt inn i maine. Og i dette enkle programmet så er det eneste som jeg gjør, er å skrive 'Tellow World' med funksjon printf. Og for å få dette her til å kjøre, så må vi kopulere. Og da gjør vi den operasjonen om å oversette... Fra høydenivåkode til maskinkode. Så for å kjøre dette programmet så bruker jeg kompulatoren GCC. En standard Linux-kompulator. Og det som skjer da, er at det lages... En exequerware-fil med maskinkode som heter Adapt. Og når jeg kjører den, så skrives Hello World ut. Da må vi vite at... Eller vi kan se på AdOtOnt, og vi ser den er ganske stor. Den er på 8600 bytes. Så dette er tydeligvis mye mer enn bare akkurat kode for å skrive ut den. Og det er bl.a. fordi det inkluderes et bibliotek her oppe. Så den inneholder masse kommunikasjon med operativsystemet, f.eks. Man kan også, som vi skal gjøre etter hvert... Man kan også kalle dette noe annet enn Adapt. La oss si jeg ønsker å kalle det Hello. Da får jeg en Feel Hello, som er nøyaktig den samme som Adapt. Og så, når jeg skal kjøre det, så kjører jeg det med Hello. Så dette skal vi gjøre en masse nå. Vi skal lage... Og kompilere det... Men det vi skal studere, er at i bakgrunnen så lages det maskinkode. Og vi skal se på hvordan denne maskinkoden, som da faktisk lages når vi kompilerer C-programmer på en Linux-maskin, den er så å si identisk med den maskinkoden som vi lagde til simulering. Men nå ser jeg vi trenger en liten pause her. Da tar vi pause til 9.30. Still gjerne spørsmål i pausen.", "source": "lecture"}
