{"lecture_id": "os5del5", "chunk_id": "os5del5_0000", "start": 0.0, "end": 189.3, "token_count": 586, "text": "Her har jeg en kode som heter 1-linje. Og det er kode som... som viser én linje i... Én linje i... høynivåkode. Og det som er fokus her, det er at vi skal se at det ikke er en én-til-én-avhengighet. Fra høynivåkode til maskinkode. Så vi kan se på strukturen av dette programmet først, sånn at vi skjønner hvordan det virker. For det første så har vi da en ekstern metode som heter 1-linje. Og dette er min, main, og den kaller da 1-linje. Så igjen så skal vi fokusere på koden i 1-linje. Og se hvordan den ser ut. Og en linje.c. Den ser rett og slett sånn ut. Så... Her ser vi. Det er et veldig enkelt svar som regner ut meningen med livet. Som dere vet er svar på at meningen med livet er 42. Så denne regner ut dette svaret. Og det gjør vi ved å bare sette opp to variabler - svar og memoar. Det er altså en variabel i minnet. Begge to. Og så gjør vi én institusjon her, som er svar er lik svar pluss memoar. Og det som er det viktigste med det vi gjør nå, er at...  Én sånn linje i høyneverkode. Denne kan umulig gi en enkel linje i maskinkode. Det er ikke mulig fordi det ikke finnes instruksjoner som gjør en så kompleks operasjon i X86-instruksjonssettet. Alt dette må jo oversettes til X86-instruksjoner som utføres. Grunnen til at dette er viktig, er at når vi senere skal se på sånn som multitreading, Og det å switche ut prosesser... Da skal vi ta en prosess, og så skal vi stoppe den midt i det programmet den gjør, og så skal vi sette i gang andre prosesser på samme CPU. Da er det veldig viktig for operativsystemet å ha kontroll på hvilken prosess er det som gjør hva? Hvilken funksjon denne prosessen gjør, osv. Da er det som programmerer, og når vi ser på det selv, er det lett å tenke sånn at... Her har vi det programmet som prosessen kjører,", "source": "lecture"}
{"lecture_id": "os5del5", "chunk_id": "os5del5_0001", "start": 153.5, "end": 371.5, "token_count": 599, "text": "Da skal vi ta en prosess, og så skal vi stoppe den midt i det programmet den gjør, og så skal vi sette i gang andre prosesser på samme CPU. Da er det veldig viktig for operativsystemet å ha kontroll på hvilken prosess er det som gjør hva? Hvilken funksjon denne prosessen gjør, osv. Da er det som programmerer, og når vi ser på det selv, er det lett å tenke sånn at... Her har vi det programmet som prosessen kjører, og her utføres det én institusjon, og den er denne linjen. Men i virkeligheten så utfører prosessene ikke høynivåkode, men de utfører maskinkode. Så det vi skal se på nå, er hvordan denne ene linjen med høynivåkode Flere linjer med maskinkode. Og det vi må gjøre da, er... Vi må prøve oss igjen og kompilere den. Og så må vi se hvordan maskinkode GCC lager. Så... Det jeg skal prøve nå, er å be GCC lag maskinkode. Denne C-koden. Og så kan jeg se på den. Ja, igjen så ser vi at... Her brukes da hele tiden referanser til minnet. Sånn som den første linjen her. Legg 32 i... på denne. Og 32, det var den første. Så legger vi ut den. Og så ser vi at denne verdien, altså det titallet, det legges i IX. Og så gjøres den adlong, verdien i IX. Den har vært ti. Den verdien som lå i variabelen... Skal vi se... Hva var det vi kalte den variabelen? Svar. Så opplegget er nå... Kompilatoren bestemmer seg for at denne adressen... Denne adressen, her skal variabelens svar ligge. Minus åtte bite fra toppen av området ram. Der skal variabelen svar ligge. Og menvar, den skal ligge fire bite fra toppen. Så de får nå hver sin plass i ram. Og så ser vi... Der legges tallet 10 i eax med movel. Og så ser vi man adel... Altså legg til eax til variabelen svar. Svaret 42 ligger her i RAM. Programmet flytter nå svar inn til EAX. Hvorfor gjør det det? Jo, det er fordi når du returnerer en metode, en funksjon, en C-funksjon,", "source": "lecture"}
{"lecture_id": "os5del5", "chunk_id": "os5del5_0002", "start": 333.36, "end": 514.44, "token_count": 598, "text": "Og menvar, den skal ligge fire bite fra toppen. Så de får nå hver sin plass i ram. Og så ser vi... Der legges tallet 10 i eax med movel. Og så ser vi man adel... Altså legg til eax til variabelen svar. Svaret 42 ligger her i RAM. Programmet flytter nå svar inn til EAX. Hvorfor gjør det det? Jo, det er fordi når du returnerer en metode, en funksjon, en C-funksjon, så forventes det av C at svaret, returverdien, ligger i EAX. Dermed oppfører rutinen seg som den skal. Her ser vi... Jo, her... Her er den linjen som i høynivåkode var én linje. Den er da oversatt til tre linjer av kompulatoren. Man vet ikke hva kompulatoren gjør. Vanligvis vet man ikke det. Så man må alltid regne med at kompulatoren kan dele det opp i flere linjer. Når vi senere skal drive med multitasking, kan ikke operativsystemet vite Den switcher. Eller det vil si... Operativsømme vet når når det switcher fra en prosess til en annen. For nå kan vi tenke oss at denne prosessen står og kjører, og så kommer det kanskje en annen prosess, som er en webserver, som skal gjøre noe helt annet. Men denne prosessen som står her og kjører, den må stoppes her og fryses. Og så må den etterpå gjøre neste operasjon. Det kan være avgjørende for om programmet virker som det skal. Vi skriver til og fra minne, og da kan det være andre programmer som bruker den samme variabelen med minne. Og da kan de bli sure, hvis ikke de gjør det i riktig rekkefølge. Dermed er det veldig viktig at én sånn institusjon kan føre til flere institusjoner i maskinkoden som virkelig kjøres. Som jeg er nødt til å være klar over og forholde seg til. Generelt kan man ikke vite hvordan det fungerer, men kan man på en måte tvinge Jesus og Jeg til å bare lage én linje? Og i dette tilfellet så kan man ikke det heller. Man kan ikke det heller fordi... Som jeg har sagt tidligere, så er ikke det mulig å ha en sånn operasjon. Men vi kan se hva... Vi kan spørre GCC.", "source": "lecture"}
{"lecture_id": "os5del5", "chunk_id": "os5del5_0003", "start": 468.4, "end": 574.98, "token_count": 268, "text": "flere institusjoner i maskinkoden som virkelig kjøres. Som jeg er nødt til å være klar over og forholde seg til. Generelt kan man ikke vite hvordan det fungerer, men kan man på en måte tvinge Jesus og Jeg til å bare lage én linje? Og i dette tilfellet så kan man ikke det heller. Man kan ikke det heller fordi... Som jeg har sagt tidligere, så er ikke det mulig å ha en sånn operasjon. Men vi kan se hva... Vi kan spørre GCC. Hvis du skal lage raskest mulig kode av denne funksjonen her, hvordan vil den se ut? Da ber vi om det, og så ser vi på den. Ja... Da får vi det samme problemet igjen. Vi får på en måte ikke se den koden, fordi at her så ser vi... Uansett hva vi måtte finne på her, så får vi flytte det opp. Så det er en gøy liten start der, og jeg liker det. Men... Men generelt så... Vil det være umulig å lage en kodelinje som adrerer sammen to tall?", "source": "lecture"}
