{"lecture_id": "os5del10", "chunk_id": "os5del10_0000", "start": 0.0, "end": 251.32, "token_count": 583, "text": "Jo... Hvis vi tenker oss... At denne boksen er CPU-en. Håper det ser OK ut nå. Så inni CPU-en, så ligger da de registrene. AXBXCX osv. Og de er registre sånn som vi hadde i simuleringen. I simuleringen så var registerstørrelsen 4-bit. Her. Ax er egentlig enda lengre. Den er på 32-bit. Nei, forresten. Den er 16-bit. Eax er på 32-bit, og rax er på 64-bit. Så da er det bare lengre ri. Og... med nuller og enere. Og så inni CPU-en så har vi da en alu. Og da har vi sett tidligere at det som skjer inni CPU-en, er at du har en kanal fra registrene av XBX som går inn i aluen. Etter at Alun har gjort beregninger, den kommer tilbake til registrene. Så her kan vi sitte og regne og holde på. F.eks. de Fibonacci-tallene. De regnes ut lokalt inne i CPU. Men så begynner vi å gjøre institusjoner sånn som Move. Da vi f.eks. hadde en institusjon sånn som... Sendt eax til svar i den koden som vi kjørte nå nettopp. Så betyr det flytt resultatet av det vi hadde, til ram. Så dette er ram. Og ram skal vi studere senere i detalj. Det er egentlig bare et svært reim med bites. Her er det, skal vi se... Åtte bit. Så dette er da adresse null i ramm. Så dette er adressen i ramm. Så... Det vi holder på med når vi sier move prosent EAX til svar, det er at vi ønsker å legge verdien av EAX fra CPU-en og så ut i ramm. Og så kan det godt være at... Hvis så... La oss si den svaret er long, da. Hvis jeg har definert en variabel som long, så er den på fire bytes. Da betyr det at det settes av fire biter i ram. Og dette her er da de fire bitene til svar. Det vi så i koden, det var noe sånt som minus fire prosents RDB eller noe i den stillingen her. Hvor dette er da... Det er et register. Men det inneholder et tall. Så dette er en adresse. Og den adressen kan f.eks. være til rammelinje nummer 357.", "source": "lecture"}
{"lecture_id": "os5del10", "chunk_id": "os5del10_0001", "start": 199.2, "end": 416.0, "token_count": 575, "text": "Hvis jeg har definert en variabel som long, så er den på fire bytes. Da betyr det at det settes av fire biter i ram. Og dette her er da de fire bitene til svar. Det vi så i koden, det var noe sånt som minus fire prosents RDB eller noe i den stillingen her. Hvor dette er da... Det er et register. Men det inneholder et tall. Så dette er en adresse. Og den adressen kan f.eks. være til rammelinje nummer 357. Og det er minus 4. Det betyr at det er den adressen minus 4. Så dette her, når du ser det i et asemblerprogram, så peker det til et eller annet sted i ramm. Og den inneholder da en adresse, som er den adressen her. Hvilket nummer... Hvilket bite i ram som skal legges der. Så det som skjer med den institusjonen her, det er at man tar de verdiene som lå i Ax, og så legger man ut her. De 32 bitene får da plass i det som er satt av i ramm til de 32 bitene. Og når man skriver kode... Hvis man skriver kode sånn som dette her... Int svar er lik 42. Så det kompulatoren gjør da, nå som vi kan gjøre direkte i assembly... Finne en plass her i ram, og så skrive inn ener og nullere som tilsvarer 42, sånn at du lagrer dataene. Men når vi da gjør operasjoner sånn som add, så... Så opererer da add på registrene. Men en add-operasjon kan også operere på en variabel. Og et register samtidig. Så vi kan f.eks. si add % eax til svar. Så hvis jeg gjør en sånn... Hvis jeg gjør en sånn operasjon, så sier jeg ta det tallet som ligger i eax... Kanskje det er et tall 10 som ligger der. Og legg til svar. Og så ligger det allerede 32 her i svar. Og så ligger det kanskje... Her ligger det 10 i det eksempelet vi hadde. Denne maskininstitusjonen her, den vil nå utføre operasjonen at den tar det tallet 10 og legger til 32, sånn at etter denne institusjonen er utført, så står det 42 her.", "source": "lecture"}
{"lecture_id": "os5del10", "chunk_id": "os5del10_0002", "start": 374.76, "end": 540.44, "token_count": 494, "text": "Hvis jeg gjør en sånn operasjon, så sier jeg ta det tallet som ligger i eax... Kanskje det er et tall 10 som ligger der. Og legg til svar. Og så ligger det allerede 32 her i svar. Og så ligger det kanskje... Her ligger det 10 i det eksempelet vi hadde. Denne maskininstitusjonen her, den vil nå utføre operasjonen at den tar det tallet 10 og legger til 32, sånn at etter denne institusjonen er utført, så står det 42 her. Det er klart at dette er hardware-kodet, altså denne institusjonen, på en sånn måte at først må verdien 32 som ligger her, sendes på databussen fra RAM til CPU. Her er databuss. Og det skjer da. Når man utfører en sånn operasjon som dette. Men det er hardware-kodet på forhånd, at når den institusjonen der utføres, så tar man først 32 og legger det inn her i et register. Og så legges det tallet sammen med AX gjennom aluen, for det tallet 32 må selves. Det går via registeret, og så lagres det ut igjen i mellomlagrets resultat. Og så lempes det ut via databussen ut hit, sånn at 42 lagres. Nøyaktig hva som skjer ved en institusjon, det er brent inn i kretskortet i hardware. Så det er liksom forhåndsbestemt hvordan dette skjer. Det eneste vi som programmerere vet, og det eneste operatørsystemet vet, er at resultatet blir sånn som det. Dette vet kompulatoren om, så den kan i stedet for å lage instruksjoner som da går inn og ut av databussen, som tar tid, så prøver den å optimalisere og gjøre mest mulig med registeret her inne. For da trengs ikke den lange ferden ut på databussen og ut til ham. Det fungerer.", "source": "lecture"}
