{"lecture_id": "os5del4", "chunk_id": "os5del4_0000", "start": 0.0, "end": 198.92, "token_count": 581, "text": "Det var den funksjonen... Sumfunksjonen. Denne. Og... Det vi så på sist, var at vi ba GCC om å lage assemblekode for den. Så så vi hvordan den så ut. Vi kan repetere det. Jeg ba... GCC om da å lage assemblerkode. Og den skulle da bli sum funksjon dos bes. Og den så ut som noe sånt som dette her. Så fant vi ut... Hvis vi går inn og ser i detalj, så ligner den veldig på den maskinkoden vi hadde i simuleringen. Bortsett fra denne skriver nå ut til minnene. Vi ser deg hele tiden. Men i prinsippet ligner koden veldig. Lager løkker på samme måte. Men det vi skulle se på nå, var hva skjer med denne funksjonen hvis jeg ber om lag så effektiv kode som bare mulig? Jo, da kan vi prøve å se hva som skjer, da. Da får jeg en ny assembly-kode. Og denne er da lagd av GCC for å være mest mulig effektiv. Og da ser vi ganske overraskende at her var det ikke veldig mye kode. Noen som klarer å se hva denne koden her gjør. Den skal jo regne ut en hel sum, men det er veldig få instruksjoner her. Og det som da viser seg, er at kompilatoren er faktisk da så smart... Det er klart at den ser vel uansett hva som skjer med input og output i denne metoden. Uansett når denne kjøres, så vil du regne ut en sum 1 pluss 2 pluss 3 som blir 6. Så den gjør da faktisk den optimale optimaliseringen. Den regner ut hele løkka, og så kommer den fram til at svaret blir seks. Så svarer 6 ut i AX, og så returnerer det. Så det er morsomt nok. Så er det den optimale... Den optimale versjonen av dette... Av denne løkka her. Det er jo bare å returnere tallet 6. Det virker jo litt overraskende, men det er helt logisk. GCC går nå inn for å lage... Den hurtigst mulige versjonen av denne koden. Og det er da faktisk bare å returnere tallet seks. Med en gang du får et input her, eller det kan skje andre ting, så er det klart, da kan man ikke optimalisere på den måten.", "source": "lecture"}
{"lecture_id": "os5del4", "chunk_id": "os5del4_0001", "start": 162.56, "end": 209.0, "token_count": 155, "text": "Den optimale versjonen av dette... Av denne løkka her. Det er jo bare å returnere tallet 6. Det virker jo litt overraskende, men det er helt logisk. GCC går nå inn for å lage... Den hurtigst mulige versjonen av denne koden. Og det er da faktisk bare å returnere tallet seks. Med en gang du får et input her, eller det kan skje andre ting, så er det klart, da kan man ikke optimalisere på den måten. Så hvis vi la til et input, så ville du sett at det fortsatt var en løkke, men at programmet da stort sett bare brukte registeret.", "source": "lecture"}
