{"lecture_id": "os5del1", "chunk_id": "os5del1_0000", "start": 0.0, "end": 187.1, "token_count": 593, "text": "Der er oversikten. Det kanskje viktigste denne uken er at det er frist for oblig-innlevering på fredag. Og oblig-en består i alle de deloppgavene som har vært fra de siste ukene, men da ikke fra uke fem. Altså ikke oppgavene denne uken. Det er vel til og med... Denne uken. Uke fire. Når du er ferdig med obliger denne uken, kan obligen leveres inn. Så alle oppgavene fra uke fire skal leveres inn her. Så det jeg håper dere gjør, er at dere jobber jevnt hver uke. Og da vet dere hva som er obligatorisk, så gjør dere de oppgavene. Ja, altså, Ine... Du hører meg? Ja. Vi har snakket litt med... Litt om de som av forskjellige grunner er alene på en gruppe. Spesielt nå er det ikke alltid så lett å få til samarbeid. Men uansett så tenker jeg det er fornuftig å så på en måte lempe litt på kravet til god kjærlighet. Ja. Det er gøy. Jeg tenker det er rimelig. For det kan være litt ekstra utfordrende. Det er ganske mye oppgaver. Men det aller viktigste å gjøre etter kurset er å jobbe dere gjennom oppgavene. Jeg var jo alene selv da jeg leverte. Jeg husker jo det var ganske mye mer ekstra jobb. I beregningen. Ja. Altså når vi vurderer godkjent, ikke godkjent. Ja, men det høres veldig rimelig ut. Ja. Bra. Som vanlig så er det så har jeg lagt ut digitale videoer om Shellscript. Jeg ligger litt etter deg, så jeg har ikke fått ferdig de helt siste videoene jeg får i løpet av dagen eller i morgendagen. Og så skal jeg også legge ut flere videoer om bæsj-scripting. Så det er skjellscripting som er fokus nå. Og da blir det litt mer avanserte skjellscript. Og så fra neste uke, jeg tenker dere kanskje prøver å få til det i løpet av uken, så skal jeg dele ut virtuelle maskiner til alle, sånn at alle får en virtuell maskin som dere kan logge inn på med en publikk IP-adresse. Hvor dere kan styre alt selv. Lage webservere osv.", "source": "lecture"}
{"lecture_id": "os5del1", "chunk_id": "os5del1_0001", "start": 150.0, "end": 212.98, "token_count": 217, "text": "Og så skal jeg også legge ut flere videoer om bæsj-scripting. Så det er skjellscripting som er fokus nå. Og da blir det litt mer avanserte skjellscript. Og så fra neste uke, jeg tenker dere kanskje prøver å få til det i løpet av uken, så skal jeg dele ut virtuelle maskiner til alle, sånn at alle får en virtuell maskin som dere kan logge inn på med en publikk IP-adresse. Hvor dere kan styre alt selv. Lage webservere osv. Egentlig er det ikke virtuelle maskiner. Det er dokkerinstanser som ser ut som virtuelle maskiner. Men uansett så skal vi bruke de fra neste uke, og så uken etter der igjen så skal vi begynne å kjøre dokkercontainere på disse VM-ene. Egentlig er det... Men det kommer vi tilbake til.", "source": "lecture"}
