{"lecture_id": "os5del6", "chunk_id": "os5del6_0000", "start": 0.0, "end": 224.08, "token_count": 591, "text": "Jo... Her har jeg skrevet... Assembly-kode, som kanskje er den raskeste til å utføre akkurat dette her. Vi kan se på dette. Dette er kode som en assembly-programmerer skriver. Man kan sette seg ned og skrive assembly-kode for X86, og så kan man inkludere der. Da er det assembleren som lager maskinkoden av denne her. Og maskinkode, stort sett så oversettes den linje for linje. Når jeg skriver... så oversettes det av assembleren til maskinkode ved at move oversettes til det nummeret move har i instruksjonssettet. Det som er forskjellig fra forrige gang, som kommer i tillegg, det er her nede. Så ser vi at vi har et datafelt. Og dette er måten man legger variabler i ram på. Så denne linjen her, den sier lag en variabelsvar og legg i ram. Det betyr lag 1... eller lagre 64 bit. Så denne vil lage 8 byte som inneholder denne variabelen. Og den vil inneholde tallet 32. Og så kan vi se... Så det første jeg egentlig trenger, er å definere funksjonen én linje. Så den global gjør at jeg kan bruke denne funksjonen fra main. Skal gjøre det etterpå. Én linje. Det er en standard start av funksjonen. Og så det jeg gjør først, er... Nå! Den dataen her nede betyr at jeg allerede har lagd tallet 32 i... Nei, her har jeg lagd tallet 10 i memoar. Så det første jeg gjør, er å flytte memoar til RBX. Og så legger jeg til RBX til svar, altså til svar som da ligger i ramm. Så denne ad-operasjonen her, den utføres på et register og et tall i ramm. Så det som utføres her nå, det er at i tallet 10 ligger RBX. Så flytter jeg svaret ut i rax. Når jeg returnerer, returneres verdien i rax. Det er et spørsmål om du kan gjenta hva... Ja, supert. Ja, kode betyr at det skal være... At det skal settes av 64 bit. Det er 32 bit, og kode er 64 bit. Så den sier rett og slett... Sett av 64 bit, eller av 8 bytes, til denne variabelen.", "source": "lecture"}
{"lecture_id": "os5del6", "chunk_id": "os5del6_0001", "start": 172.04, "end": 299.96, "token_count": 318, "text": "Så det som utføres her nå, det er at i tallet 10 ligger RBX. Så flytter jeg svaret ut i rax. Når jeg returnerer, returneres verdien i rax. Det er et spørsmål om du kan gjenta hva... Ja, supert. Ja, kode betyr at det skal være... At det skal settes av 64 bit. Det er 32 bit, og kode er 64 bit. Så den sier rett og slett... Sett av 64 bit, eller av 8 bytes, til denne variabelen. Jeg tror hvis... Jeg husker ikke helt hvis man... Det er mulig det er.long, tror jeg det står, hvis du skal sette av 32 bit. Så det er det kode betyr. Ja... Og hvorfor er det et sånt tegn? Det er bare en kommentar. Ok. Men det vi skal se på nå, er... Først kan vi se på hvordan vi kan kjøre denne her. Så den kan jeg da kjøre ved å skjøtte den sammen med én linje main. Og enl.s, sånn. Og så kjøre add-og-dots, og da ser vi at den funker som det skal. Så hvis jeg her nå starter med 22 i stedet, så... Vi får sjekke at vi faktisk... Ja, så svarer den...", "source": "lecture"}
