{"lecture_id": "os6del9", "chunk_id": "os6del9_0000", "start": 0.0, "end": 201.8, "token_count": 595, "text": "I operativsystemhistorien så... den er ikke fullstendig. Men jeg har bare tenkt å se litt på tidligere Microsoft og Unix-operativsystemer. Som kanskje har vært de mest sentrale operativsystemene, i hvert fall de siste 30 årene. Mac er også et sentralt operativsystem. Først en kort oversikt over Microsoft Destop-OS og Server-OS. Og så tilsvarende for Unix og Linux. Ja. Destop-OS... Jeg sa 30 år, men dette er faktisk 40 år siden. MS-DOS kom ut. Det var et 16-bitt operativsystem. Etter hvert så ser vi at det kom 32 bits, sånn rundt 2000 er vel kanskje enda litt. Nei, under Vinos 95 var det noe 32-bits. Og her omtrent så var det en sånn overgang fra CPU-er med 16 til 32-bit. Og så etter hvert rundt år 2000 så ble 64-bits vanlig. Det er det aller vanligste nå med 64-bits CPU-er. Systemet må da tilpasse seg sånn at det kan løse alt med 64-bit. Det som gjorde Windows til en ekstrem suksess på 90-tallet, det var først og fremst at det hadde en veldig intuitivt og enkelt brukergrensenett, som gjorde at det etter hvert ble allemannseie å ha en PC. Ganske så ustabile. Mye mer ustabile enn de Unix-serverne som styrte alt på servicesiden på denne tiden. Det var vel først kanskje rundt 2000 med XB at det virkelig fikk en bra og stabil... Et godt og stabilt Windows-operativsystem. Og det som gjorde det, var at det kombinerte... Det hadde samme kjerne som endte 5-1, så det var en... Man skrev rett og slett hele operativstemmen helt fra scratch. Så det var en helt annen operativstemme enn en DOS-operativstemme som kom 20 år senere. Så er Windows 7 altså en veldig stabil versjon. Og nå er det Windows 10 som gjelder, som kom for fem-seks år siden, 2015. Tidligere ser vi at det kom hele tiden nye versjoner med XB, Vista, 7, Windows 8 osv. Og Windows 10. Men nå ser det ut som man bare har mindre endringer på Windows 10. Sånn at det ikke kommer noen Windows 12 eller 13 eller...", "source": "lecture"}
{"lecture_id": "os6del9", "chunk_id": "os6del9_0001", "start": 158.92, "end": 356.4, "token_count": 592, "text": "enn en DOS-operativstemme som kom 20 år senere. Så er Windows 7 altså en veldig stabil versjon. Og nå er det Windows 10 som gjelder, som kom for fem-seks år siden, 2015. Tidligere ser vi at det kom hele tiden nye versjoner med XB, Vista, 7, Windows 8 osv. Og Windows 10. Men nå ser det ut som man bare har mindre endringer på Windows 10. Sånn at det ikke kommer noen Windows 12 eller 13 eller... Opprinnelig hadde det med året å gjøre. Vindows 2000 kom i år 2000. Windows 10 var et godt stykke etter 2010. Men det som kanskje er viktigere, er at tidligere når man lagde software generelt, så hadde man sånne store releaser med store endringer. Og det kunne ta kanskje et par år. Nå kommer det en ny release av Windows. Og dette programmet testet man og holdt på i et par år, og så fikk man en release. Man tester ut endringene og releaser hele tiden. Eller mye oftere enn tidligere. Det samme gjelder Linux-distribusjoner og Linux-kjernen også. Man kommer hele tiden med mange små endringer som kontinuerlig blir testet. Det er også en generell utvikling i software development. Ja... Her er det diverse Windows 10-versjoner. Ja, altså jeg har ikke fått med den siste. Den kom i siste halvdel av 2020. Mulig det har kommet noen enda nyere der. Der må dere ut på Wiki og sjekke ut. Spørsmålet i Chetn anbefaler du Linus eller Windows? Ja, jeg har rett personlig. Jeg anbefaler Linux. En av de få som alltid har kjørt Linux. Eller iallfall så lenge Linux har eksistert. Jeg kjører jo Windows også, og jeg har en gammel Mac. Men jeg anbefaler Linux fordi man har veldig stor frihet. Altså man kan mekke og hacke og legge inn hva som helst. Det har jo sine ulemper også. Det er klart at hvis man gjør for mye krumspring, så kan ting også gå galt. Men man har en veldig stor frihet, og så er alt åpen kildekode. Det har også endret seg når det gjelder Windows. Tidligere var Windows helt lukket, men nå er det åpen kildekode.", "source": "lecture"}
{"lecture_id": "os6del9", "chunk_id": "os6del9_0002", "start": 314.6, "end": 500.84, "token_count": 572, "text": "Men jeg anbefaler Linux fordi man har veldig stor frihet. Altså man kan mekke og hacke og legge inn hva som helst. Det har jo sine ulemper også. Det er klart at hvis man gjør for mye krumspring, så kan ting også gå galt. Men man har en veldig stor frihet, og så er alt åpen kildekode. Det har også endret seg når det gjelder Windows. Tidligere var Windows helt lukket, men nå er det åpen kildekode. Altså vinduskjerne, altså åpen kildekode. Ja, der har jeg ikke så veldig sterke preferanser. Jeg har stort sett alltid brukt Ubuntu, for det er enkelt og greit. Og det er mye brukt. Debbian har jeg brukt også, som er litt renere, på en måte. Ikke har så mye kommersiell og ekstern programvare. Men ellers har jeg hørt Red Hat, et veldig... Stabilt operativsystem. Det har jeg ikke brukt veldig mye. Vi har brukt det noe på serveren her. Når det gjelder Windows eller Linux, så er det klart... Det har hver sine bruksområder. Det er ikke så mange som kjører Linux. Men det fungerer veldig greit å kjøre det i dag. Det var mye verre sånn rundt 95... Over 2000. Da jeg kjørte Linux, så fungerte det veldig dårlig i samarbeid med Windows f.eks. Men nå så går det ganske greit med alt, liksom... Man kan oppnå stort sett det samme med en Linux-desktop som en Windows-desktop. Kanskje spill er fortsatt litt forskjellig, fordi GUI i Linux kjører use-of-space. Men på den annen side så er det ikke så stor forskjell lenger på hva slags desktop man har, fordi i større og større grad så bruker man jo nettapplikasjoner som er nettbaserte. Sånn at man egentlig bare trenger en browser for å kunne kjøre alle applikasjoner som e-post og dokumentbehandling osv. Religionskrig mellom Windows og Linux osv., men det har nok glattet seg litt ut etter hvert, fordi det ikke har så stor betydning når alt kjøres på nett. Microsoft har også en serverside, så de har lenge hatt Microsofts servere.", "source": "lecture"}
{"lecture_id": "os6del9", "chunk_id": "os6del9_0003", "start": 457.34, "end": 567.56, "token_count": 321, "text": "hva slags desktop man har, fordi i større og større grad så bruker man jo nettapplikasjoner som er nettbaserte. Sånn at man egentlig bare trenger en browser for å kunne kjøre alle applikasjoner som e-post og dokumentbehandling osv. Religionskrig mellom Windows og Linux osv., men det har nok glattet seg litt ut etter hvert, fordi det ikke har så stor betydning når alt kjøres på nett. Microsoft har også en serverside, så de har lenge hatt Microsofts servere. Når de første kom sånn i 1993, så var de en veldig liten minoritet blant serverne. De aller fleste kjørte Og etter hvert Linux. Men nå, særlig siden 2010, så har Windows-server blitt mer og mer brukt. Så nå kjører du Windows-server i mange serverrom. Ofte da i kombinasjon med Linux-servere. Men fortsatt er nok Linux enda større. Jeg skal se på noen tall senere. Når det gjelder servere som drifter webservere over hele verden, f.eks., så er antall Linux-servere litt større. Noe som er viktig både på Linux- og Microsoft-siden, er virtualisering. HyperW er vindusservere. Azure kjører vindusservere i storskala virtuelt.", "source": "lecture"}
