{"lecture_id": "os6del8", "chunk_id": "os6del8_0000", "start": 0.0, "end": 161.08, "token_count": 599, "text": "Følgene er veldig viktige å huske fra datamaskinarkitektur. Alt CPU-ene gjør, er å bare slavisk utføre maskininstitusjoner. Én for én i en evigvarende røkke. Det er opplagt at CPU-en har ikke noe annet som hva maskininstitusjonene gjør, hva slags logikk det er inni der. Den bare følger blindt institusjonene én for én. Vi vet heller ikke operativsystemet om den indre logikken i maskininstitusjonene. Men det viktige er at NCPU utfører bare én og én institusjon. Og så er det ingen én-til-én-forbindelse mellom institusjoner i høynivåkode og maskinkode. Vi har sett at en kompulator kan lage forskjellige typer maskinkode, så det er ingen garanti for hvordan maskinkoden ser ut. Og i enkelte tilfeller er det umulig. Å lage én linje maskinkode som gjør hele høynivåkoden. Én linje kode i høynivåspråk fører ofte til mange maskininstitusjoner i det ferdigkompliserte programmet. Så har vi også denne CPU-løkken. Den viser bare at CPU-en er en evig løkke. While not halved, altså så lenge maskinen står på. Hvis den ikke har noen institusjoner å gjøre, så gjør den den såkalte NOP. No operations. Altså at den bare står og slår i lufta og venter. Etter hvert som det har kommet servere med veldig mange SUPU-er, så ville det tatt mye energi at alle står sånn og spinner og bruker energi på det. Da er det kommet nye features hvor du kan legge SUPU-er. Men i utgangspunktet har du i hvert fall én som står og kontrollerer og slår i lufta helt til det noe skjer, at det enten er kode som skal kjøres, eller at det kommer et interrupt. Det er viktig å ha med seg videre at når som helst så kan det komme et interrupt. F.eks. hvis man taster bokstaven A, så vil det da sendes en interrupt til CPU-en, Her har det kommet input fra en bruker. Eller kanskje det har kommet en pakke fra nettverket. Eller annen input fra Harberg.", "source": "lecture"}
{"lecture_id": "os6del8", "chunk_id": "os6del8_0001", "start": 120.0, "end": 185.92, "token_count": 217, "text": "Men i utgangspunktet har du i hvert fall én som står og kontrollerer og slår i lufta helt til det noe skjer, at det enten er kode som skal kjøres, eller at det kommer et interrupt. Det er viktig å ha med seg videre at når som helst så kan det komme et interrupt. F.eks. hvis man taster bokstaven A, så vil det da sendes en interrupt til CPU-en, Her har det kommet input fra en bruker. Eller kanskje det har kommet en pakke fra nettverket. Eller annen input fra Harberg. Så når som helst så kan det da skje et såkalt interrupt. Og da må CPUN stoppe med å gjøre disse institusjonene. Så må den ta seg av interruptet. Men dette styres da i samarbeid med... Operativsystemet må ha et opplegg for å kunne behandle interpeter.", "source": "lecture"}
