{"lecture_id": "os6del2", "chunk_id": "os6del2_0000", "start": 0.0, "end": 186.88, "token_count": 588, "text": "Og her står det Linux-VM-er. Så det er nyttig og viktig i dag. Så jeg skal bruke litt tid helt i starten og se på de Linux-VM-ene, sånn at dere kan komme i gang med dem. Og dere har kanskje merket at dere har fått en annonsement i OS-gruppene. Og der står det et passord. Det står ikke så mye annet, men det er det passordet trenger. For å kunne bruke Linux-VM-ene. Og mer om dette står øverst i uke seks. Her står det litt om multiple choice-testen. Og så står det her om Linux-VM-ene. Jeg kaller det Linux-VM-er. Virtuelle maskiner. Men egentlig er det faktisk dokkercontainere. Men det er på en måte halvveis virtuelle maskiner. Bruker et opplegg som heter Sysbox, som er et slags system som isolerer dokkecontainerne i større grad. Vi kommer tilbake til dokkecontainere senere i kurset. Da skal dere kjøre dokkecontainere og starte og stoppe og bygge osv. Så da skal vi snakke mer om hvordan det henger sammen. Men generelt så er det et problem med dokkecontainere at de... De kjører direkte på operativstemme og har tilgang til operativstemme på serveren som de kjører, i motsetning til virtuelle maskiner. Men disse dokkencontainerne som kjører Sysbox, er containet enda sterkere. De er isolert mer fra serveren under. Dermed får man en look-og-file som om det var en virtuell maskin, som Studio SSO. Som kjører på en fysisk server. De tingene er viktig å ha med i denne ukens oppgaver. Hvor det er... Jo, det er i denne ukens oppgaver hvor dere skal kjøre prosesser. Kjøre mange prosesser på samme VM eller på Study SOSA, for å se hvordan serverne... Tildeler CPU-er. Eller operativsystemet tildeler CPU-er til prosessene. Skredulerer. Og det skal vi snakke masse om. Men aller først så skal vi se litt i praksis på disse Linux-VM-ene. Og det første og viktigste er at for å få tilgang til en Linux-VM, så må dere være i en OS-gruppe. I OS-gruppe 13 så kan dere da logge dere inn med SSO.", "source": "lecture"}
{"lecture_id": "os6del2", "chunk_id": "os6del2_0001", "start": 141.42, "end": 212.46, "token_count": 219, "text": "Kjøre mange prosesser på samme VM eller på Study SOSA, for å se hvordan serverne... Tildeler CPU-er. Eller operativsystemet tildeler CPU-er til prosessene. Skredulerer. Og det skal vi snakke masse om. Men aller først så skal vi se litt i praksis på disse Linux-VM-ene. Og det første og viktigste er at for å få tilgang til en Linux-VM, så må dere være i en OS-gruppe. I OS-gruppe 13 så kan dere da logge dere inn med SSO. På tilsvarende måte som dere gjør til StudSSO, med Putty eller på andre måter. Med et skjell fra MacLinux eller fra en Linux-laptop. Eller fra StudSSO, hvis dere er der inne. Med SSO på denne måten. Så OS13, det er da hosten. Det er navnet på VM-en. Bruker navnet.", "source": "lecture"}
