{"lecture_id": "os6del12", "chunk_id": "os6del12_0000", "start": 0.0, "end": 193.36, "token_count": 593, "text": "Så det kan se ut noe sånt som dette her. Her har vi tre prosesser, P1, P2 og P3, som kjører etter hverandre. Og her så ser vi tiden i millisekunder. Altså millisekunder, det er et tusendels sekund. Så vi ser... En typisk tid P1 kjører, er i ti millisekunder. Altså et hundredels sekund. Men på et hundredels sekund kan jo én prosess som står og kjører, den kan gjøre millioner, for ikke å si milliarder, av institusjoner. Millioner av institusjoner kan den gjøre. Og da får operativstemme, får dette til å se ut som om alle disse tre prosessene kjører samtidig. Men i virkeligheten, når du bare har én CPU, Så P1 kjører i 10 mil eller sekunder. Så kommer det en context switch. Det er ganske omfattende. Da må OS lagre alt om... ... om denne prosessen her. Husker det er et levende liv som leves. Så alt som eksisterer om prosess 1, det må lagres. Alle verdier i registeret, f.eks. Alt den har i ramm, er allerede lagret i ramm, men all kontekst, all info om den prosessen, det må lagres. Og så må all konteksten til P2 lastres inn. F.eks. hvilke verdier registerene hadde når P2 stoppet sist. Og sånn fortsetter det. Man bytter med kontekst-switcher hele veien. Og så kommer P1 inn igjen. Og så bytter de om å kjøre på denne nå. PCB er prosesskontrollblokk. Det er en blokk i ramm som inneholder all den informasjonen som trengs om en prosess. CPU-registeret, f.eks., peker etter stack-prosess-tilstand. Om den venter på noe, f.eks. Alle prosesser har en PID. Eier, prioritet, osv.. Det er masse informasjon som må lagres om hver enkelt prosess. Den operasjonen som operativstemme gjør for å bytte om på prosesser, kalles generelt cheduling. CPU-cheduling er å fordele CPU-tid mellom prosessene. Det kalles ofte også timesharing. Om scheduleren skal kalles. For at ting skal gå fortere, så er det ikke alltid at man gjør et bytte. Hvis vi går tilbake her...", "source": "lecture"}
{"lecture_id": "os6del12", "chunk_id": "os6del12_0001", "start": 148.02, "end": 342.6, "token_count": 588, "text": "Eier, prioritet, osv.. Det er masse informasjon som må lagres om hver enkelt prosess. Den operasjonen som operativstemme gjør for å bytte om på prosesser, kalles generelt cheduling. CPU-cheduling er å fordele CPU-tid mellom prosessene. Det kalles ofte også timesharing. Om scheduleren skal kalles. For at ting skal gå fortere, så er det ikke alltid at man gjør et bytte. Hvis vi går tilbake her... Hvis P2 er ferdig... Hvis verken P1 eller P3 ønsker å brukes i PU-en, så kan det være at P2 bare fortsetter. For å få kontekstswitch-tiden til å gjøres så raskt som mulig, er det noen ganger man bare sjekker... Ok, ingen andre ønsker å kjøre. Da bare fortsetter P2. Men det er det da. Skeduleren, som er en del av operativsystemet, den avgjør hvilken prosess som skal velges når den blir kalt. Og dette, som vi har sett, det å switche fra én prosess til en annen... All informasjonen må da først lagres for P1 og så hentes inn for P2. Så dette tar tid, og det er litt overhead å gjøre denne context-switchen. Her ser vi alt som skjer i en context-switch hvis vi tenker oss at prosess 1 kjører, og så switcher vi til prosess 2. Og da vil jo... Prosess én vil jo bruke CPU-en. Og midt inni en operasjon så kan det være at AX er lik fem. Neste institusjon som skal utføres, kan kanskje være at AX skal legges ut i en variabel. Og da er det klart... Verdien på AX, den må da lagres for prosessen. Så det er en ganske komplisert prosess enn contact stetch. Og informasjon som må lagres av prosessen. Men all denne informasjonen for prosess 1 lages da i RAM i PCB1. Neste prosess som skjer, er at PCB2 må lastes inn. All informasjon fra PCB2 må da lastes inn i alle områder som beskriver den kjørende prosessen. Operativstemme ordner ikke alt dette her. Sånn som å laste inn alle verdier av institusjoner. Det blir litt vanskelig, for du må jo bruke registrene for å kjøre programmet. Hvis operativstemmen skulle gjøre det,", "source": "lecture"}
{"lecture_id": "os6del12", "chunk_id": "os6del12_0002", "start": 301.28, "end": 378.0, "token_count": 239, "text": "Men all denne informasjonen for prosess 1 lages da i RAM i PCB1. Neste prosess som skjer, er at PCB2 må lastes inn. All informasjon fra PCB2 må da lastes inn i alle områder som beskriver den kjørende prosessen. Operativstemme ordner ikke alt dette her. Sånn som å laste inn alle verdier av institusjoner. Det blir litt vanskelig, for du må jo bruke registrene for å kjøre programmet. Hvis operativstemmen skulle gjøre det, så ville operativstemmen også endre registerverdiene. Så der er det hardwareoperasjoner som kommer inn, som på én smell bare legger inn alle verdiene fra et lager. Så kan man hoppe til neste instruksjon. Et eller annet sted står det lagret PC - program counter. Og det siste som skjer etter at all informasjon er lagt til, er at da hopper man til programconteren som kjører neste instruksjon.", "source": "lecture"}
