{"lecture_id": "os6del14", "chunk_id": "os6del14_0000", "start": 0.0, "end": 205.08, "token_count": 599, "text": "Ok. Nå... Vi kan rydde opp litt her. Nå er jeg inne på én server. Og så skal jeg bare kjøre en liten regnejobb. Jeg har et program som heter Adatot. Som er CPU-avhengig, og som bare står og bruker CPU. Samtidig kan jeg her kjøre topp, og da ser vi... Topp viser nå øverst en linje med det programmet som kjører. Der ser vi... Det var ferdig. Vi kan også ta tiden på programmet. Jeg starter på nytt, og da ser vi... Øverst her så er det en prosess som står og kjører, og den ser vi bruker 100 %. Hvis jeg taster tallet én i topp, så ser vi at det kommer fram én CPU her oppe. Og her er det bare CPU0. Så dette er en server som bare har én enkelt CPU. Det er det nesten umulig å få tak i. Alle dagens servere eller CPU-er har minst to CPU-er. Men jeg har bare skrudd av de andre for å vise denne demoen her. Så det man kan gjøre, det er å kjøre... Prøv å se hva som skjer. Hvis jeg kjører nå to regneoppgaver samtidig... Da legger jeg henne i bakgrunnen sånn. To stykker. Og da ser vi. Her er det nå to prosesser som heter alt. Vi ser de deler nå likt på CPU-en. Disse to her. Her er det en rad som sier CPU. Og her ser vi. Bær av de får 50 %. Hvis jeg nå starter en til, så ser vi at da kommer den inn også. Men da får hver av de 33 %. Da deler de likt på den ene CPU-en. Sånn fungerer multitasking når man bare har én CPU. De deler da på CPU-en, og de kjører halvparten hver. Men de kjører da ca. ett hundredels sekund hver, og så bytter de på hvem som kjører. Og hele tiden så bytter operativstemmet frem og tilbake mellom de to prosessene. Så skal vi veldig kort se på hva som... Hva skjer hvis jeg nå starter opp én CPU til på denne serveren? Jeg kan vise senere hvordan jeg kan gjøre det. Men nå startet jeg opp én server til. Nei, én CPU til. Så hvis jeg nå taster én, så ser vi at jo, her dukker det opp to CPU-er.", "source": "lecture"}
{"lecture_id": "os6del14", "chunk_id": "os6del14_0001", "start": 165.6, "end": 344.02, "token_count": 580, "text": "og så bytter de på hvem som kjører. Og hele tiden så bytter operativstemmet frem og tilbake mellom de to prosessene. Så skal vi veldig kort se på hva som... Hva skjer hvis jeg nå starter opp én CPU til på denne serveren? Jeg kan vise senere hvordan jeg kan gjøre det. Men nå startet jeg opp én server til. Nei, én CPU til. Så hvis jeg nå taster én, så ser vi at jo, her dukker det opp to CPU-er. Så nå har denne serveren tilgang til to CPU-er. Og hva skjer da hvis jeg starter to programmer samtidig? Jo, da ser vi her oppe... Så ser vi at nå jobber disse prosessene på hver sin CPU. Den får 100 % på den ene CPU-en, og den får 100 % på den andre. Men da vil det bli sånn at hvis jeg nå starter tre prosesser av den typen, Så får de ca. 67 % hver. Der fordeler de CPU-tiden seg imellom på den måten. Og det går også an å se nøyaktig hvordan det skjer. Skal vi se om jeg er rask nok til å få til det. La oss si jeg starter tre prosesser her. Jeg taster F, så kan jeg gå inn i Topp. Jeg tastet nå F, og så kan jeg gå ned og finne Last Use CPU. Så Space på den, og så Escape. Så ser vi helt ytterst her, så har vi fått et nytt felt hvor det står 100. Nå var jeg litt sein. Jeg kan starte på nytt. Starter nå tre... prosesser. Helt til høyre her, så ser vi en null og en ener. Og da ser vi at de bytter på. Noen ganger så kjører begge på CPU1 og én på CPU0, og så andre ganger så kjører begge på CPU0. Så typisk så kjøres da én prosess på hver av CPU-ene, og så vil den tredje prosessen bytte mellom. Nei, det er ikke helt riktig, fordi... Operativstemme har en scheduler som kalles Fair Scheduler. Så når tre prosesser kjøres på denne måten her... Det som i praksis skjer, er at alle tre bytter likt, sånn at hver prosess får da ca. to tredjedeler CPU-tid, hvor den har tilgang til CPU-en.", "source": "lecture"}
{"lecture_id": "os6del14", "chunk_id": "os6del14_0002", "start": 310.78, "end": 495.7, "token_count": 598, "text": "Så typisk så kjøres da én prosess på hver av CPU-ene, og så vil den tredje prosessen bytte mellom. Nei, det er ikke helt riktig, fordi... Operativstemme har en scheduler som kalles Fair Scheduler. Så når tre prosesser kjøres på denne måten her... Det som i praksis skjer, er at alle tre bytter likt, sånn at hver prosess får da ca. to tredjedeler CPU-tid, hvor den har tilgang til CPU-en. Og på den måten så får de i snitt så får de 67 % CPU-tid. Ok. Men da tenker jeg dere er passe slitne. Da skal vi slutte der. Men det er noen oppgaver denne uken som går ut på dette her. Av at dere skal kjøre CPU-avhengige prosesser. Nå kjørte jeg et CV-program. Man kan også kjøre programmer sånn som regn her. Det er det regneprogrammet jeg viste. Det vil oppføre seg på akkurat samme måte. Så får de hver sin CPU. Legger jeg på det tredje regnprogrammet, så får det i snitt 67 % CPU hver. Fordi operativsystemene da bytter om på hvilken CPU de bruker. Sånn teoretisk så vi i dag mest på operativsystemer hvordan de kjører på én CPU. Å kunne gå inn og fordele prosesser på de forskjellige CPU-ene. Som vi så vidt så på her. Så i oppgaven denne uken så skal dere teste ut dette her. Både på study SSO og kjøre regnejobber. Men også på... Også på de Linux-VM-ene. Og der er det litt annerledes. Hvis dere gjør topp der og taster én, så vil dere se at dere har noe sånt som 96 CPU-er. Det dere faktisk da ser, er den underliggende serveren. Men de containerne dere har, er satt opp sånn at de bare får tilgang på to CPU-er. Eller i snitt så får de så mye CPU-tilgang. Så det er... Det er da begrenset på en annen måte. Og ikke sånn som med fysiske servere, hvor du har fire CPU-er, og de er de du har. Men med virtuelle maskiner og med containere, så kan man når man setter det i gang, så kan man tildele et antall CPU-er. Og med Docky-containere, så er det sånn...", "source": "lecture"}
{"lecture_id": "os6del14", "chunk_id": "os6del14_0003", "start": 461.66, "end": 521.4, "token_count": 212, "text": "er satt opp sånn at de bare får tilgang på to CPU-er. Eller i snitt så får de så mye CPU-tilgang. Så det er... Det er da begrenset på en annen måte. Og ikke sånn som med fysiske servere, hvor du har fire CPU-er, og de er de du har. Men med virtuelle maskiner og med containere, så kan man når man setter det i gang, så kan man tildele et antall CPU-er. Og med Docky-containere, så er det sånn... Der blir det ikke direkte tildelt, men der blir man tildelt en prosentdel. Så de dere har, er tildelt sånn at de får i snitt to CPU-er. Mens på Studies SO har hver VM fire sepur som man kan kjøre på. Men dette er sånt som dere kan teste ut i oppgavene denne uken.", "source": "lecture"}
