{"lecture_id": "os6del7", "chunk_id": "os6del7_0000", "start": 0.0, "end": 218.6, "token_count": 598, "text": "Det var også spørsmål om grupper, så vi kan ta det også hvis vi går inn på studentgruppene her. Så ser dere at det er OS-grupper, og nå er det 96 grupper. Så for å få en... For å få tilgang til en Linux-VM, så må du melde deg inn i... Hvis du ennå ikke har fått tilgang, f.eks. ikke har levert obliger, så meld deg inn i OS84. Det du da får som OS84, det er da bare et passord. Så du får kun passordet, og da er tanken at hvis du har passord... 84... Så skal du da logge deg inn som brukeren Group84. Og i tillegg så skal... Så er hosten som du skal inn på, det er OS84. Sånn logger du deg inn til denne adressen. Først, før vi logger oss inn, kan vi f.eks. bruke ping. Så kan vi se... Sende en ping til en HOS-en. Da ser vi at den svarer på ping. Så dette er en sånn typisk måte man sjekker om en server er oppe på. Ved å pinge den... Men så er det da viktig at du går inn... Hvordan vi finner passordet? Jo, gå på OS-gruppen og så klikk på... Annonsement. Jeg trodde kanskje man fikk det annonsementet i e-post også. Altså alt på gruppen. Hvis ikke, så gå inn på... gå inn på gruppe. Og så klikk på announcement der. Det skal jeg ikke gjøre, for der ligger da passordet til OS28. Det kom altså på e-post, ja. Både på e-post... Men hvis dere har glemt eller slettet den e-posten, så gå inn i gruppen og se på announcements. Der ligger det bare en streng. Det er vel fire tegn, altså et tall, og så fire nye tegn. Et lite ord, altså et tall, og så et annet ord. Da logger dere inn som group84. At os84. Og så er det... Hvis dere får opp noe sånt som dette, så svar yes. Det er sånn typisk du får første gang du logger inn på en server. Og etterpå lagrer den da Mac-adressen som den serveren. Så hvis du senere logger inn på den samme adressen, og Mac-adressen er endret... Altså adressen til nettverkskortet på nivå 2, på lavnivå, eternettadressen...", "source": "lecture"}
{"lecture_id": "os6del7", "chunk_id": "os6del7_0001", "start": 185.68, "end": 261.0, "token_count": 280, "text": "At os84. Og så er det... Hvis dere får opp noe sånt som dette, så svar yes. Det er sånn typisk du får første gang du logger inn på en server. Og etterpå lagrer den da Mac-adressen som den serveren. Så hvis du senere logger inn på den samme adressen, og Mac-adressen er endret... Altså adressen til nettverkskortet på nivå 2, på lavnivå, eternettadressen... Hvis den har blitt endret, så kan det tyde på at det er en sånn man in the middle attack. Altså at noen prøver å gjøre lureri med IP-adressen og sende deg til et annet sted enn du skal, osv. Så derfor må man første gang svare bare yes på den, så kommer man inn. Du må taste passord, men jeg har lagt opp SSO-nøkler, sånn at jeg kommer inn på alle disse VM-ene, sånn at jeg kan hjelpe til. Men i hvert fall... Er du på gruppe 1, så logger du inn på denne måten. Groupe 1 at OEC. Med passordet fra Kanas.", "source": "lecture"}
