{"lecture_id": "os6del3", "chunk_id": "os6del3_0000", "start": 0.02, "end": 213.2, "token_count": 594, "text": "Så jeg kan se på hvordan det ser ut i praksis. Hvis jeg nå går til riktig vindu i... Skal vi se. Jeg tror jeg har et studiesesongvindu her. Litt mange vinduer her. Her har jeg et vindu i studiesesong. Så kan vi tenke oss at det enten er i SUSH, eller at dere logger direkte inn med putty. Begge deler går. Det skal gå an å logge seg inn hjemmefra også. Denne her er ikke innenfor... Dere må ikke bruke... Hva heter det... VPN. Dere må ikke bruke Oslomett VPN for å komme inn til disse. Jeg har tatt en gruppe som er nummer 100, så jeg må da logge meg på som group 100. Dere må gjerne prøve dette her nå. Passordet dere skal ha for group 100, eller group 13, det ligger i en announcement i Kanas på OS-gruppen. Så hvis dere er OS 100, hvis dere var OS 100, så vil dere da gå inn i den gruppen og se på announcement som ligger der. Da kan dere plukke ut passordet. Dette er felles for alle som er på gruppen. Og så er urlnvlab.cs.hioa.no... Tror ikke OsloMet funker, men Hioa skal funke. Så må dere skrive passordet som dere har fått. Se om jeg husker passordet jeg har fått. Ja. Og da er det plutselig et Linux-skjell på samme måte som... Ja, ligner veldig på Studies SO. Det kjører Ubuntu 2004. Så det er en helt ny versjon av Ubuntu. Det er mulig den er nyere enn den den er på Studies SO. Hittil på StudieSV, men dere kan da gjøre enda mer. Og det er det viktig å være klar over. Her er dere RUT. Dere har RUT-aksess. Så dere kan gjøre sudo-SU og så skrive passordet på nytt. Da ser du - vips - så er det RUT på systemet. Og da kan dere gjøre alt dere måtte ønske. For eksempel å installere. Kjøre Apt-get-update før dere installerer. Så kan dere installere hva som helst som dere måtte ønske. Eller som dere trenger i oppgavene. Tvert i oppgaven kommer det noen instruksjoner om å installere screen og kron og en del forskjellig annet. Er det denne uken eller kanskje neste uke", "source": "lecture"}
{"lecture_id": "os6del3", "chunk_id": "os6del3_0001", "start": 173.18, "end": 406.56, "token_count": 597, "text": "Da ser du - vips - så er det RUT på systemet. Og da kan dere gjøre alt dere måtte ønske. For eksempel å installere. Kjøre Apt-get-update før dere installerer. Så kan dere installere hva som helst som dere måtte ønske. Eller som dere trenger i oppgavene. Tvert i oppgaven kommer det noen instruksjoner om å installere screen og kron og en del forskjellig annet. Er det denne uken eller kanskje neste uke hvor dere blir bedt om å installere en webserver? Og det... Skal vi se... Jeg tror jeg har gjort det allerede her. Så vi kan kikke på det. Hvis jeg... Skal vi se... Hvis jeg skriver inn nå OS100 her... Sånn, ja. Så ser vi det kommer opp en aposje, to ubundte default-patch. Så det er nå webserveren til OS100. Som dere kan endre på og styre som dere vil. Legg merke til at dette her er jo en... Dette er nå en public IP. Så ifconfig... Oi, nå må jeg tilbake. Nå er jeg inne på OS101. ifconfig viser info om nettet. Og her ser vi at dette er public IP. Hvis du er OS1, så har du public IP 13 i 120, 101 og 102 for OS2 osv. Det er veldig viktig å være klar over. Denne eap-en her nås av... av alle. Sånn at her er det helt inn folk som prøver å... Prøver å logge seg på. Vi kan se om... Nei, det ser ikke ut som... Den kjører auto-at-the-log. Ja, det kan vi se på senere. Alle har tilgang herfra, og det vil foregå en del... Eller SSH-skanning foregår det hele tiden. Dvs. at man prøver å logge seg på og gjette passordet til din maskin. Så det betyr at hvis du lager en konto med brukerland-test og passord-test... Ikke gjør det, for da vil vel... Vær veldig forsiktig med brukernavn og passord. Neste uke skal dere lage et brukernavn. Og tilsvarende brukernavn som dere har på StudieSSH, og sett det passord. Når dere gjør det, så hjelper det veldig å ha sånne sære brukernavn som s123456, men sett også et godt passord. Og for all del, ikke bruk brukernavn som Linux", "source": "lecture"}
{"lecture_id": "os6del3", "chunk_id": "os6del3_0002", "start": 351.06, "end": 430.0, "token_count": 206, "text": "Så det betyr at hvis du lager en konto med brukerland-test og passord-test... Ikke gjør det, for da vil vel... Vær veldig forsiktig med brukernavn og passord. Neste uke skal dere lage et brukernavn. Og tilsvarende brukernavn som dere har på StudieSSH, og sett det passord. Når dere gjør det, så hjelper det veldig å ha sånne sære brukernavn som s123456, men sett også et godt passord. Og for all del, ikke bruk brukernavn som Linux eller Ubuntu eller Test eller noe sånt med dårlig passord. Da er det straks noen... i hvert fall i løpet av timer, noen som kommer inn og tar over IP-en. Så vær generelt obs for den. Men den vemen er der ute i den store verden og har veldig lite beskyttelse.", "source": "lecture"}
