{"lecture_id": "os6del1", "chunk_id": "os6del1_0000", "start": 0.0, "end": 190.52, "token_count": 588, "text": "Ja... Før vi starter i dag, så er det noen praktiske ting som vi skal se på først. Ja... Branch Prediction, det er det vi skal holde på med i dag. Men aller først til oversikten over kurset. Da har vi kommet. Vi er nå i uke seks. Det er et par ting som er nytt her. Først og fremst er det MC1. Som er da en obligatorisk multiple choice-test. Det har tatt litt tid å få ut den også, fordi det har vært problemer med SSH-innlogging på studentserverne. Ikke StudioSSH, men en annen server. Så... Men det er relaterte problemer. Så hvis det skulle være noen problemer med innlogging, så si ifra med en gang. Det har vært litt problemer tidligere, men jeg håper det fungerer som det skal nå. Det er delvis av historiske årsaker at vi har dette multipurpose-systemet, men jeg har bygd opp en svær database med spørsmål der. Og også mot slutten så skal vi ha en... Så er det en World of Operating Systems. Som er en slags konkurranse hvor man kan oppnå levels ved å svare på i dette systemet. Men uansett... Så tidlig som mulig, gå gjennom og gjør denne flervalgstesten. Først og fremst så er det en tilbakemelding på hvor dere sår, hva dere har fått med dere av pensum. I tillegg kan det være ganske nyttig fram til eksamen. For vanligvis så dukker det opp noen spørsmål fra disse Multiprofile-spørsmålene. Noen ganger helt de samme, andre ganger en variant som ligner. Oppgavene er fra kursets fire uker. Den første obliggen er det mest om Linux og verskommandoer. Du må svare på minst syv av ti riktige spørsmål. Syv av ti riktige. Og det er ikke så lett. Du kan være litt uheldig med spørsmålene. Noen er vanskeligere enn andre. Men ikke for tidlig hvis du ikke får det til. Da er tanken at du skal ta kontakt med en studentassistent. Og nå, typisk, så må du da gå inn i et break-out-room hvis du er på en lab-dag. Bruk labdagen til å gå inn i breakover-room, snakke med studentassistent, og se på spørsmålene. Så gir studentassistentene deres mulighet til å få en ny sjanse.", "source": "lecture"}
{"lecture_id": "os6del1", "chunk_id": "os6del1_0001", "start": 155.18, "end": 305.64, "token_count": 472, "text": "Du kan være litt uheldig med spørsmålene. Noen er vanskeligere enn andre. Men ikke for tidlig hvis du ikke får det til. Da er tanken at du skal ta kontakt med en studentassistent. Og nå, typisk, så må du da gå inn i et break-out-room hvis du er på en lab-dag. Bruk labdagen til å gå inn i breakover-room, snakke med studentassistent, og se på spørsmålene. Så gir studentassistentene deres mulighet til å få en ny sjanse. I tillegg... Var det noe annet fornuftig jeg skulle si om disse testene? Jo, dere får nye sjanser. Men det er viktig å gjøre... Sånn at dere får tid til å få nye sjanser. Hvis det er én type spørsmål dere bommer på, så er det kanskje fornøyelig å jobbe litt mer med oppgavene rundt de. Så kan dere, før dere begynner på de, nye sjanser. Ok, det var multiple choice. Var det noe annet... Ja, Oblique 2 står og lyser her nede i det fjerne. Det er ikke så lenge til. Den har da frist... skal vi se... fredag 5. mars. Så det er en stund til, men alle oppgavene til Oblikk 2 ligger nå ute. Så Oblikk 2 består av fem-, seks- og syvoppgavene herfra. Og så vil det da etter påske komme en Oblikk 3 med oppgaver fra de fire ukene. Sånn er det standard-opplegget. En annen ting... Oppgavene denne uken, de har ligget ute en uke. Men disse oppgavene til neste uke, som er uke syv... Det er da de siste som inneholder obligoppgaver. Men temaet derfra har vi ikke snakket om ennå. Det snakker vi delvis om i neste uke, og...", "source": "lecture"}
