{"lecture_id": "os7del11", "chunk_id": "os7del11_0000", "start": 0.0, "end": 220.56, "token_count": 598, "text": "75 % av dere har gått for 22,5 sekunder, og det er veldig bra, for det... Det er i hvert fall det jeg trodde svaret skulle bli. Så vi kan gjøre to ting. Vi kan kjøre det her. Og mens det står og kjører, så kan vi prøve å regne på det. Så utgangspunktet... Det var at vi hadde... Fem prosesser. Prosesser... Og hver av de bruker 18 sekunder. Og så har vi da fire CPU-er som de fem prosessene skal fordeles på. De vil jo da kjøre parallell, men så må nummer fire settes på en av de andre sippuene. Og da, som vi så tidligere, så er dette bare et øyeblikksbilde. Man bytter da på hvilke sippuer som har to prosesser av gangen. Sånn at totalt sett så fordeles tiden likt. Og da... Ja, det kan være litt sånn... Det kan være flere måter å regne det ut på. Men det som jeg tenker kanskje er den enkleste måten, er å bruke andre måter. Det er at hvis du har fem prosesser som skal kjøre i 18 sekunder, så trenger de... Hver av de trenger 18 CPU-sekunder. Så vi kan regne oss i 5 CPU ganger 18 sekk... CPU-sekunder trenger man for å utføre de jobbene ferdig. Og 5 ganger 18... 5 og 48... Det skulle bli 90 CPU-sekk. Og da... Når du har 90 CPU-sekunder, og så skal du dele det på 4 CPU-er. De må jo fordeles på fire sepuer, for hvis alle de fire sepuene kjører så mye de kan av de 90 sepu-sekundene hele tiden, så vil det bli fordelt på den måten der. Og dermed får man 90 fjerdedelssekund. Og 90 fjerdedels er 45,5... Og det blir da 22,5 sekunder. Så det er derfor... veldig bra at tre fjerdedeler av dere har kommet fram til at dette bør ta 22,5 sekunder. Så kan vi også se på fasiten. Jeg tror ikke den er helt 22,5 sekunder. Men vi kan se... Ja, vi ser... Her var det faktisk ikke så veldig fair. Den stopper, ser du det, sultne. Her var det litt forskjell i CPU-bruken.", "source": "lecture"}
{"lecture_id": "os7del11", "chunk_id": "os7del11_0001", "start": 175.34, "end": 297.0, "token_count": 358, "text": "Og det blir da 22,5 sekunder. Så det er derfor... veldig bra at tre fjerdedeler av dere har kommet fram til at dette bør ta 22,5 sekunder. Så kan vi også se på fasiten. Jeg tror ikke den er helt 22,5 sekunder. Men vi kan se... Ja, vi ser... Her var det faktisk ikke så veldig fair. Den stopper, ser du det, sultne. Her var det litt forskjell i CPU-bruken. Det burde jo vært 80 %, men den her hadde faktisk fikk 88 %. Så den var nede i 21 sekunder, mens denne fikk bare 76 og var oppe i 24. Så her var ikke schedulerne helt feil. Det varierer litt også om det er mye annen trafikk på. Men vi ser røffelig i snitt så ville blitt 22,5 hvis operativstemma hadde klart å fordele dette helt likt. Men her kan vi også se et eksempel på det spørsmålet som kom tidligere. Her ser vi at hvis man legger sammen user og system, så blir jo ikke det real i det hele tatt. Og i hvert fall ikke her. Dette totalen her er hvor mye CPU-tid den prosessen her trenger. Og dette tallet her kommer da rett og slett fram for at... Dette er i hvor mange prosent den faktisk hadde. Og dermed så tar realtiden mye lengre. Den blir da 24 sekunder.", "source": "lecture"}
