{"lecture_id": "os7del13", "chunk_id": "os7del13_0000", "start": 0.0, "end": 208.48, "token_count": 586, "text": "Ja... Her ser vi at jeg er på en server som heter AMDoc. Og det er den serveren som Linux-VM-ene deres kjører. Eller det vil si... Egentlig er det dokkercontainere. Dokker PC-er, så får jeg opp 100 forskjellige dokkercontainere. Som er de dere kjører. Men det jeg egentlig skulle se på, var... LSPU. Den gir litt informasjon om CPU-en. Og her så ser vi... Her står modellnavnet. AMD Epic. Og det... Epic er en... Eller Epic 7552. Det er da modellnavnet på denne prosessoren. Og den bruker Zen Z1-mikroarkitekturen, som er en mikroarkitekt... Og mikroarkitektur, det står litt om det i notatene i dag. Det er på en måte hvordan institusjonssettet er implementert av AMD. For instruksjonssettet, det er X86. Og Intel lager også CPU-er som implementerer dette institusjonssettet. Move og Ad og alle disse institusjonene er helt like. Sånn at kode som kjører på AMD, den kan også kjøres på Intel. Men hvordan dette her er implementert med LNCash og med mikrooperasjoner og med pipelining osv., det er forskjellig fra prosessor til prosessor. Og AMD og Intel har hatt helt forskjellig approach i mange tilfeller. Men vi ser dette er en 48-core prosessor. Men den har SMT, Simultaneous Multitredding. Og det er noe av det vi skal se på nå. Det er en helt annen type multitredding som foregår helt på prosessornivå. Men vi ser at den har 48 courses per socket. Og så har den... La oss se her, så står det... Så totalt sett så har den 96 uavhengige treads. Vi skal se litt nøyere hva det egentlig betyr. Men så kan vi også se da på cash. Her så ser vi det er ganske mye cash. LND er datakash. LNI er instruksjonscash. Og... Så LN-cash er på 3 MW. L2 er på 24 og eldre på hele 192. Og det er ganske mye mer enn det vi så på AMD K10, i den litt eldre versjonen vi hadde. OK. Så det var AMDoc som er serveren som dere kjører på. Så når dere er på...", "source": "lecture"}
{"lecture_id": "os7del13", "chunk_id": "os7del13_0001", "start": 163.84, "end": 248.56, "token_count": 257, "text": "Men så kan vi også se da på cash. Her så ser vi det er ganske mye cash. LND er datakash. LNI er instruksjonscash. Og... Så LN-cash er på 3 MW. L2 er på 24 og eldre på hele 192. Og det er ganske mye mer enn det vi så på AMD K10, i den litt eldre versjonen vi hadde. OK. Så det var AMDoc som er serveren som dere kjører på. Så når dere er på... Når dere er inne på VM-ene og kjører LSCPU, så er det akkurat den samme LSCPU-en. For det er dockercontainere. De deler på den underliggende operativsystemet og da selvfølgelig også den underliggende serveren med serverscpuene. Til forskjell fra virtuelle maskiner, så kan du med dockercontainere... Når du lister, så vil du se den virkelige, fysiske serveren. Tettere på operativstemme enn det virtuelle maskiner gjør. Det kommer vi mer tilbake til senere.", "source": "lecture"}
