{"lecture_id": "os7del2", "chunk_id": "os7del2_0000", "start": 0.0, "end": 177.32, "token_count": 587, "text": "Det jeg tenkte å se på da, var å prøve å regne på en regnejobb. Dette er et lite skript som bare står og regner tre millioner ganger, så legger den sammen i lik i pluss 1. En økning med 1, og så legger den sammen og lager en sum. Det er ikke så viktig akkurat hva den gjør, men det som er poenget her, Et sånt program, det vil bruke så mye CPU som det bare kan. Helt inn står det 'bruker CPU'. Den hviler aldri. Bruker helt inn CPU. Og da kan vi se på topp samtidig. Da ser vi toppen her, som står og går. Og hvis jeg nå kjører en... Time tar tiden på regnejobben. Da ser vi at øverste linje her toppsorterer default etter hvilke prosesser som bruker mest CPU. Og øverste linje her, det vil da være regnejobben. Da ser vi ikke... Nei, vi så ikke navnet på regnejobben. Men det er fordi jeg har et lite, litt lite topp. Hvis vi drar litt lenger bort her nå... Sånn. Der kan vi se. Dette er regnejobben som står og kjører. Og den får 100 % CPU. Ved å taste én i topp så kan jeg se hvor mange CPU-er det er. Og da ser jeg denne maskinen her. Dette er egentlig en desktop. Min desktop som står nede på OsloMet. Den har to CPU-er. Iallfall... Senere så har den egentlig fire, eller faktisk åtte, hvis du regner med hypertrening, men jeg har skrudd av de andre CPU-ene. Så i dette tilfellet så ser dette nøyaktig ut som en CPU-ei, en desktop som har to CPU-er. I forelesningshotatene så har jeg et tilsvarende eksempel med den gamle Macen min, som også har to CPU-er. Men i prinsippet så vil det skje... Nøyaktig det samme. For det vi kan prøve å få til her, det er hva skjer om vi nå kjører to regnejobber samtidig. Da kan jeg lage en liten løkke for i-inn 1-2. Og så inn i den løkka så kan jeg ta og time regnejobben. Og så kan jeg legge den i bakgrunnen, sånn at det som vil skje nå,", "source": "lecture"}
{"lecture_id": "os7del2", "chunk_id": "os7del2_0001", "start": 144.64, "end": 322.04, "token_count": 577, "text": "som også har to CPU-er. Men i prinsippet så vil det skje... Nøyaktig det samme. For det vi kan prøve å få til her, det er hva skjer om vi nå kjører to regnejobber samtidig. Da kan jeg lage en liten løkke for i-inn 1-2. Og så inn i den løkka så kan jeg ta og time regnejobben. Og så kan jeg legge den i bakgrunnen, sånn at det som vil skje nå, er at to regnejobber startes helt samtidig. Don. Og da ser vi i topp at her er det to regnejobber som starter. Og siden denne serveren har to CPU-er, så ser vi at de jobber på hver sin CPU. Vi så kanskje sist på at det går an å se hvilken CPU som blir brukt. Nå tasses det F i topp, og da ser vi... Vi kan styre hvilke kolonner. Som brukes. Og hvis man blar nedover her, så vil man se... Her er det en kolonne som heter Last Used CPU. Hvis jeg nå taster Space her, så får jeg et merke på den. Og Escape går nå tilbake. Og da vil jeg se... Hvis jeg lager vinduet litt større... Så vil jeg se at ytterst her så kommer det en kolonne som... Det er en statistikk på hvilken CPU ble sist brukt av prosessene som listes. Hvis jeg nå starter regnejobben på nytt, så ser vi at da er det 29.351. Den kjører på CPU1. Og 29.352, den prosessen med den i den. Så kan vi se... Det hender de bytter om. Men stort sett sånn som nå, så kjører de hele tiden på samme SUPU-er. Så kan man spørre seg - hva er det som skjer hvis jeg nå kjører tre SUPU-er? For det som skjedde med to SUPU-er... Kan ta det en gang til eksplosivt. Når jeg har to SUPU-er, så er på en måte ikke dette multitasking. De kjører på to forskjellige zippe-u-er. Så de kjører reelt sett samtidig. Multitasking er når de bytter på på samme zippe-u-er. Så dette er SMP - Simultaneous Multiprocessing. Vi skal gå gjennom de begrepene senere.", "source": "lecture"}
{"lecture_id": "os7del2", "chunk_id": "os7del2_0002", "start": 288.08, "end": 455.4, "token_count": 590, "text": "For det som skjedde med to SUPU-er... Kan ta det en gang til eksplosivt. Når jeg har to SUPU-er, så er på en måte ikke dette multitasking. De kjører på to forskjellige zippe-u-er. Så de kjører reelt sett samtidig. Multitasking er når de bytter på på samme zippe-u-er. Så dette er SMP - Simultaneous Multiprocessing. Vi skal gå gjennom de begrepene senere. Men SMP, da kjører man samtidig på to forskjellige enheter. To forskjellige kjerner. Eller core. Så én core er da én regneenhet. Jeg sier ofte CPU, så da mener jeg én ren enhet. Vi kan jo ha mange cours inne på én CPU, men hvis jeg sier CPU uten å spesifisere noe spesielt, så tenker jeg på en core eller en enkelt regneenhet. Og det er det også OS og Topp rapporterer det som. Så da kan vi prøve å kjøre... Skal vi se hvor vi var... Ja, den forløkken. Én, to. Så kan vi prøve å øke den forløkken til tre. Sånn at vi kjører tre prosesser samtidig. Og da ser vi... Da får de plutselig ikke 75 %, men de får noe sånt som 67 %. Her er det i hvert fall én av prosessene som bytter helt inn. For noen ganger kjører begge på én, og andre ganger kjører begge på null. Og den måten å gjøre dette på, det er fair scheduling. Linux-skeduleren, altså den som fordeler hvilke prosesser som kjører hvor, den heter fair scheduler, og den prøver å gi så lik CPU-tid til... Her er det tre stykker som hele tiden vil ha CPU. Da fordeler en det ved at hele tiden kjører en på hver av CPU-ene, men så bytter man på hvilken av de tredje som kjører. Det byttes ganske ofte, noen ganger i sekundet, men ikke hele tiden, for det koster en del å bytte fra én CPU til en annen. På den måten ser vi at alle de prosessene bruker omtrent like lang tid. 25 på den ene og 26,5 på den andre og 26,7 på den tredje.", "source": "lecture"}
{"lecture_id": "os7del2", "chunk_id": "os7del2_0003", "start": 424.16, "end": 611.32, "token_count": 598, "text": "Da fordeler en det ved at hele tiden kjører en på hver av CPU-ene, men så bytter man på hvilken av de tredje som kjører. Det byttes ganske ofte, noen ganger i sekundet, men ikke hele tiden, for det koster en del å bytte fra én CPU til en annen. På den måten ser vi at alle de prosessene bruker omtrent like lang tid. 25 på den ene og 26,5 på den andre og 26,7 på den tredje. Men sånn røft sett så prøver man å gi like mye CPU til hver. Og sånn kan vi fortsette. Vi kan prøve å se hvordan dette her ser ut på en CPU med... Nei, på en maskin med fire CPU-er. Og det jeg skal gjøre i bakgrunnen da, det er å... Jukse litt. Ved å da skru på noen CPU-er i bakgrunnen. På den Linux-maskinen så kan jeg gjøre det fra kommandolinja. Jeg må riktignok være Ruth, men jeg kan aktivere CPU-er. Så det jeg gjorde i bakgrunnen nå, det var... Jeg skal se på hvordan jeg gjør det senere. Det var å aktivere to til av CPU-ene. At jeg skulle ha fire. Da må jeg gå inn og ut igjen med topp. Hvis jeg taster én nå, så ser vi øverst her... Jeg tastet én, og da får jeg ut at nå har denne serveren her fire sepuer. Hvis jeg nå kjører akkurat samme med tre regnejobber, De tre regnejobbene er i gang, og så får de nå hver sin CPU. Hvis jeg legger inn last used CPU igjen... Så starter vi på nytt, for det var ferdige. Så ser vi at nå så står de på 3, 2 og 1. Vi kan vel også se at de står fast der, stort sett. Den som slutter på 29, står på 3. Ja, 29, den er på 3 fortsatt. 29... Ja. Stort sett, hvis det ikke er noen grunn til det, så blir de stående og kjøre på den sammen. Men da kan vi gjøre tilsvarende. Hva skjer nå om vi kjører fem og kanskje seks sepuer? Nei. Vi kjører seks prosesser på denne maskinen. Har fire CPU-er. Og da ser vi at... Da blir det altså firedel på seks.", "source": "lecture"}
{"lecture_id": "os7del2", "chunk_id": "os7del2_0004", "start": 570.0, "end": 670.04, "token_count": 321, "text": "Den som slutter på 29, står på 3. Ja, 29, den er på 3 fortsatt. 29... Ja. Stort sett, hvis det ikke er noen grunn til det, så blir de stående og kjøre på den sammen. Men da kan vi gjøre tilsvarende. Hva skjer nå om vi kjører fem og kanskje seks sepuer? Nei. Vi kjører seks prosesser på denne maskinen. Har fire CPU-er. Og da ser vi at... Da blir det altså firedel på seks. Det blir to tredjedeler CPU-kapasitet på hver. Og det blir omtrent 67 %. Det varierer litt opp og ned, men sånn ca. 67 %. Og så bytter man hele tiden på prosessene. 25. Så får de noe sånt som... Ja, ca. 80 % burde det bli. Men her ser vi... Ja... Man kan se det varierer litt. Øverst er det alltid én med 98. Men den får liksom en boost. Hvis du ser på totaltiden, så blir den omtrent lik til slutt. Hvis du ser på totaltiden her, så ligger de rundt sånn 21... Litt forskjeller blir det. Men i utgangspunktet så prøver Operativstemme å fordele tiden likt.", "source": "lecture"}
