{"lecture_id": "os7del1", "chunk_id": "os7del1_0000", "start": 0.02, "end": 187.72, "token_count": 597, "text": "Ja. God morgen, alle sammen. Som alltid er det veldig hyggelig å se at så mange av dere har kommet dere opp og er klar for Operativstem-forelesning. Det er kjempebra. Jeg vet jo ikke hvordan det går fremover. Vi kan jo håpe det blir fysiske forelesninger snart. Men som dere vet, så er det fortsatt uklart. Men vi håper at vi etter hvert skal komme i gang. Men som dere ser på timeplanen her, så er det... Ja, så har vi kommet ganske langt. Vi er nå i uke syv, så i neste uke er det konteuke. Så da er det ingen vanlige forelesninger. Og det er heller ikke ny. Nye oppgaver. Som det står her, er det ikke oppgaver pga. Conte-eksamene. Så... Så da er det ikke nye oppgaver. Men jeg tenker... Det er heller ikke lagt ut noe om container og dokker, som er neste tema. Men jeg tenkte å gjøre det i løpet av uka, iallfall, sånn at de som er veldig langt fremme, kan komme i gang med oppgaver fra uke ni. Og for de som er veldig hyppe på å komme i gang med det, så skal vi se veldig kort på hvordan vi kan starte dokkekonteinere i Linux-VM-ene, sånn at dere kan komme i gang med å eksperimentere. Det var litt uklart med Ine og Rune i dag, men jeg tror etter hvert kanskje begge kommer. Så uansett, still spørsmål i chatten, og i hvert fall si ifra hvis noe er galt. Ja, så må jeg si at dette opptaket blir tatt opp. Selv om dere ikke hører den This meeting is recorded-stemmen, så tar jeg det opp i bakgrunnen. Som vanlig så legger jeg det ut etter hvert. Jeg lurer på om jeg kanskje ikke har husket å redigere fra forrige gang. Altså... Nei. Der ser jeg vi bare har uredigerte opptak. Men det kommer vi også til å gjøre i løpet av uka. Redigere disse og legge det ut under enkelttemaer. Så det er litt lettere å bli her hvis man står fast med problemer i oppgaver, f.eks. Så... Temaet i dag er multitasking fortsatt. Vi så forrige gang på multitasking litt sånn i... Skal vi se...", "source": "lecture"}
{"lecture_id": "os7del1", "chunk_id": "os7del1_0001", "start": 140.04, "end": 329.92, "token_count": 588, "text": "Jeg lurer på om jeg kanskje ikke har husket å redigere fra forrige gang. Altså... Nei. Der ser jeg vi bare har uredigerte opptak. Men det kommer vi også til å gjøre i løpet av uka. Redigere disse og legge det ut under enkelttemaer. Så det er litt lettere å bli her hvis man står fast med problemer i oppgaver, f.eks. Så... Temaet i dag er multitasking fortsatt. Vi så forrige gang på multitasking litt sånn i... Skal vi se... Hadde jeg en sist... Nei, det hadde jeg ikke. Vi kan gå tilbake til forrige gang. Ja, vi avsluttet dette med Branch Prediction. Så så vi litt på operativsystemhistorie. Og så så vi på... Og for å repetere det veldig fort, så er hovedideen at prosesser bytter på. Man kan bruke... Oi... Kan du dele skjermen? Betyr det at dere ikke ser skjermen min? Jeg ser, ja. Jeg ser skjermen... Ja, fint. For det jeg gjør, er å... Jo, jeg deler det vinduet som jeg ser, sånn at da må du... Ja, hvis dere ikke ser vinduet, så kanskje prøve å logge på igjen på Zoom. Jeg kjemper for at dere svarer kjapt. De fleste ser her i hvert fall. OK... Ja, da ser dere her. Dette er liksom grunnideen i multitasking. Vi har tre prosesser P1, P2 og P3. Og så bytter man hele tiden på hvilken av de prosessene som kjører. Og hele tiden, det er veldig ofte. Her ser du så millisekunders. Omtrent hvert hundredels sekund så kommer det da en ny prosess inn. Og tar over CPU-en og kjører. Først kjører P1. Men i løpet av et mikrosekund, kanskje enda mindre, så skjer det en kontekst-witch. P1 hives ut, P2 kommer inn. Og sånn fortsetter en evig løkke. Og det er ikke alltid at det er noen som ønsker å bruke CPU-en. Selv om du bare har én CPU, så vil de fleste prosesser bare stå og vente, kanskje på input og gjøre noe en gang iblant. Men hvis man har regnejobber som skal regne ut...", "source": "lecture"}
{"lecture_id": "os7del1", "chunk_id": "os7del1_0002", "start": 300.0, "end": 422.78, "token_count": 411, "text": "Men i løpet av et mikrosekund, kanskje enda mindre, så skjer det en kontekst-witch. P1 hives ut, P2 kommer inn. Og sånn fortsetter en evig løkke. Og det er ikke alltid at det er noen som ønsker å bruke CPU-en. Selv om du bare har én CPU, så vil de fleste prosesser bare stå og vente, kanskje på input og gjøre noe en gang iblant. Men hvis man har regnejobber som skal regne ut... Eller jeg skal rendre en video, altså gjøre masse operasjoner for å få ut de riktige pikslene. En skal vri bildet 50 grader, og så må man regne ut hvilke piksler som kommer ut. Da står CPU-en og jobber hele tiden. Og da vil det foregå sånn som dette her. Eller en kompilator, f.eks., som lager maskinkode. Den bruker også CPU hele tiden. Og så begynte vi forrige gang så vidt å se på multitasking i en server som har én CPU. Og da så vi at den serveren, den gjorde akkurat dette her. Hvis det kom to regnejobber som sto og regnet, så fikk de 50 % CPU-tid hver. Det vi skal fortsette med i dag, er å se på multitasking med... Altså multicore multitasking, at du har mange CPU-er som kjører i parallell. Og da skal vi se på hvordan jobbene da blir fordelt mellom CPU-ene. Og det... Vi så vel så vidt på det forrige gang også, men vi fortsetter omtrent... Da er vi slappe, i hvert fall.", "source": "lecture"}
