{"lecture_id": "os7del6", "chunk_id": "os7del6_0000", "start": 0.0, "end": 189.44, "token_count": 591, "text": "Vi skal fortsatt se på mikroarkitektur og datamaskinarkitektur og hvordan multitasking foregår. Men for å forstå multitasking er det viktig å forstå hva cash er, og hvordan internminnet opererer sammen med CPU-en. Vi har sett på internminnet tidligere. I simulerings-CPU-en vår så vi hvordan vi hadde Både egne instruksjoner som flytter data fra registeret og ut i internminnet. Og da er den store problemstillingen med RAM og CPU at RAM er relativt tregt. En CPU utfører instruksjoner veldig mye raskere enn det kan hentes fra RAM. Det er kanskje en faktor ti. Og hvis man ikke gjorde noe med det, så måtte Sippune så vente hele tiden på data. For instruksjoner må hentes fra RAM. Et program som kjøres. Alle instruksjonene ligger i RAM. Og for å kjøre dem, så må de hentes én og én fra RAM. Og hvis det går mye saktere enn den tiden det tar å utføre en instruksjon, så hoper det seg opp med instruksjoner, og det går ikke så fort... Og det er der cash kommer inn. Cash er egentlig fransk og betyr et hemmelig lager. Så cash er et mellomlager mellom ram og CPU. Og cash er et veldig hurtig-ram, så vi skal se er det S-ram? Det er akkurat samme teknologi som det er i registrene. På et digert lager med ekstra registre. Men de er ikke registre i den betydning at CPU-en oppfatter dem som registre. De er bare en mellomlagring av data fra RAM på vei inn til CPU-en og på vei ut fra CPU-en. Og hele prinsippet med at det hjelper å få et hurtiglager mellom RAM og CPU, Statistisk sett, når man utfører institusjoner, så bruker man bare en liten del av minnet. Det er en liten del av institusjonene som statistisk sett utføres om og om igjen. Og ofte er det også sånn at man bruker om og om igjen data i ram som ligger ved siden av hverandre, f.eks. i et ærøy. Så dermed er det mye tid å spare hvis man henter mange biter av gangen. I cash. Vi skal se på etterpå hvordan det ser ut sånn rent fysisk.", "source": "lecture"}
{"lecture_id": "os7del6", "chunk_id": "os7del6_0001", "start": 154.04, "end": 339.56, "token_count": 592, "text": "så bruker man bare en liten del av minnet. Det er en liten del av institusjonene som statistisk sett utføres om og om igjen. Og ofte er det også sånn at man bruker om og om igjen data i ram som ligger ved siden av hverandre, f.eks. i et ærøy. Så dermed er det mye tid å spare hvis man henter mange biter av gangen. I cash. Vi skal se på etterpå hvordan det ser ut sånn rent fysisk. Minnepyramiden er et viktig prinsipp. Og prinsippet er at vi har forskjellige enheter som lagrer data, og som er koblet til en CPU. Her er det veldig stor forskjell på hvor lang tid det tar å hente dataene. Vi har registrene øverst i minnepyramiden. De er de raskeste, og de bruker kortest tid på å hente data til aluen. For det er jo registrene som er koblet til aluen, så der går det lynkjapt. Og så har man noen lag med cash. Her har jeg L1-cash og L2-cash. De fleste moderne superviraer har L3-cash også i tillegg, som da går litt saktere, men teknologien her er den samme. Dette er S-ram. De er veldig hurtige, men det er større mengde. Så vi har flere megabyte med L2-cash, og det tar da litt tid å frakte det inn til registrene. Så derfor går det litt lenger tid. Så kommer man ned til ram, som er 4-8 gigabyte. Men hovedpoenget er at det går omtrent en faktor ti saktere å hente inn data fra RAM. Så det er derfor man bruker det mellomlageret her med cash. For å mellomlagre det som må hentes fra RAM, sånn at det kommer raskere inn til reaserne. Vi skal se på etterpå nøyaktig hvordan det kommer raskere inn. Senere i kurset skal vi se på harddisker også. Her er HDD-disk... Hardware Drive, som er en tradisjonell disk. Og den er et platelager med disker som fysisk snurrer rundt, sånn som CD-er. Og her har vi SSD, Solid State Disk, som vi ser røfflig, En vilkårlig... En vilkårlig bite på disken. Riktignok henter du gjerne 512 av gangen, men når du skal hente", "source": "lecture"}
{"lecture_id": "os7del6", "chunk_id": "os7del6_0002", "start": 294.68, "end": 396.04, "token_count": 329, "text": "Senere i kurset skal vi se på harddisker også. Her er HDD-disk... Hardware Drive, som er en tradisjonell disk. Og den er et platelager med disker som fysisk snurrer rundt, sånn som CD-er. Og her har vi SSD, Solid State Disk, som vi ser røfflig, En vilkårlig... En vilkårlig bite på disken. Riktignok henter du gjerne 512 av gangen, men når du skal hente vilkårlig bite på disken, så går SSE-disk mye raskere. For her er det ikke noen fysiske plater som snurrer rundt. Det er mer som sånn minne på minnepinner. Men likevel så er det en factor 1000 saktere ramme, så det går fortsatt veldig sakte. For vesentlig raskere enn fra harddisk. Ja, det er noen spørsmål om SSD-disken, om det... Ja, vi kommer tilbake til det senere. Men det er en del andre begrensninger med SSD. Altså hvordan du kobler den opp til maskinen. Hva slags buss du har ut til SSD-en. Det har også en del å si. Men med sånn optimal tilkobling på begge, så kan det være en... En fakta på 1000. Men mer om det senere når vi skal snakke om disker.", "source": "lecture"}
