{"lecture_id": "os7del14", "chunk_id": "os7del14_0000", "start": 0.0, "end": 186.16, "token_count": 593, "text": "Ja, hyperthreading er opprinnelig en markedsføringsterminologi som Intel innførte. Det er altså Intels varemerke hyperthreading. Som vi ser her nede, så er den generelle betegnelsen SMT. Simultaneous Multithreading. Så når AMD bruker det samme prinsippet, så kaller de det for SMT. Men vi ser først på Intel og Hyperthreading. Hyperthreading består i at én single core CPU, dvs. én CPU som har én enkelt alu, én regneenhet, én kjerne, kan inneholde to prosesser samtidig. Litt av innholdet i CPU-ene er da duplisert, spesielt registre. For det kan ikke lastes ut. Men dette foregår da på hardware-nivå. Så operativsystemet opplever dette som to selvstendige prosessorer. Det lister det i topp som to selvstendige prosessorer. Men det som skjer i virkeligheten, er at når OS fordeler prosesser til denne prosessoren som er hypertraining, så settes det i gang. Men de to prosessene deler da Alun, som er på denne CPU-en. Og da er det Hardware som switcher kjøpt imellom de to prosessene. Og dette skjer i løpet av nanosekunder, altså ekstremt hurtig. Og dette er ikke i nærheten av det som skjer når man gjør Context Switch med OS. Det tar veldig mye lengre tid. Og denne teknologien er da lagd fordi man har sett at... Selv om man har pipelining og mikrooperasjoner som utføres i parallell på superskalare CPU-er. Til tross for det, så vil det hele tiden være litt hardware-ressurser som ikke blir brukt. F.eks. at alun ikke blir utnyttet fullstendig. Og det er typisk, for selv med cash må man noen ganger vente på... Resultater eller vente på noe fra RAM eller fra andre devices. Denne ventetiden utnyttes av å lynhurtig switche frem og tilbake mellom de to prosessene som kjører. Det er dette som er hypertrening. Det typiske er at de har egne registre for hver prosess, men deler felles ALU. Etterpå skal vi kjøre noen tester, og da vil vi se at... Det går saktere når man har hypertrening, fordi de må dele på alle.", "source": "lecture"}
{"lecture_id": "os7del14", "chunk_id": "os7del14_0001", "start": 150.0, "end": 214.0, "token_count": 208, "text": "Resultater eller vente på noe fra RAM eller fra andre devices. Denne ventetiden utnyttes av å lynhurtig switche frem og tilbake mellom de to prosessene som kjører. Det er dette som er hypertrening. Det typiske er at de har egne registre for hver prosess, men deler felles ALU. Etterpå skal vi kjøre noen tester, og da vil vi se at... Det går saktere når man har hypertrening, fordi de må dele på alle. Og som jeg nevnte, hypertrening styres og har det vel. Så OS vet egentlig ikke noe om dette her. Ja, de vet litt om det, men den er ikke med og styrer. Den bare gir prosesser til CPU-en, og så utfører CPU-en disse lynhurtige switchene mellom de to. I tillegg til prosessen om Kjell.", "source": "lecture"}
