{"lecture_id": "os7del12", "chunk_id": "os7del12_0000", "start": 0.0, "end": 206.56, "token_count": 600, "text": "Multitasking og multiprosessing. Det er mange begreper som man må forholde seg til. Her er en liten oppsummering av noen av begrepene. Multitasking, eller multiprogramming, det er det som vi har sett på når operativsystemet fordeler tid på samme CPU. Ved å kappe opp tiden i små biter, og så dele ut tid til hver prosess. Det er multitasking. Multiprosessing er når to eller flere CPU-er samtidig kjører flere prosesser. I samme datamaskin kan du f.eks. ha fire CPU-er. Og hver av de kan da jobbe på én prosess helt samtidig. Og det er multiprosessing. Så har du det som kalles symmetrisk multiprosessing. Da... er det... Jo, den vesentlige forskjellen her er at da deler de på samme internmine. I multiprosessing så trenger du ikke å dele på samme internmine engang. SMP er det som er vanlig når du kjører i en server, sånn som de eksemplene... Da er alle prosessorene koblet til samme internminer. Og så kjører de helt samtidig, i virkeligheten, i sanntid samtidig. Men det vi har sett på eksempler på hele tiden, er at vi har SMP samtidig som vi har multitasking. For operativstemme fordeler da mange prosesser på samme CPU, men samtidig så er det mange som kjører i parallell. Og så har vi multi-core multiprosessing. En liten forskjell der er at da... Når du sier multi-core, så sitter da flere prosesser på samme brikke. Altså multi-core. Core er en kjerne eller en regneenhet. De sitter da på samme brikke og deler også cash, og kjører prosesser samtidig. Regnes også som SMP. Her er det heller ikke så store forskjeller. I praksis vil du ikke merke noen forskjell om det er SMP eller Multicore. Du kan også ha en kobling av dette. Altså at du har... En CPU-brikke med fire kjerner. Og så har du to sånne CPU-brikker inne i den samme maskinen. Men de ville dele inn interne mine. Så det var noen begreper. Skal vi se på noen eksempler på disse begrepene? Ja. Her ser vi, fra venstre mot høyre... For det første singelprosessor, sånn som det var i gamle dager.", "source": "lecture"}
{"lecture_id": "os7del12", "chunk_id": "os7del12_0001", "start": 157.48, "end": 343.76, "token_count": 595, "text": "I praksis vil du ikke merke noen forskjell om det er SMP eller Multicore. Du kan også ha en kobling av dette. Altså at du har... En CPU-brikke med fire kjerner. Og så har du to sånne CPU-brikker inne i den samme maskinen. Men de ville dele inn interne mine. Så det var noen begreper. Skal vi se på noen eksempler på disse begrepene? Ja. Her ser vi, fra venstre mot høyre... For det første singelprosessor, sånn som det var i gamle dager. Nå er det nesten umulig å oppdrive noen som helst prosessor Som bare har én CPU, med LN og AltoCash og koblet til ramme. Dette er en duel-prosessor. Da ser vi at det er to separate brikker. Og man merker ikke så veldig stor førsel på det og den ved siden av, som er duel-core. Men her er det to separate fysiske brikker som du kan ta inn og ut av maskinen. Men begge er da koblet til samme ramme. Men de har hver sin cash. Og så har vi to eksempler på multicore-prosessorer. Dette er en dual-core AMD-prosessor. Her ser vi CPU, eller regneenheten, ALU og registeren og alt dette her, sitter inni CPU, og så har vi to atskilte L1- og L2-cash. Og så har du en dual-core Intel-prosessor, som er like. Det er litt annerledes. Der har du CPU med L1-cash, men så ser vi at L2-cash er felles. Og hva som er best av disse arkitekturene, det varierer litt. Som sagt så er det vanlig at man legger på en L3-cash her også, som f.eks. kan være felles. Men hva som er best, det kan variere litt med hva slags load du har på prosessoren. Og hva den skal kjøre, altså på den serveren. Noen ganger, så hvis det er veldig mange like prosesser som deler veldig mye, så kan det være en fordel å ha mye felles cash. Men hvis de hele tiden gjør helt forskjellige ting, så kan det være en fordel å ha hvert sitt cash på den måten her. Så der er det ikke noen fasit på hva som er best av det. Ikke helt nye CPU-er, men de fleste ser ganske like ut som disse i dag. Dette er en fire-core CPU.", "source": "lecture"}
{"lecture_id": "os7del12", "chunk_id": "os7del12_0002", "start": 300.0, "end": 376.2, "token_count": 224, "text": "Og hva den skal kjøre, altså på den serveren. Noen ganger, så hvis det er veldig mange like prosesser som deler veldig mye, så kan det være en fordel å ha mye felles cash. Men hvis de hele tiden gjør helt forskjellige ting, så kan det være en fordel å ha hvert sitt cash på den måten her. Så der er det ikke noen fasit på hva som er best av det. Ikke helt nye CPU-er, men de fleste ser ganske like ut som disse i dag. Dette er en fire-core CPU. Intel Core E7 har denne arkitekturen her. Så her ser vi... Det er fire CPU-er. Hver har L1-cash og L2-cash. Separat. Og så har de en felles L3 cash. Så AMD K10 er ganske lik, bare at den har litt mer L2-cash. Ellers så er de ganske, ganske like.", "source": "lecture"}
