{"lecture_id": "os8del10", "chunk_id": "os8del10_0000", "start": 0.0, "end": 198.4, "token_count": 586, "text": "Hva da når et brukerprogram skal gjøre noe som... Som skal gjøre instruksjoner som ikke kan utføres fra Jus og Maud? Hvordan kan da brukerprogrammet få til det? Og det kan f.eks. være sånn som å lese noe fra disk. Sånn generelt så har jo operativsystemet full kontroll på disken. Men hvordan kan da et brukerprogram lese noe fra disken når den må utføre operasjoner som bare kan gjøres i kernel mode? Jo, der da systemcall kommer inn. Og det er rett og slett brukerkode som ber kjernen om hjelp ved hjelp av systemcall. Et systemkall er egentlig bare et API mot operativsystemkjernen. Det er et sett med operasjoner som et vanlig brukerprogram fra YSMOD kan be operativsystemkjernen om å gjøre. På samme måte som du har et API, et Application Programming Interface, mot moduler og programmer av alle mulige typer. Da er det liksom alle typer. Altså de operasjonene som det er mulig å få utført med dette programmet eller denne metoden. Men vi har et dilemma her hvis vi skal gjøre noe som krever kernal mode. Det kunne jo være sånn at man... At brukerprogrammet kunne sette modusbytt til kernal mode, og så... Og så utføre det man trengte, og så skulle det switches tilbake. Men da får du igjen problemet. Hvis du kan gjøre switch til curl-mode, så kan bruksprosessen ta over og stoppe systemet. Så igjen må vi ha hjelp fra Harvey, og da er det en spesiell intensjon som heter trap. Og trap, det som er det fine med den, er at den switcher til curl-mode og hopper til kode for et systemkall i én og samme operasjon. Og det betyr at fra juicemode så kan du ikke da først hoppe til kernel mode, og så love å si... Ja, etterpå... Jeg lover. Jeg skal gjøre systemcall etterpå. Men dette må gjøres i én og samme operasjon. Og for å få til noe i én og samme operasjon, så må man ha én instruksjon som gjør det. Så igjen så får man hjelp fra Hardware for å få til systemcall. Her er en oversikt over hvordan et systemkall foregår. Og da ser vi på venstre side her, så er vi i brukerminne.", "source": "lecture"}
{"lecture_id": "os8del10", "chunk_id": "os8del10_0001", "start": 150.0, "end": 333.08, "token_count": 597, "text": "Og det betyr at fra juicemode så kan du ikke da først hoppe til kernel mode, og så love å si... Ja, etterpå... Jeg lover. Jeg skal gjøre systemcall etterpå. Men dette må gjøres i én og samme operasjon. Og for å få til noe i én og samme operasjon, så må man ha én instruksjon som gjør det. Så igjen så får man hjelp fra Hardware for å få til systemcall. Her er en oversikt over hvordan et systemkall foregår. Og da ser vi på venstre side her, så er vi i brukerminne. Og på høyre så har vi privilegert-minne. Og her er det vanlig brukerkode som kjører Jusemodes. Institusjon 1, 2, 3 osv. Og så... Skal gjøres et systemcall. Og det er systemcall nummer tre i API-et. Og sånn ser det ut i Lynix-API-et. Så er det systemcall. Den er nummerert da det var her. Og det finnes mange hundre systemcall. Men det er noen få som gjøres veldig ofte. Og tredje systemkall, Sister Read, det er akkurat det jeg også leser fra disk. Og det kan man ikke gjøre i Use and Mode. Og det som skjer da, er at her kommer et system kalt Trap 3. Og da... En viktig del av systemkallet er den institusjonen Trap. For den switcher da til... Den switcher modusbit til Curl-mode. Samtidig som den hopper inn i en branching-tabell her og hopper til første kodelinje i det systemkallet. Så da, i én institusjon, så switches modus blitt. Og første institusjon for dette systemkallet legges inn i... Inn i institusjonsregisteret. Det er den neste institusjonen som skal gjøres. Det må vi hele tiden tenke på. Vi har i utgangspunktet bare én CPU som vi ser på, og det er bare én av gangen som kan gjøre instruksjoner. Så dermed må man ha en sånn hardware-hjelp fra trap for å kunne både hoppe inn, switche modusputt, switche modusputt og hoppe inn i neste instruksjon. Og på denne måten så får man full kontroll. Wimebranching-tabell, det er rett og slett bare en tabell Her ligger da adressen til Dar-i-Ram,", "source": "lecture"}
{"lecture_id": "os8del10", "chunk_id": "os8del10_0002", "start": 297.08, "end": 503.48, "token_count": 592, "text": "Vi har i utgangspunktet bare én CPU som vi ser på, og det er bare én av gangen som kan gjøre instruksjoner. Så dermed må man ha en sånn hardware-hjelp fra trap for å kunne både hoppe inn, switche modusputt, switche modusputt og hoppe inn i neste instruksjon. Og på denne måten så får man full kontroll. Wimebranching-tabell, det er rett og slett bare en tabell Her ligger da adressen til Dar-i-Ram, som første institusjon i dette systemkallet ligger. Ja, dette er en illustrasjon fra Tanbaum på systemkall. Litt mer... Litt flere detaljer, men ideen er den samme. Vi har vanlige institusjoner her. Én, to, tre. Og så kaller man read. Og så må det gjøres en del under huden med å få riktige verdier inn i forskjellige registre osv. Men så er det da den trap to cornal. Da hopper man inn i kjernekodet, utfører systemkallet, Men det er masse som må holdes orden på her. At man må hoppe tilbake til riktig sted i use mode osv. Så det er en ganske kompleks operasjon. Men det viktige prinsippet, det er trap. At man da både switcher modusbytt og hopper til systemkalkon. I én og sammen institusjon. Her er noen eksempler på systemcall. Vi så et av de tidligere... var fork. Og det er typisk noe som er systemcall. Altså at man... Fork brukes i Linux til å sette i gang en ny prosess. Da er det klart... Det kan ikke et vanlig brukerprogram gjøre. Der må operativsystemet inn og styre. Vi skal bruke det litt senere når vi skal forke og snakke med child. Men dette er igjen sånn prosessmanagement. Så har vi sånn som filemanagement, som vi har sett på, med open, close, read, write, skrive til og fra filer. Disken og filsystemet, det er det operativstemmet som kontrollerer. Her må vi bruke systemcall for å oppnå det. Igjen så kunne vi hatt vanlige brukerprosesser som styrte dette fra use and bot, men da kunne man risikere å krasje hele disken og skrive over for andre brukere osv. Så er det sånn som directory and system management med MKDIR.", "source": "lecture"}
{"lecture_id": "os8del10", "chunk_id": "os8del10_0003", "start": 458.0, "end": 640.0, "token_count": 502, "text": "Så har vi sånn som filemanagement, som vi har sett på, med open, close, read, write, skrive til og fra filer. Disken og filsystemet, det er det operativstemmet som kontrollerer. Her må vi bruke systemcall for å oppnå det. Igjen så kunne vi hatt vanlige brukerprosesser som styrte dette fra use and bot, men da kunne man risikere å krasje hele disken og skrive over for andre brukere osv. Så er det sånn som directory and system management med MKDIR. Link... mount... Vi ser sånn som MKD-er. Det er en del av de Shell-kommandoene som faktisk heter det samme som systemcall. Og i C så er alle disse systemcallene implementert. Så dermed så kan man skrive C-programmer som direkte utfører systemcall mot Linux-kjernen. En del sånn diverse, sånn som Kill, for eksempel, som opplagt trengs et systemkall for å gjøre. Det kan heller ikke en brukerprosess gjøre mot f.eks. andre brukere. Ja, her er noen vindussystemkall. Jeg har satt opp en masse systemkall Dette er bare for å illustrere at alle moderne operativsystemer har en tilsvarende mekanisme med systemcall. Men ofte er ting ganske forskjellig, sånn som Windows 32. Har ikke fork i utgangspunktet. De har rett og slett en create process. Det er da et systemcall som lager en ny prosess. Akkurat som Linux har Read, så har Windows-operativstemme ReadFile for å lese data fra en fil. Men i prinsippet så virker Windows og andre operativstemmer på nøyaktig samme måte, at det må gjøre systemkall for å... Vanlige brukerprosesser må gjøre systemkall når de skal gjøre kjerneoperasjoner. Alt som har med å snakke med hardware, og alt som har med å styre prosesser. Det er typisk kjernevirksomhet som man er nødt til å gjøre systemcall for å få utført.", "source": "lecture"}
