{"lecture_id": "os8del14", "chunk_id": "os8del14_0000", "start": 0.0, "end": 184.32, "token_count": 580, "text": "Så tenkte jeg kunne si litt om... Denne simuleringen som jeg snakket om. Skal vi se... Her. Skedulering av samtidig forelesning og vaffelrørlaging. Ja, dere kan jo i fred og ro kose dere med denne videoen. Litt popkorn og cola osv. Så kan dere se hvordan et operativsystem virker i praksis. Det jeg har prøvd å gjøre her, er å lage et operativsystem som bruker dette med poker fra Linux 2.6-kjernen. Og stort sett opererer på samme måte. Og da vil dere se i videoen at jeg har på en... En bandyhjelm, eller en sykkelhjelm? Eller iallfall en hjelm. Og hovedpoenget med den hjelmen, det er modusbyttet. Så dere kan se... Når timeren går av, så tar jeg på meg hjelmen. Og dette skal da skje automatisk. Det er på en måte hardware som gjør det. Med en gang jeg sier den piper, så skal hjelmen komme på av seg selv. Det er vanskelig å være operativ system, så det er ikke alltid jeg klarer å få det helt til. Men det er utgangspunktet. Så det er da et ytre interrupt. Og så i tillegg så har vi noen... Så dette er da institusjoner, operatissysteminstitusjoner. Så dette er kjernen. Så jeg starter opp med å lese readylist over prosesser som jeg ønsker skal kjøre. Og så er det da to prosesser. Kan hoppe til det. Vaffelprosess og Forelesningsprosess. Og disse to prosessene, det er da to programmer som jeg ønsker å kjøre. Og vaffelprosessen, det er omtrent sånn som jeg lager vafler. Selv om jeg ikke skriver når jeg assemblerer kode for det. Og så sjekker jeg om det er blandet. Det er en typisk compare-oppgave. JMPNB - jump not blandet. Da hopper jeg tilbake, og så fortsetter det sånn. Men så kommer det et viktig poeng i denne sammenhengen. Og det er når jeg skal hente melk... Det tilsvarer på en måte at jeg skal... Nå trenger jeg melk til røra, og det ligger på disk. Og da må jeg gjøre et systemkall.", "source": "lecture"}
{"lecture_id": "os8del14", "chunk_id": "os8del14_0001", "start": 144.18, "end": 337.88, "token_count": 593, "text": "Selv om jeg ikke skriver når jeg assemblerer kode for det. Og så sjekker jeg om det er blandet. Det er en typisk compare-oppgave. JMPNB - jump not blandet. Da hopper jeg tilbake, og så fortsetter det sånn. Men så kommer det et viktig poeng i denne sammenhengen. Og det er når jeg skal hente melk... Det tilsvarer på en måte at jeg skal... Nå trenger jeg melk til røra, og det ligger på disk. Og da må jeg gjøre et systemkall. For det å hente melk må jeg få hjelp av operativsystemkjernen til å gjøre. Og da er jeg et vanlig program som opererer uten hjelm. Og så når jeg gjør et systemkall, da vil du se at da kommer hjelmen på. For da må jeg be operativsystemkjernen om hjelp. Da ber kjernen... Den setter i gang den prosessen. Eller da hopper vi tilbake til kjernekode et eller annet sted her. Jo, her er det... Legg melk i buffer. Set need rechard osv. Og så vil dere se at det er Eva, som mange av dere kjenner fra Diskrematematikk, som er melkemannen i dette opplegget. Spoiler alert... At det fungerer ikke helt optimalt. For tanken er at... Dette med å hente melk skal ta veldig lang tid. Men det har jeg ikke formidlet godt nok. Og jeg bare står på døra med melken med en gang. Da blir det litt forviklinger. Dere får se. Og hovedpoenget er da at en vanlig brukerprosess må bli bedre. Og da tar den på en måte frivillig på seg... hjelmen, og kommer over i køllen mot... Mens så ville hvert minutt... Så skjer det et timertick, for jeg har en hardware-timer. Det er en sånn liten kjøkkenklokke som hvert minutt så ringer den. Og da kommer hjelmen automatisk rett på. Og så... Her er en timer call. Det er den interrupt-rutinen som man hopper til når det kommer et time-out-call. Og da ser du... Da sjekkes det om counter er null. Hvis summen av alle er null, så startes en ny epoke. Hvis ikke, så... Ja, hvis den ene counteren... Er den null, så flyttes den fra ready-list, og så gjør man et kall til scheduler.", "source": "lecture"}
{"lecture_id": "os8del14", "chunk_id": "os8del14_0002", "start": 288.4, "end": 469.42, "token_count": 591, "text": "Det er en sånn liten kjøkkenklokke som hvert minutt så ringer den. Og da kommer hjelmen automatisk rett på. Og så... Her er en timer call. Det er den interrupt-rutinen som man hopper til når det kommer et time-out-call. Og da ser du... Da sjekkes det om counter er null. Hvis summen av alle er null, så startes en ny epoke. Hvis ikke, så... Ja, hvis den ene counteren... Er den null, så flyttes den fra ready-list, og så gjør man et kall til scheduler. Og så kommer scheduleren inn, og da velger den én av de to prosessene som skal kjøre. Men hvis det ikke har skjedd noe spesielt, hvis det ikke har vært noe interrupt, så er det bare den prosessen som står og kjører, som fortsetter, sånn at man unngår context switch. Hvis ikke, så må man sette i gang et context switch. Eller så switcher man til forelesningsprosessen. Og forelesningsprosessen, det er denne prosessen her hvor jeg har dagens faktum og snakker om Linux og utviklingen av Linux, og Linus Torvalds bor på en hybel i Helsinki osv. Og det er da altså operasjoner som jeg som hardware... Jeg ønsker å få utført disse to prosessene her samtidig. Og så ønsker jeg at de ikke skal ødelegge for hverandre. Og da har jeg da den tredje prosessen, som er operativ stemkjernen, som sørger for at disse to samkjører på en riktig måte. Sånn jeg gjør det, ligger den ganske så tett opp til Linux 2.6-kjernen med epoker, så det er en relativt realistisk simulering. Men den ligger som sagt her. Ja, dere har også sett på OS Egg. Det er liksom høydepunktet. Her vil dere se hvorfor det er viktig å ha på seg hjelm når man skal knuse egg. For å knuse egg er opplagt noe som du må gjøre med et systemkall. Det kan ikke en vanlig brukerprosess gjøre.  Så jeg håper dere får... At det også er litt fornøyelse å se på dette her. Men samtidig så er det veldig seriøst. Det er akkurat sånn... Eller det er veldig tett opptil hvordan operativsystemet utfører sin kjernevirksomhet.", "source": "lecture"}
{"lecture_id": "os8del14", "chunk_id": "os8del14_0003", "start": 426.76, "end": 474.54, "token_count": 146, "text": "Her vil dere se hvorfor det er viktig å ha på seg hjelm når man skal knuse egg. For å knuse egg er opplagt noe som du må gjøre med et systemkall. Det kan ikke en vanlig brukerprosess gjøre.  Så jeg håper dere får... At det også er litt fornøyelse å se på dette her. Men samtidig så er det veldig seriøst. Det er akkurat sånn... Eller det er veldig tett opptil hvordan operativsystemet utfører sin kjernevirksomhet. Bruke hjelm når man klekker egg? Nei, når man knuser egg.", "source": "lecture"}
