{"lecture_id": "os8del1", "chunk_id": "os8del1_0000", "start": 0.0, "end": 187.76, "token_count": 584, "text": "Forrige uke var det... Komte uke, så jeg håper at... Mange av dere klarte å ta inn det tapte hvis dere lå litt tilbake. For det har vært ganske... Ganske intenst, egentlig, de første ukene. Vi har på en måte kommet litt lenger enn vi var i fjor. Så det kommer nok... Det er en hard periode nå i dette kurset. Mye roligere etter påske, sånn... Vi har bare satt opp undervisning fram til uke 16. Det er mulig vi da får ganske mye tid til å se på tidligere eksamensoppgaver og så fordøye det stoffet vi har lært. Så da blir det litt mindre trykk mot slutten av kurset. Men her vi er nå, så har vi begynt med en container. Der ligger det en forelesning ute. Jeg hadde i hvert fall tenkt å dele den opp i litt mer deler, sånn at dere kan se på enkeltdeler. Men det er en ganske sakte, rolig, systematisk måte å begynne i praksis med containere, spesielt med dokkercontainere, Og kjøre de på de VM-ene som dere har. Så dokker er noe vi skal jobbe mye med de neste ukene. Jeg får se hvor langt vi kommer i dag. Men jeg tenkte kanskje å bruke litt tid på å se på de første oppgavene denne uken, som går nettopp på dette her, med å kjøre Hello World på dokker og starte opp. Og så, i løpet av dagen, komme frem til det å kunne starte opp en dokkecontainer som kjører en webserver på Linux-VM-en deres. Tidligere så har dere kjørt en webserver direkte på Linux-VM, men nå skal dere kjøre en dokkecontainer inni Linux-VM som kjører en webserver. Så det er en del ting der som kan være litt forvirrende. Jeg skal prøve å sette av litt tid mot slutten i dag, og så kan vi gå inn og se på de oppgavene og se hvordan det er tenkt det skal være. Men ellers så er hovedfokus i dag på scheduling og hvordan et operativsystem egentlig virker.  Altså hele det store bildet av operativsystemet, hvordan det styrer alle prosesser som kjører på en maskin. Vi har sett en del i praksis sånn som...", "source": "lecture"}
{"lecture_id": "os8del1", "chunk_id": "os8del1_0001", "start": 141.44, "end": 337.9, "token_count": 585, "text": "som kjører en webserver. Så det er en del ting der som kan være litt forvirrende. Jeg skal prøve å sette av litt tid mot slutten i dag, og så kan vi gå inn og se på de oppgavene og se hvordan det er tenkt det skal være. Men ellers så er hovedfokus i dag på scheduling og hvordan et operativsystem egentlig virker.  Altså hele det store bildet av operativsystemet, hvordan det styrer alle prosesser som kjører på en maskin. Vi har sett en del i praksis sånn som... Med multitasking og multitredding som vi holdt på med forrige gang... Hvordan operativsystemet da fordeler prosesser på... Og så hvordan et operativsystem deler inn tiden og lar én og én prosess kjøre. Men det er en del problemstillinger som vi ikke har sett på, spesielt hvordan man i praksis kan få til dette her. For der er det en del tilfeller hvor operativsystemet er nødt til å ha hjelp Og ha egne instruksjoner for å kunne kontrollere prosessene. Hvis vi tenker tilbake på dette med prosess, som er et levende liv, så tenker vi oss nå at vi har tusenvis av levende liv innenfor en datamaskin. Og så skal operatørsystemet nå holde orden på alle de tusen. Enkelte liv, altså prosesser, må fryses helt. Alt må lagres. Og så må man sette i gang andre prosesser. Og samtidig så må man sørge for at de ikke ødelegger for hverandre. Og det er de problemstillingene vi skal se på i dag. Så ser vi at det også står vaffelrøre på programmet i dag. Og det er da en simulering som jeg har lagd av hvordan... Rett og slett hvordan et operativsystem virker. Og det... Et operativsystem kan kjøre to prosesser samtidig på samme CPU. Og det er det jeg har illustrert med den vaffelrøre-videoen som ligger ute. Her så er jeg da... Jeg er på en måte... Jeg er en CPU. Og så tenker jeg at jeg skal både holde forelesning og lage vaffelrøre samtidig. Og da må jeg jo switche mellom de to oppgavene. Og da har jeg prøvd å gjøre det på en veldig systematisk måte,", "source": "lecture"}
{"lecture_id": "os8del1", "chunk_id": "os8del1_0002", "start": 297.12, "end": 447.0, "token_count": 501, "text": "Og det... Et operativsystem kan kjøre to prosesser samtidig på samme CPU. Og det er det jeg har illustrert med den vaffelrøre-videoen som ligger ute. Her så er jeg da... Jeg er på en måte... Jeg er en CPU. Og så tenker jeg at jeg skal både holde forelesning og lage vaffelrøre samtidig. Og da må jeg jo switche mellom de to oppgavene. Og da har jeg prøvd å gjøre det på en veldig systematisk måte, nemlig med å kjøre et operativsystem som styrer de to prosessene, som kjører da på meg. Og operativsystemet kjører også da på meg. Og da... Ja, vi kan komme litt mer tilbake til det på slutten. Kanskje vi setter av litt tid også, sånn at vi kan se på den. Men det er altså en... Skal vi se... For de som syns forelesningen blir kjedelig, så kan dere hoppe og så se på den videoen. Ja. Da ønsker jeg velkommen til denne. Vi skal ikke kjøre denne her, men dere ser jeg har et operativstem. Og så lager jeg vafler og holder forelesning samtidig. Dette ligger veldig tett opp til scheduleren i versjon 2.6 i Linux-kjernen. Så det er en litt eldre kjerne. I dag ser scheduleren litt annerledes ut. Men hovedideen er å få vist prinsippene. Så... Men vi kommer tilbake til det mot slutten av forelesningen. Først skal vi se på noen av de tingene som er viktige. For i det hele tatt å få til dette her. Og da er det spesielt prosessormodus. Og så er det trap og systemcall. Det er også en viktig ingrediens i det å lage et operativsystem. Aller først skal vi se på litt... Noe som egentlig henger mer sammen med det vi holdt på med forrige gang med multitasking. Én prosess ikke kan utnytte tosepur.", "source": "lecture"}
