{"lecture_id": "os8del6", "chunk_id": "os8del6_0000", "start": 0.0, "end": 197.8, "token_count": 589, "text": "Men hvordan kan OS effektivt kontrollere brukerprosesser? Jo, problemet er at vi kan ikke bare si til en prosess... OK, nå har du full kontroll på denne CPU-en. Gjør hva du vil. For da kan jo... Da får vi et problem hvis den prosessen da bare sier holdt, eller setter opp en løkke og bare står i en evig løkke og står og går. Operativsystemet skal kontrollere hver eneste instruksjon som brukerprosessen utfører. En slags emulering. Så gir det veldig mye system-overhead. Selv om det på en måte er litt det man kan se med virtuelle maskiner. Med virtualisering, sånn som KVM og WMW osv., men også med Java-virtuell maskin. Så finnes det systemer som på en måte kontrollerer alle... Men så igjen, da... For å få det effektivt så ofte så... Til syvende og sist så endrer det seg med at prosessene må få full kontroll på CPU-en. Må kunne gjøre hver institusjon uten et overhedd. F.eks. den fibonaccirekken. Hvis vi skal utføre den prosessen effektivt, Kontrollere hver enkelt institusjon og se at den ikke gjør noe galt i den koden. Så vi må prøve å finne en løsning på det problemet. Ja... Så... En effektiv løsning på dette problemet... Vi har allerede vært litt inne på det i prinsippet, men ikke hvordan det i praksis utføres. Men den effektive løsningen, den går da jo... Det går ut på at man bruker en hardwaretimer. I systemet så er det en hardwaretimer som da gir et begrenset tidsintervall til brukerprosessene. Og i den simuleringen som ligger ute, så bruker jeg en sånn kjøkkenklokke. Og der ringer hardwaretimeren hvert minutt. Så der er den. Men her, når vi snakker om OS-hardwaretimere, så er det typisk et hundredels sekund. Veldig ofte så kommer det et sånt hardwaretimer-tick. Og da er det sånn... Ved hardware så når det kommer et tick fra timeren, så switches det til... Skal vi se... Nå må jeg se for meg det riktige her. Jo, hver gang hardware-timeren slår inn, så kommer operativsystemet inn.", "source": "lecture"}
{"lecture_id": "os8del6", "chunk_id": "os8del6_0001", "start": 143.36, "end": 338.26, "token_count": 582, "text": "Og der ringer hardwaretimeren hvert minutt. Så der er den. Men her, når vi snakker om OS-hardwaretimere, så er det typisk et hundredels sekund. Veldig ofte så kommer det et sånt hardwaretimer-tick. Og da er det sånn... Ved hardware så når det kommer et tick fra timeren, så switches det til... Skal vi se... Nå må jeg se for meg det riktige her. Jo, hver gang hardware-timeren slår inn, så kommer operativsystemet inn. Da svisjes det til privilegert modus, eller kurl-mode, og så har kjernen kontrollen. Og så, i starten av... Så sier operativsystemet at nå skal den prosessen få lov å kjøre. Så da switcher operativsystemkjernen til brukmodus. Og så laster den inn den første instruksjonen. Det kan være set ice like 1. Det er typisk førsteinstruksjonen til koden som skal kjøre. Og så får den koden stå og kjøre i et hundredels sekund. Hele hovedpoenget da, uansett hva den prosessen gjør, så vil ikke den kunne ødelegge systemet, for den vil da kjøre i brukermodus, og det er helt ufarlig. Den kan ikke hvis en utfører holdt, så skjer det ingenting. Vi kan gå tilbake og se på den koden her. Tenk deg nå, timeren går på. Operativsystemkjernen. Det switches automatisk over til curlen mode, og første operativsystemkodelinje settes inn. Så operativsystem og kontroll. Det operativsystemet gjør da, er å laste inn alt som er nødvendig for at denne prosessen skal begynne å kjøre. Og så switcher operativsystemet, for når du er i curlen mode, Den er ikke motsatt. Så du er i kernemote, så switcher du til usemote, og så legger du denne instruksjonen inn i instruksjonsregisteret. Og så overlater du full kontroll til denne prosessen. Så løper den prosessen opp og ned, opp og ned, opp og ned her milliarder av ganger, lager kjempemange ledd i firmadachi-rekken, og så går det en timer. Da kommer hardware-timeren inn. Og idet hardware-timen kommer inn, så tar operativsystemet over kontrollen.", "source": "lecture"}
{"lecture_id": "os8del6", "chunk_id": "os8del6_0002", "start": 303.76, "end": 495.44, "token_count": 598, "text": "så switcher du til usemote, og så legger du denne instruksjonen inn i instruksjonsregisteret. Og så overlater du full kontroll til denne prosessen. Så løper den prosessen opp og ned, opp og ned, opp og ned her milliarder av ganger, lager kjempemange ledd i firmadachi-rekken, og så går det en timer. Da kommer hardware-timeren inn. Og idet hardware-timen kommer inn, så tar operativsystemet over kontrollen. Og på den måten så kan brukerprosesser kjøre i use-motes og utnytte CPU-en direkte veldig effektivt og så mye de vil, mens hvert hundredel av et sekund så kommer operativsystemet inn og tar over og sier OK, nå er det neste prosess som kjører. Så sånn kan... Apparativsystemet kontrollerer effektivt brukerprosessene på en sikker måte uten at brukerprosessene kan f.eks. skru av helmaskinen. Dette er et minnekart, altså det bildet av ramm på hvordan brukermodus og privilegertmodus, eller corner mode, ser ut på rammenivå. Her øverst har vi den delen av minnet som er tilgjengelig fra brukermodus. Det er typisk av brukerdata og vanlige programmer. Men så er det også noe av operativsystemkjernen. Nei, ikke operativsystemkjernen, men noe av operativsystemet. Altså den delen av operativsystemet som er utenfor kjernen. Det kan være system software som ikke nødvendigvis... som heldigvis trenger å gjøre privilegerte institusjoner. Som ikke trenger det, men som utfører en del jobb akkurat som et vanlig program utfører. Men så har du den privilegerte delen av minnet som utgjør OS-kjernen. Og her kan ikke vanlige brukerprogrammer få aksess her inne. For da kunne de endre på operativstemme. Det vil være en hackers drøm å kunne få tilgang til OS-kjernen. For da kan du virkelig endre planen for alt. Så det må vi gå oss. Og da er det igjen sånn at når modusbytt switcher til brukermodus, Og en prosess prøver å endre på noe i denne adressen her, i RAM, så får den rett og slett ikke lov. Hvis en prosess prøver å endre på noe i RAM", "source": "lecture"}
{"lecture_id": "os8del6", "chunk_id": "os8del6_0003", "start": 447.36, "end": 521.0, "token_count": 207, "text": "For da kunne de endre på operativstemme. Det vil være en hackers drøm å kunne få tilgang til OS-kjernen. For da kan du virkelig endre planen for alt. Så det må vi gå oss. Og da er det igjen sånn at når modusbytt switcher til brukermodus, Og en prosess prøver å endre på noe i denne adressen her, i RAM, så får den rett og slett ikke lov. Hvis en prosess prøver å endre på noe i RAM som tilhører en annen prosess, så får den heller ikke lov. Så dette ville være styrt. Men den privilegerte delen av mine, den er det helt umulig å touche. Og kontrollerer da operativsystemet, alle prosessene, både CPU og ram, ved hjelp av brukermodus og køllmodus.", "source": "lecture"}
