{"lecture_id": "os8del12", "chunk_id": "os8del12_0000", "start": 0.02, "end": 174.48, "token_count": 597, "text": "Alle operativstemaer har en eller annen form for prioritet på prosesser. Og i 260-hjernen så er det 140 forskjellige prioritetsklasser. Og hver sånn klasse tilsvarer et antall tildelte tics i starten av en epoke. Og det scheduleren gjør, er at når den kommer inn, så velger den prosessen som har høyest prioritet. Eller gi fra seg CPU-en. Og deretter kalles kjedelvern på nytt. Og det er et viktig poeng, det der med at en eller gir fra seg CPU-en. Fordi det gjør at en prosess er veldig høyt prioritert. Og det kan typisk være sånne interaktive prosesser, som en teksteditor. Den bruker veldig lite CPU. Akkurat når det kommer inn tasten F fra brukeren, så er det veldig viktig at den prosessen svarer kjapt. Og en tekstredaktor bruker vanligvis veldig lite CPU, så den vil hele tiden få dynamisk høyere prioritet. Den vil komme veldig høyt opp. Men det som skjer da... Hvis en tekstredaktor har 100 og får... Utdelt 120 tics kommer veldig høyt opp. Så med en gang den har prosessert den ene bokstaven sin, så vil den overgi seg. Den vil stoppe og si at nei, nå trenger jeg ikke CPU lenger. Og dermed så vil den beholde den høye prioriteten. Kanskje få enda et tics som kommer opp i 121. Sånn at neste gang når den kommer inn, så vil den alltid komme inn med en gang. Med en gang det kommer. For når brukeren tasser F, så sendes et interrupt. Og da vil scheduleren merke det med et spesielt bit, som vi skal se på neste slide. Men scheduleren vil merke det, og teksteditorprosessen vil hoppe inn. Derimot en regneprosess, sånn som den.regn... Hver gang i epoken vil den bruke opp absolutt alle ticsene sine. Så den kommer kanskje ned til slutt til ti tics. Hver gang er det bare den som kjører. Da er det ti tics i epoken. Og den kjører da om og om igjen. Hvis du hele tiden bruker opp ticsene, så vil det gå ned i prioritet. Men så lenge det ikke er noen andre som ønsker å kjøre, så er det helt greit.", "source": "lecture"}
{"lecture_id": "os8del12", "chunk_id": "os8del12_0001", "start": 141.64, "end": 208.34, "token_count": 280, "text": "Derimot en regneprosess, sånn som den.regn... Hver gang i epoken vil den bruke opp absolutt alle ticsene sine. Så den kommer kanskje ned til slutt til ti tics. Hver gang er det bare den som kjører. Da er det ti tics i epoken. Og den kjører da om og om igjen. Hvis du hele tiden bruker opp ticsene, så vil det gå ned i prioritet. Men så lenge det ikke er noen andre som ønsker å kjøre, så er det helt greit. For da får du likevel kjøre hele tiden. Men da vil interaktive prosesser... De vil etter hvert bygges opp en høy prioritet og vil alltid komme raskt inn. Men de bruker likevel like mye CPU, så på den måten kan alle typer prosesser, både de som bruker mye CPU og ønsker å bruke mye CPU, og de som er interaktive og ikke bruker mye, de vil da kunne samkjøre innenfor samme system uten at taxidirektoren vil oppleves som ekstremt treg, bare fordi det er en regnejobb som står.", "source": "lecture"}
