{"lecture_id": "os8del4", "chunk_id": "os8del4_0000", "start": 0.0, "end": 182.42, "token_count": 582, "text": "Ok. Da skal vi se litt mer teoretisk på... Dette med scheduling og samtidige prosesser og hvordan et operativsystem da styrer det. Det store bildet av hvordan et operativ styrer. Ja, vi har allerede snakket mye om at det er viktig at to prosesser ikke må ødelegge for hverandre. To programmer som står og kjører samtidig på samme CPU... Må også delvis kjøre på hver sin CPU. Så må de f.eks. ikke skrive til samme del av minnet. For med multicore CPU-er så har vi jo samme minne. Så det må ikke være sånn at én prosess overskriver minnet for en annen. Så må det heller ikke være sånn at én prosess, hvis den ønsker det, Den setter opp en løkke og bare jobber og jobber og andre prosesser ikke får gjort noe. Og så kan det ikke være sånn at enkeltprosesser tar over hele CPU-en. At de f.eks. får hele systemet til å fryse. I verste fall kjører kommandoen holdt og stopper hele systemet. Sånn kan det opplagt ikke være. Det har vært mange løsninger opp gjennom tiden. En tidlig Windows-løsning, så var det sånn at man... Det var jo sånn Windows 95, hvor man begynte med multitasking. Så var det litt sånn at man hadde en frivillig operativstemme, bare overlot hele CPU-en til en prosess, men så måtte da prosessen frivillig gi den fra seg. Hvis det var bug i en sånn prosess og et eller annet galt, så kunne hele systemet låse seg. Så etter hvert så har alle moderne operativstemmer gått over til den beste løsningen, som er all makt til operativstemme, og som ofte kalles for preemptive multitasking. Og preemptive, det er... Opprinnelig så var det sånn i England at man skulle dele ut landområder til folk. Og det er på samme måte som Operativstemme gjør det. Den deler ut rettigheter til innbyggerne i landet, som da er prosessene. Og hver får sin del, og hver får sin del av ramm av minne og sin del av CPU. Så det vi skal se på nå, er hvordan kan Operativstemme i praksis få til dette. Ett prinsipp som er viktig...", "source": "lecture"}
{"lecture_id": "os8del4", "chunk_id": "os8del4_0001", "start": 139.56, "end": 318.16, "token_count": 587, "text": "Og preemptive, det er... Opprinnelig så var det sånn i England at man skulle dele ut landområder til folk. Og det er på samme måte som Operativstemme gjør det. Den deler ut rettigheter til innbyggerne i landet, som da er prosessene. Og hver får sin del, og hver får sin del av ramm av minne og sin del av CPU. Så det vi skal se på nå, er hvordan kan Operativstemme i praksis få til dette. Ett prinsipp som er viktig... Operativstøtten må ha litt hjelp fra Hardware for å kunne få til dette. Og en viktig bestanddel i den hjelpen er prosessormodus. Og alle moderne prosessorer har et modusbitt som er 0 eller 1, og som begrenser hva som er lov å gjøre. Og det modusbittet switcher imellom, det er da brukermodus. Og privilegert-modus, eller cornal-mode, som det heter på engelsk. User-mode og cornal-mode. Dette kalles også ofte protection hardware. Og det er helt nødvendig for å kunne kjøre multitasking i det hele tatt. Hvis du ikke har noen forskjell på brukermodus og privilegert-modus,  Så vil da i prinsippet enhver prosess kunne ta over kontrollen på systemet. Og da... da vil alt avhenge av at den prosessen gjør ting riktig, og ikke fryser systemet. Det finnes systemer som er sånn. Vi skal se på unicurnals senere, og da er det typisk at du har en kjerne som bare gjør én bestemt ting, f.eks. bare er webserver. Da har man ikke brukere og andre prosesser osv. Da er det full kontroll til denne prosessen. Men den må da selvsagt ikke ødelegges i systemet. Men dette med prosessormodus er veldig viktig i et generelt operativsystem som skal kjøre mange prosesser samtidig. Vi kommer ofte til å bruke ordet use mode, altså den engelske betegnelsen på brukermodus. Det er begrenset aksess til ram og til instruksjoner. Så når CPU-en er switchet til use mode, så kan ikke alle instruksjoner utføres. F.eks. hvis du er i use mode og prøver å gjøre institusjonen holdt, eller stoppe maskinen, så blir den bare ignorert.", "source": "lecture"}
{"lecture_id": "os8del4", "chunk_id": "os8del4_0002", "start": 279.96, "end": 354.32, "token_count": 251, "text": "i et generelt operativsystem som skal kjøre mange prosesser samtidig. Vi kommer ofte til å bruke ordet use mode, altså den engelske betegnelsen på brukermodus. Det er begrenset aksess til ram og til instruksjoner. Så når CPU-en er switchet til use mode, så kan ikke alle instruksjoner utføres. F.eks. hvis du er i use mode og prøver å gjøre institusjonen holdt, eller stoppe maskinen, så blir den bare ignorert. Da skjer det ingenting. Og det er hovedhensikten med use mode. Man får ikke tilgang til alt som er i minnet. I cornal mode, eller privilegert modus, så kan alt... Alle institusjoner kan utføres, alt minne og alle registre. Alt kan gjøres. Og det er opplagt her, i cornal mode, der kjører operativsystem kjernen. Og det er hele ideen. Fra cornal mode så kontrollerer operativsystemkjernen alt som skjer.", "source": "lecture"}
