{"lecture_id": "os9del10", "chunk_id": "os9del10_0000", "start": 0.0, "end": 189.0, "token_count": 582, "text": "Nå skal vi se litt på dette med å lage nye prosesser. Opplagt i alle OS må man ha en eller annen mekanisme for å lage prosesser. I Unix og nå i Linux så er det en litt spesiell måte å... Så er det en litt spesiell måte å starte opp prosesser på. Prosesser lages f.eks. ved systemoppstart. Da er det en første prosess innhent, den aller første prosessen, som starter opp. Man kan også lage prosesser... Hvis du har en kjørende prosess, så kan den utføre et systemcall, og så starte en ny prosess. Eller så kan du ha en bruker som ber om at en prosess startes, f.eks. hvis du er barsell. Og så vil du starte enda et vers. Skriver du vers, da initierer du at det starter opp en ny prosess. I Linux-verdenen, i Linux-kjernen, så er det alltid én prosess som lager en annen. Og dette skjer ved et såkalt folk-system-kall. Det som er spesielt med folk, er at det kloner seg selv. Når man gjør et forms system call, så får man en kloning av den eksisterende prosessen. Det høres litt rart ut, men det er ikke hver eneste at du får en kloning, og så setter du i gang og kjører et annet program i den kloningen. Dermed får du en helt ny prosess som kan være helt forskjellig fra foreldreprosessen. Det er alltid én prosess som starter en annen. Og den som starter, er naturlig nok foreldreprosessen. Og så får den et barn. En child-prosess. I prosessverdenen er det bare én forelder til hvert barn. Her ser vi et eksempel på det. Payday er prosess-id. Payday er parent-payday. Så har en parent med payday 17.12... Så gjør den en fock, så får man en child her nede. Med en ny payday. Typisk at det blir en høyere payday, for paydayene øker. Også den vil ha en parent-payday på 1712. Så kan den her gi dem folk igjen og lage et barnebarn til den her oppe. Med payday 1734, og den har parent-ID 1730. Så får du den type hierarkier. Det fins eksempler på at man kan drepe en parentprosess med alle barn.", "source": "lecture"}
{"lecture_id": "os9del10", "chunk_id": "os9del10_0001", "start": 150.0, "end": 315.98, "token_count": 496, "text": "Så gjør den en fock, så får man en child her nede. Med en ny payday. Typisk at det blir en høyere payday, for paydayene øker. Også den vil ha en parent-payday på 1712. Så kan den her gi dem folk igjen og lage et barnebarn til den her oppe. Med payday 1734, og den har parent-ID 1730. Så får du den type hierarkier. Det fins eksempler på at man kan drepe en parentprosess med alle barn. Det hender også at det skjer noe galt der, og da kan man få såkalte zombieprosesser. Som er litt sånne halvdøde prosesser. De gjør ikke noe, men det er typisk hvis en parent har blitt drept uten at child har blitt drept. De kan være vanskelige å bli kvitt, men du kan se det i toppet noen ganger. Men stort sett så fungerer det ryddig, så det er bare med feil at det blir zombieprosesser. Linux Fork er et systemkall for å lage en shell-prosess. Som sagt så lager det en klone, en identisk prosess med kopi av alt. Data og så videre... Så her ser dere parent-dataene. Når man gir dem folk, så lages en kopi av alt dette her. Det høres jo veldig tungt ut, og det er... Det er ikke helt riktig, for... Det som egentlig skjer i Linux, det er at den clone... Den kopierer alt dette minnet. Det er mer en sånn copy on demand. Hvis en trenger noen av de dataene fra parent, så kopieres de over. Det er ikke sånn at en tar en absolutt kopi av alt. Det meste av strukturen kopieres. Men av effektivitetshensyn tar man ikke en fullstendig kopi i praksis. De delene av minnet som man trenger. Så kan man da starte opp en... Som vi skal se på etterpå, så kan det være en if-test. If I'm a child, hvis jeg er barn, så start et a-program.", "source": "lecture"}
