{"lecture_id": "os9del6", "chunk_id": "os9del6_0000", "start": 0.0, "end": 209.0, "token_count": 584, "text": "Der har vi det nice vinduet, og de jobbene står fortsatt og kjører. Jeg stilte noen spørsmål før pause, og Christian hadde et godt svar på begge deler. Nemlig... Så lenge det ikke er noen andre jobber som brukes i EPU, Nice-verdien ha noe å si. For da er det ingen andre som trenger CPU. Og når det ikke er noen andre der, så trenger man ikke å være nice med de heller. Så dermed så kjører de med 100 % hele tiden. Men jeg spurte da også neste spørsmål hvordan kan man prøve å kjøre for prosesser? Nei, hvordan kan man vise effekten? Da foreslår Kristian å kjøre flere prosesser på samme CPU. Og bruke TASET med ulike nice-verdier. Det er også et veldig godt forslag, for da vil du kunne se den effekten. En annen måte å se den samme effekten på, er jo å fylle hele serveren med regnejobber. Da vil du få den samme effekten, men da begynner hele serveren... Jeg kjører dette på laptopen min, og her kjører jeg også OBS, Studio og Zoom. Jeg tror jeg foretrekker det forslaget til Christian, og teste ut det. Hovedpoenget er at hvis man ser på Last Used CPU... Der... Så ser vi at... Ja, definitivt noen ganger så flytter seg litt. Så ser vi OBS og Zoom som også bruker mye. De kjører faktisk noen ganger på samme CPU. Men de kjører typisk på andre CPU-er enn regnejobbene. Og vil ikke regne jobbene. Trenger å være nice. Men det kan likevel være fint å ha. Hvis du f.eks. skal kjøre masse videoer, sånn som jeg har gjort noen ganger... Da kan det være nyttig å ha på nice, sånn at ikke systemet fryser når jeg kjører 18 forskjellige videojobber som står og kverner og render. Det er veldig tungt. Når jeg har sett på Nice, så... Vil de være nice med andre jobber, sånn at systemet ikke blir så tungt. Men først og fremst så ser vi på dette for å se hvordan prioritering fungerer. Så da skal vi prøve å teste ut Kristians skriftforslag. Med å bruke task-sett. Så...", "source": "lecture"}
{"lecture_id": "os9del6", "chunk_id": "os9del6_0001", "start": 166.0, "end": 389.82, "token_count": 596, "text": "Da kan det være nyttig å ha på nice, sånn at ikke systemet fryser når jeg kjører 18 forskjellige videojobber som står og kverner og render. Det er veldig tungt. Når jeg har sett på Nice, så... Vil de være nice med andre jobber, sånn at systemet ikke blir så tungt. Men først og fremst så ser vi på dette for å se hvordan prioritering fungerer. Så da skal vi prøve å teste ut Kristians skriftforslag. Med å bruke task-sett. Så... Nå står jo de jobbene der og hopper frem og tilbake, så jeg kan ta... kanskje å drepe regnejobbene først. Og så kan jeg i stedet si TaskZ minus C... La oss si vi setter dem på prosessor 3. Så kan jeg ta Nice minus 19. Og... regnejobben... regn. Sånn. Og da... skal vi se om vi ser... Jeg starter kanskje. Skulle gjerne hatt med 'Last Use Super'. Vi har hatt med en større en. Der. Da ser vi den ene jobben. Som jeg ba om, så står den på tre. Men hva om jeg nå... setter én jobb til der? Og så gir jeg den en bitte litt nice én. Får jeg da noen effekt? Ja, jeg får en effekt, men den er så stor at jeg nesten ikke så regnejobben. Så kommer da den andre regnejobben. Den som har Nice 19, den kjører nå nesten ikke noe CPU. Den har 1,7 %, mens denne som er ganske... Bare lite grann nice. Nice er det én. Den får det aller meste. Hvis jeg nå kjører en default uten å bruke Nice i det hele tatt, Da ser vi... Da kommer soomobs høyere. Men her har vi nå regnejobbene. Og den jobben som har nice 0, sånn standard, den får 55 %. Nice 1. Vi ser den er litt nice med den andre regnejobben. Vi gir litt mindre. Mens den som er 19, den er super nice. Så på denne måten fungerer Nice. Men vi hadde et annet problem før pause også. Jeg prøvde å sette Nice til 18 på en som hadde Nice-verdi 19. La oss si jeg er lei av at denne her... Nei, hva var den...? Denne her har så lav Nice-verdi, så jeg skal prøve en reneise.", "source": "lecture"}
{"lecture_id": "os9del6", "chunk_id": "os9del6_0002", "start": 348.16, "end": 587.1, "token_count": 598, "text": "Nice 1. Vi ser den er litt nice med den andre regnejobben. Vi gir litt mindre. Mens den som er 19, den er super nice. Så på denne måten fungerer Nice. Men vi hadde et annet problem før pause også. Jeg prøvde å sette Nice til 18 på en som hadde Nice-verdi 19. La oss si jeg er lei av at denne her... Nei, hva var den...? Denne her har så lav Nice-verdi, så jeg skal prøve en reneise. La oss si til pluss 5. Men da får jeg permission her, og som en påpekte i chatten... Kanskje det ikke er lov. Og det ser vi også at... I man-sidene så står det at... Skal vi se om jeg finner det... Slike endringer er irreversible... Setter da nice-verdien til 5. Egentlig litt rart. Skulle tro man kunne sette den til null, men sånn er det. Med sudo kan jeg også sette nice-verdien til noe negativt. Så jeg kan prøve med minus 5, f.eks. Da fikk den nice-verdien her... Den der har nå minus 5. Men det ser faktisk ikke ut som den... ... likevel får noe mer slippehud. Jo... I forhold til regnejobbene så ser vi nå for den som har minus 5 her... Den får 63 %, mens de andre regnejobbene har 2016. Dette gir da en... Som er enda høyere enn 0, som er default. Vi snakket om 140 prioritetsklasser. Det er disse 40, fra nice-verdi minus 20, som er det høyeste, og opp til 19, det er de 40 prioritetsklassene som er for vanlige gyserprosesser, vanlige brukerprosesser. I tillegg har man 100 prioritetsplasser som er for realtime-prioritering. Det er typisk kjerneprosesser som skal gå veldig fort. Her står det RT og ikke noen nice-verdi. Det betyr at den hører til de 100 prosessene som er en annen. Her ser dere migration og watchdog... Det er typisk systemprosesser. De har en annen prioritetsplass. Realtime er typisk... Generelt er det en prosess som må kunne utføres innen en viss frist. Du kan ha en real-time-prosess som i løpet av et hundre øyesekund må bli ferdig. Det er en annen prioritetsklasse, så de går over disse jusprosessene.", "source": "lecture"}
{"lecture_id": "os9del6", "chunk_id": "os9del6_0003", "start": 554.52, "end": 601.2, "token_count": 157, "text": "Det betyr at den hører til de 100 prosessene som er en annen. Her ser dere migration og watchdog... Det er typisk systemprosesser. De har en annen prioritetsplass. Realtime er typisk... Generelt er det en prosess som må kunne utføres innen en viss frist. Du kan ha en real-time-prosess som i løpet av et hundre øyesekund må bli ferdig. Det er en annen prioritetsklasse, så de går over disse jusprosessene. Men brukerprosessene har da 40 prioritetsklasser, og med nice or not kan man flytte seg opp og ned i de prioritetsklassene. ...", "source": "lecture"}
