{"lecture_id": "os9del12", "chunk_id": "os9del12_0000", "start": 0.0, "end": 209.98, "token_count": 593, "text": "Avslutte prosesser... Det er mange måter å stoppe prosesser på. Vi kan ha en normal avslutning, frivillig. I et chell kan jeg skrive 'exit'. Da stopper vi, eller i C - exit. Så kan vi ha en avslutning med feil. Det er også frivillig. Men så kan man ha fatale feil. At det er en ufrivillig situasjon hvor det er vanskelig for operativstøtten å gå videre. F.eks. deling med null. Hvordan skal du da kunne gå videre? Da kan hele programmet krasje. Også hvis et program prøver å skrive til en del av minnene som en ikke har lov til, eller gjøre noe virkelig galt. Da får du gjerne en sånn segmentation fault. Og det betyr at det er et eller annet minneprogram. Fatal feil som programmet gjør, og at det da vil avsluttes. Så kan du bli drept av andre prosesser. I Linux har vi sett for eksempel kjørekill eller terminert prosess i Windows. I motsetning til Unix, som er hva... Jo... Unix er så mangt, men hvis vi ser på Linux, så er Linux stort sett skrevet i C. Det er noen ganger i uken når du skal se på alle kodelinjene i kildekoden. Dere vil da se at de aller fleste linjene er C. Ikke objektorientert. Det vil si at Linus-jern er da ikke bygd opp av objekter. Men den er jo veldig modulær. Hvis man har et objektorientert språk, så er man fullstendig tvunget til å skrive objekter og gjøre det modulært med objekter og metoder osv. Men det går også an å skrive programmer i programmeringsspråk som ikke er objektorienterte, på en veldig ryddig, modulær og systematisk måte. Det kan man jo si Linux er, men i utgangspunktet så er da Linux ikke objektorientert. Det har ikke... Rett og slett fordi ser programmeringsspråkets krefter ikke er objektorienterte. Men at det ikke er objektorientert, betyr ikke at det ikke er metoder og funksjoner osv. Det har det. Så det er veldig systematisk oppbygd, men det har ikke en eksplisitt objektorientering. Signaler... Ja, det har vi.", "source": "lecture"}
{"lecture_id": "os9del12", "chunk_id": "os9del12_0001", "start": 157.8, "end": 281.0, "token_count": 367, "text": "som ikke er objektorienterte, på en veldig ryddig, modulær og systematisk måte. Det kan man jo si Linux er, men i utgangspunktet så er da Linux ikke objektorientert. Det har ikke... Rett og slett fordi ser programmeringsspråkets krefter ikke er objektorienterte. Men at det ikke er objektorientert, betyr ikke at det ikke er metoder og funksjoner osv. Det har det. Så det er veldig systematisk oppbygd, men det har ikke en eksplisitt objektorientering. Signaler... Ja, det har vi. Sett på tidligere... Jeg hadde et script som... Som jeg kjørte, og som brukte en kommando som heter trapp til å fange opp signaler. Det er ikke den trappen man har i kjernen, men den... En Shell-kommando som kan ta ut mot et kill-signal. F.eks. kontroll C er vel kill-signalet 2. Og så kan den behandle... Alle prosesser kan ta imot signaler og beholde dem. Et unntak er kill-minus-ni. Det er en sånn sure kill, så den vil drepe prosessen. Jeg kjørte en liten demo av den i en tidligere forelesning, så jeg kan legge inn en link tilbake dit. Så kan man studere hvordan man kan sende signaler til prosesser. Det er måten prosesser kommuniserer på. Det er ikke nødvendigvis kill, men man kan sende signaler om andre ting også.", "source": "lecture"}
