{"lecture_id": "os9del14", "chunk_id": "os9del14_0000", "start": 0.0, "end": 208.3, "token_count": 589, "text": "I prinsippet er det mye som ligner, men det er noen forskjeller. Her igjen er denne nederste boksen kjernen. Vi kjører gysemål her oppe med brukerapplikasjoner. Alt dette kjører gysemål og ber da operatismeskjernen om hjelp. Gjennom API-et, gjennom systemkallet. Så er det med liten skrift ntoscornal.xe. Den vil du finne på en Windows-maskin, og det er da hele dette programmet her. Det er ntoscornal.xe. Windows har også en såkalt monolittisk kjerne. Det vil si at du har én stor kodeenhet, hvor i prinsippet man kan... Her borte fra deviser og filsystemer kan det ødelegge for grafikken. Og det er forskjellig fra såkalt mikrokjerne... Hvor du da har en veldig liten mikrokjerne... Og da typisk disse delene er helt uavhengige... Og snakker med hverandre via signaler. Altså det kommuniserer med mikrokjernen. Mens i monolittiske kjerner, som både Linux og Linux er, så kan alle deler av kjernen snakke med alle deler av kjernen. Det betyr også at kompleksiteten blir veldig stor, og det øker sjansen for feil. En viktig forskjell på Windows og Linux er at grafikken er en del av... Det er noen forskjeller på det. Det er tatt ut i noen sølveversjoner. Men sånn tradisjonelt er alt med grafikk en del av Windows-kjernen. Sånn er det ikke i Linux. Som vi ser her, har vi ikke noen direkte del av kjernen som styrer med grafikk. Det som skjer der, er at grafikk kjøres i use mode. X-vindussystemet kjøres i user space. Det gjør også at det ikke er like effektivt. Spesielt har det tradisjonelt vært en del problemer med spill på Linux. Iallfall tradisjonelt, nettopp pga. pilene der. I tillegg ser vi at den har en del mikrokerner her. Som styrer alle disse underdelene. Sånn som power management, object manager, fyllsystem osv. Men det er ikke en sånn ekte microcanal i... I den forstand at den bare kommuniserer med signaler med de andre modulene. Men det er en liten del av kjernen som styrer alt det andre.", "source": "lecture"}
{"lecture_id": "os9del14", "chunk_id": "os9del14_0001", "start": 161.0, "end": 235.96, "token_count": 195, "text": "Spesielt har det tradisjonelt vært en del problemer med spill på Linux. Iallfall tradisjonelt, nettopp pga. pilene der. I tillegg ser vi at den har en del mikrokerner her. Som styrer alle disse underdelene. Sånn som power management, object manager, fyllsystem osv. Men det er ikke en sånn ekte microcanal i... I den forstand at den bare kommuniserer med signaler med de andre modulene. Men det er en liten del av kjernen som styrer alt det andre. Som skal gjøre at kjernen her får et uniformt grensesnitt mot hardware. Så hvis man endrer hardware her nede, så tar hal det av seg. Sånn at kernel får det samme grensesnittet. Uansett hva slags hardware som ligger under.", "source": "lecture"}
