{"lecture_id": "os9del4", "chunk_id": "os9del4_0000", "start": 0.0, "end": 177.72, "token_count": 600, "text": "Prioritet er viktig å ha mellom prosesser. Dvs. det er viktig å kunne skille prosesser på prioritet. Og vi så i forrige uke at Linux opererer med noe sånn som 140 prioritetsklasser. Fra lav prioritet opp til høy. Og det Linux-scheduleren gjør, er å gi... Mange tics, eller en lang time-slice, til prosesser med høy prioritet. Og så velger man alltid den med høyest prioritet når man skal kjøre. Dvs. når scheduler kommer inn og skal gjøre en vurdering av hvilken prosess som skal settes i gang. Men sånn grovt sett så er det rollen robin. Man bare bytter på de... De som kjører. For i praksis vil det da bli en Ron Robin. Selv en prosess som har høy prioritet og kommer først inn, når den er ferdig med sine tics i epoken, så vil den hoppe til neste. Og det er det som er Ron Robin. Dynamisk så vil den Linux-skadeleren gjøre det sånn at interaktive brukerprosesser får høyere prioritet. Sånn at med en gang de skal gjøre noe, så går de foran i køen. Men de bruker gjerne ikke mye SUPU, så med en gang de er ferdige, så hopper de ut igjen. Mens batchjobber som står og bruker SUPU hele tiden, de har da lav prioritet. Men de jobber da hele tiden når ingen andre vil jobbe. Og det skal vi se på etterpå med Nice. Og det kan vi gjøre enda mer ekstremt. Vi kan velge å være Nice og være enda mer vertsjobb. Spesielt så er det en del kjerneprosesser som jobber etter first come, first served. Og de kommer deg rett inn i køen, og de kan ikke kjøre Ron Robin, for de må da fullføre før noen andre kan kjøres. Og det er typisk å ha veldig korte prosesser som blir raskt ferdig, men de kommer inn, og så utfører de alt de skal, og så avslutter de. For andre operativstemmer. Alle har en typeprioritering sånn som dette her. Generelt så finnes det mange scheduling- eller scheduleringsalgoritmer. Og den vi har sett på med Linux, er One Robin. Da bytter prosesser på å kjøre. Det tar litt tid hver runde. Og det finnes jo mange andre tilfeller hvor man bruker schedulering. ", "source": "lecture"}
{"lecture_id": "os9del4", "chunk_id": "os9del4_0001", "start": 137.08, "end": 256.32, "token_count": 431, "text": "Og det er typisk å ha veldig korte prosesser som blir raskt ferdig, men de kommer inn, og så utfører de alt de skal, og så avslutter de. For andre operativstemmer. Alle har en typeprioritering sånn som dette her. Generelt så finnes det mange scheduling- eller scheduleringsalgoritmer. Og den vi har sett på med Linux, er One Robin. Da bytter prosesser på å kjøre. Det tar litt tid hver runde. Og det finnes jo mange andre tilfeller hvor man bruker schedulering.  Alle disse metodene her brukes også i andre sammenhenger. Det er alle sammenhenger hvor man har ressurser man skal dele på. Som regel er det tidsressurser, men det kan også være andre ressurser. First come, first served. Det som navnet sier, så er den første prosessen som kommer inn, den blir først prosessert. Det er den som setter i gang uansett. Fifo er first in, first off. Førsten som kommer inn, er den første som blir ferdig, og første som sendes ut. SJDF, eller 'Shortest Job First', er en litt annen måte å gjøre det på. Da er det den prosessen som tar kortest tid, som er den neste som kjøres. F.eks. hvis man skal printe ut ting, så kan det være en smart måte. Sånn at det er fem sikkerhetsnummer som skrur ut én side, så gjør man det først, og så kommer den som skal ha 150 sider. Den kommer til slutt. Det er ikke alltid så lett å få til det, for da må man vite lengden på prosesseringen. Og det vet man generelt ikke når det gjelder prosesser. Så for prosesser så er det ikke så vanlig å ha den type skrift.", "source": "lecture"}
