{"lecture_id": "os9del5", "chunk_id": "os9del5_0000", "start": 0.0, "end": 209.0, "token_count": 595, "text": "Nice er som ordet sier, å være snill med andre. Det er betydningen av ordet. Og det er akkurat det vi skal se på nå. Vi skal se hvordan vi kan endre på prioritering selv på egne prosesser. Hvis vi ikke bruker nice, ikke gjør dette eksplisitt, så er det jo operativsystemet som dynamisk endrer på prioritering. Det gir dem forskjellig prioritet i forhold til hvor mye CPU de bruker. Interaktive prosesser som ikke bruker CPU, de får høy prioritet. Mens det motsatte med rene jobber. Men nei, så er det en kommando som eksplisitt nedprioriterer seg selv. Så en Linux-prosess kan nedprioritere seg selv. Høyere nice-verdi gir mindre saputi. Men egentlig er det logisk, for hvis du har en høy nice-verdi, den går opp til 19, som er maks, så er du ekstremt snill mot andre. Da er du veldig beskjeden, som lua i hånda, bare tar saputiks når ingen andre vil ha det. Default nice-verdi er null. Da ligger du på midten. Og du kan også ha negative nice-verdier. Og hvis du er negativ nice, da er du bad. De prosessene er slemme og tar ekstra resept ut hit fra de andre. Og det er da typisk noen sånne RUT-prosesser som har negativ nice-verdi. Og det kommer noen oppgaver om dette også. Og litt av clouen da er at for å sette negative nice-verdier, så må du... Men vanlige brukere kan sette vanlige Nice-verdier. Så... Ja, vi kan starte også se litt på det. Ja, da kan vi jo egentlig starte med regn, og så kan jeg sette... Oi. Nå skal vi gå på Nice, og da må jeg ha med dere. Skal vi se... Der var vi. Ja, vi skal nå se på Nice og hvordan vi kan bruke Nice til å endre på prioriteten. Og nå la jeg på et par nuller, sånn at den regnejobben står og kjører lenge. Sånn at jeg kan med Nice endre på Nice-verdien. Så jeg kan ta... Først kan vi vise hvordan det brukes. Vi kan f.eks. starte nice minus en ni og så regn. Den starter da en regnejobb med nice-verdi ni. Og det kan vi se her når vi kjører topp. Her står det ni.", "source": "lecture"}
{"lecture_id": "os9del5", "chunk_id": "os9del5_0001", "start": 156.62, "end": 400.88, "token_count": 600, "text": "og hvordan vi kan bruke Nice til å endre på prioriteten. Og nå la jeg på et par nuller, sånn at den regnejobben står og kjører lenge. Sånn at jeg kan med Nice endre på Nice-verdien. Så jeg kan ta... Først kan vi vise hvordan det brukes. Vi kan f.eks. starte nice minus en ni og så regn. Den starter da en regnejobb med nice-verdi ni. Og det kan vi se her når vi kjører topp. Her står det ni. Det er da nice-verdi 9. Men det som da er litt rart, er... Oi. Nå ser jeg at jeg står litt i veien her. Sånn. Det som er litt rart, er at her oppe så ser vi... Denne jobben bruker jo 100 % CPU. Selv om den er nice. Det var litt rart... La oss si jeg prøver å sette i gang en til... Så ser vi at... Jo, den er veldig nice, men... Den bruker fortsatt så å si 100 % separatitt. Så skal vi se hvordan man kan også renise. Jeg kan renise og så si pluss 19 på den paydayen der. Den som hadde 9. Og da setter vi old priority 9, new priority 19. Skal vi se... Vi kan sjekke om den er absolutt. Der er det minus 3. Nei, jeg får ikke lov til å sette det minus 3. Da får jeg permission to night. So that's a minus... Det betyr bare sett til... Nei... Pluss skal du så. Jeg får ikke lov til å være negativ. Sett pluss 18. Det betyr... Sett verdien til pluss 18. Men hvorfor fikk jeg...? Ikke lov å renice den... Gjør jo sånn, ja. Der fikk jeg prioritert 19 på den prosessen. Men likevel... Fortsatt er problemet her... Det høres ikke ut som noe av det jeg har sagt, er riktig. De er jo ikke nice. De tar alle sefurene. Ja, det var et godt spørsmål... Det skulle være mulig å gjøre det lavere. Kanskje ikke. Det må jeg undersøke. Men det kan jeg ta pausen å gjøre. Og så kan dere også da... I pausen kan dere tenke på... Hva er det som gjør at nice ikke ser ut til å ha noen effekt der? Hvorfor fortsetter de å kjøre i 100 % disse jobbene selv om de har en høy nice-verdi?", "source": "lecture"}
{"lecture_id": "os9del5", "chunk_id": "os9del5_0002", "start": 356.06, "end": 438.98, "token_count": 230, "text": "Ja, det var et godt spørsmål... Det skulle være mulig å gjøre det lavere. Kanskje ikke. Det må jeg undersøke. Men det kan jeg ta pausen å gjøre. Og så kan dere også da... I pausen kan dere tenke på... Hva er det som gjør at nice ikke ser ut til å ha noen effekt der? Hvorfor fortsetter de å kjøre i 100 % disse jobbene selv om de har en høy nice-verdi? Jeg ser for øvrig et par RUT-prosesser som har minus 20. Det vil si den høyeste prioriteten du kan gitt i noen prosess med nice minus 20. Men de jobber ikke så mye. En gang de ønskes i PUS, så får de det. Og så blir det prioritert fremfor alle andre. Men tenk litt på i pausen... Hva kan dette skilles? Og i tillegg så kan vi se på om det går an å rinheise nedover.", "source": "lecture"}
