{"lecture_id": "os9del1", "chunk_id": "os9del1_0000", "start": 0.0, "end": 179.0, "token_count": 585, "text": "Vi har kommet ganske så langt. Det er nå tre uker frem til påske. Og i operativsystemer, i den teoretiske delen, så skal vi i dag se litt mer på prosesser, som vi har drevet mye med. Og vi skal egentlig fortsette med det neste uke også, hvor vi skal se på plattformer. Formavhengighet og threads. Tråder, eller threads, det blir liksom det siste store temaet innen prosesser. Så vi jobber veldig mye med prosesser, men det er tross alt det man... Det er en veldig viktig del av et operativsystem og en veldig viktig del av hverdagen til utviklere og programmerere og alle som jobber med data. Så vi bruker mye tid på det. På de digitale forelesningene så skal vi fortsette noe med dere. Vi skal også se på regulære uttrykk. Og så skal vi begynne å se på virtuelle maskiner. Men vi får se hvor langt vi kommer. Kanskje etter påske så... Så skal vi starte med Windows og PowerShell. Eventuelt blir det etter påske. Ja... Det er spørsmål om... Om eksamen. På informasjon om faget på Oslomedisinens sider står det at eksamenvurdering er bestått, ikke bestått. Det må jeg undersøke, men iallfall jeg har søkt om at vi skal få bokstavkarakterer. Jeg trodde det egentlig var avgjort, men det er veldig fint dere spør. Sjekk ut det. Og hvis dere ikke får beskjed snart, så... Så si ifra. For det er viktig å få avklart det med eksamen. Så det jeg planlegger, i hvert fall hvis vi egentlig uansett er... I en digital eksamen, og så tilrettelegge det sånn at i hvert fall deler av eksamen blir... Sånn at ikke alle får samme spørsmål, sånn at det er veldig lett å samarbeide. Allerede i fjor hadde vi det, med multiple choice-oppgaver, hvor man fikk forskjellige typer oppgaver, eller veldig like oppgaver, men forskjellige tallverdier, da, f.eks. Sånn at ikke man bare kunne kopiere fra en annen og samarbeide og levere inn sammen. Så det er planen.", "source": "lecture"}
{"lecture_id": "os9del1", "chunk_id": "os9del1_0001", "start": 143.22, "end": 190.28, "token_count": 190, "text": "I en digital eksamen, og så tilrettelegge det sånn at i hvert fall deler av eksamen blir... Sånn at ikke alle får samme spørsmål, sånn at det er veldig lett å samarbeide. Allerede i fjor hadde vi det, med multiple choice-oppgaver, hvor man fikk forskjellige typer oppgaver, eller veldig like oppgaver, men forskjellige tallverdier, da, f.eks. Sånn at ikke man bare kunne kopiere fra en annen og samarbeide og levere inn sammen. Så det er planen. Håper også at det er mulig å få en noenlunde rettferdig bokstavkarakterfordeling. Men det er fint dere spør, og da skal jeg sjekke ut det.", "source": "lecture"}
