{"lecture_id": "os9del15", "chunk_id": "os9del15_0000", "start": 0.0, "end": 230.78, "token_count": 582, "text": "Da skal vi se på en folk-demo. Folk er litt merkelige. Det er ikke så lett med en gang å skjønne hvordan det fungerer. Men det som skjer når jeg gjør et folk-call... Dette er et se-program, og jeg trenger disse bibliotekene for å kunne bruke folk. Den første skriver ut folk-demo. En linje. Og så gjør man et system kalt folk, så skriver man ut en linje til. Og det som skjer da, når du gjør folk, er at fra og med neste linje så fortsetter jo dette programmet... Altså Parents, de fortsetter å kjøre, og skriver ut den linja. Siden Child er en kopi av Parent, vil den fortsette der Parent slapp. Så vil den også skrive ut folk-demoer. Så vi kan prøve å kjøre den og se hva som skjer. Men da får vi ut tre folk-demoer. Jeg skriver bare to ganger. Den første folk-demoen her... For å gjøre det helt klart... Folk-demo... Vi kan kalle den én. Og så kan vi skrive folk-demo to. Det er den første, og så kommer det to som er folk-demo to. Så vi kan gjøre det eksplosivt. Komplimenter å kjøre i. Folkdemo én skrives ut av den første, og så folkdemo to av den andre. Og sånn kan man jo fortsette. Hvis vi gjør det sånn... Hvor mange folkdemo skrives ut av? Sånn totalt antall linjer... Hva tror dere? Det er et forslag om sju stykker. Ja, det høres fornuftig ut, fordi... Man kunne kanskje tenke at det bare ble fem, men her har jeg jo en fork, og da er det allerede... Den vil også childgjøre, så den vil lage et barnebarn. Her nede vil jeg doble igjen. Så jeg får liksom... Først er det én prosess, så er jeg to, og så er jeg fire. Så da burde det bli syv stykker. Yes. Dere er altfor gode. Dere svarer riktig med en gang. Mye bedre om noen av dere feiler først, men veldig bra. Hvordan kan man egentlig bruke dette her? Det ville jo ikke vært så veldig hensiktsmessig hvis... Hvis man bare kjørte videre akkurat det samme programmet.", "source": "lecture"}
{"lecture_id": "os9del15", "chunk_id": "os9del15_0001", "start": 180.0, "end": 407.96, "token_count": 590, "text": "Her nede vil jeg doble igjen. Så jeg får liksom... Først er det én prosess, så er jeg to, og så er jeg fire. Så da burde det bli syv stykker. Yes. Dere er altfor gode. Dere svarer riktig med en gang. Mye bedre om noen av dere feiler først, men veldig bra. Hvordan kan man egentlig bruke dette her? Det ville jo ikke vært så veldig hensiktsmessig hvis... Hvis man bare kjørte videre akkurat det samme programmet. Men da får jeg prøve å se på litt hva... Hva er det denne folk... Returnerer. Int. pay.ve. Så kan jeg ta... Skal vi se... Kan jeg ta en printf? Ja... Det er et spørsmål om hvorfor det skrives nr. 3 ut fire ganger. Ja, da må jeg se litt nærmere på det. Jo... Det er fordi... Her startes en shile. Og dermed er det to programmer som skriver ut Folkdemo 2. Og da vil det første... Parent som skrev ut Folkdemo 2 her... Det vil gjøre folk. Og da vil du få... Skru ut demo 3, og den charden som den lagde, skru ut demo 3. Det samme skjer da med den demo 2 her, som ble startet. Den skrur ut demo 2, og så lager den chard. Så selv skrur den ut demo 3, og så er det charden dens igjen som skriver ut enda en demo 3. Så dermed blir det fire ganger utskrift med demo 3. Men det er ganske forvirrende når man driver og setter det opp. Det er ikke så opplagt at det blir syv, men... Det er noen oppgaver denne uken som går på dette, så prøv å feile litt med folk. Men hovedpoenget var at man kan... Hvis jeg husker riktig syntaks, så kan man skrive ut... Er lik... skal vi se... 14 % d. Kan prøve noe sånt. Og da ser vi... Payday er 2726, skrives ut. Og så er det payday lik null. Og akkurat dette her kan vi bruke til noe. Det er en kommentar at dette er nesten som rekvisjon. Ja, det er rekvisjon, men ikke helt sånn når en metode kaller seg selv. Når en metode kaller seg selv, så starter den alltid fra starten.", "source": "lecture"}
{"lecture_id": "os9del15", "chunk_id": "os9del15_0002", "start": 360.0, "end": 614.08, "token_count": 581, "text": "Er lik... skal vi se... 14 % d. Kan prøve noe sånt. Og da ser vi... Payday er 2726, skrives ut. Og så er det payday lik null. Og akkurat dette her kan vi bruke til noe. Det er en kommentar at dette er nesten som rekvisjon. Ja, det er rekvisjon, men ikke helt sånn når en metode kaller seg selv. Når en metode kaller seg selv, så starter den alltid fra starten. Men her er det en slags rekvisjon hvor du... Eller, det er kun herfra som man starter. Man kunne tenke seg at når du gjør en folk at du starter programmet på ny... Men da må man huske på at dette er en kopi av det programmet som kjører. Så det er en kopi som fortsetter å kjøre derfra parent-prosessen er. Det er akkurat det samme programmet, og dermed vil den ikke... Shield vil ikke sette i gang og kjøre den første printen. Den vil bare fortsette derfra. Det er derfor jeg aldri får noen første print fra Shield. Et slags rekkerskiftkall, men det rekkerskiftkallet starter fra nøyaktig der parent er, og fortsetter derfra. Det er rett og slett en kopi. Man kopierer alt ved prosessen og legger den i minnet, og så kjører den videre derfra den forrige slapp. Og det er nemlig den paydayen. For da er det sånn at i Child så returnerer forkallet null. Så dermed så kan man teste om man er i Child eller ikke. Mens i Parent så returneres paydayen til Child. Man kan utnytte dette, og så kan man si... Hva skjer da? Jo, da kan man si... Da kan jeg si at... Ok. Jeg er shiled. Og da bør det bli... Sånn. Og så kan vi si Els. Og så må vi da si at... Jeg er ferdig. Sånn... Kan vi glemme de siste der? Vi kunne forresten ha med... For det kan være litt interessant... Folkdemo-avsluttet. Hvor mange ganger skrives denne siste linjen ut her? Jo, det som forhåpentligvis skjer nå, er at for 'Child' så kjører jeg denne. Og for 'Parent' så kjører jeg bare den der, så vi skal få to forskjellige utskrifter.", "source": "lecture"}
{"lecture_id": "os9del15", "chunk_id": "os9del15_0003", "start": 561.16, "end": 776.88, "token_count": 599, "text": "Jeg er ferdig. Sånn... Kan vi glemme de siste der? Vi kunne forresten ha med... For det kan være litt interessant... Folkdemo-avsluttet. Hvor mange ganger skrives denne siste linjen ut her? Jo, det som forhåpentligvis skjer nå, er at for 'Child' så kjører jeg denne. Og for 'Parent' så kjører jeg bare den der, så vi skal få to forskjellige utskrifter. Men hvor mange ganger kjører den folk de har måttet avslutte på? Eller hvor mange ganger kjører den? Jo... To ganger, ja. Flere som sier to. Helt riktig. Dette er bare en if-test, så hvis den er skjelt, så kjører du den der. Men etter den if-testen så vil den ikke gå inn her, men den vil faktisk fortsatt kjøre den der. Vi ser der FolkDemo1. Jeg er parent. Folk ga PID 26923. Og så rekker den akkurat å skrive ut FolkDemo avsluttet, før den... Shield er nå light og skriver ut:\"Jeg er Shield. Folk har payday-liknull.\" Og folk de må ha sluttet. Det vanlige er at du har en sånn test, og så kjører du ikke noe mer felles kode. Du kjører bare den koden inni her og den koden inni her. Men man kan også kjøre felles kode sånn som det. Avanserte måter å bruke folk på, sånn som dette her... Hvor man har parent og shield. Vi skal ikke se på det i detalj, men bare for å gi et inntrykk. Så kan det se sånn ut. Man kan styre 'jeg er parenten' med Prosess Payday 2697. Og så sier man 'jeg er shield'. I dette tilfellet så venter... Ikke på at shide har avsluttet. Da ser vi den bare fortsetter. Siden det er en kloning, så har den samme terminal output også. Så den skriver default TDA output. Ja, alle shide-prosesser har null i... Nei, en shide-prosess har ikke null i payday, men forkallet returnerer null. Så payday-en til shide-prosessen... Som parent får. Så dette vil da være paydayen til child-prosessen. Men... Nei, dette er paydayen til parentativet. Child får en payday, men variabelen payday er lik null inni child. Dette er kommunikasjon mellom de to prosessene.", "source": "lecture"}
{"lecture_id": "os9del15", "chunk_id": "os9del15_0004", "start": 730.3, "end": 838.94, "token_count": 312, "text": "Så den skriver default TDA output. Ja, alle shide-prosesser har null i... Nei, en shide-prosess har ikke null i payday, men forkallet returnerer null. Så payday-en til shide-prosessen... Som parent får. Så dette vil da være paydayen til child-prosessen. Men... Nei, dette er paydayen til parentativet. Child får en payday, men variabelen payday er lik null inni child. Dette er kommunikasjon mellom de to prosessene. Vi kan gjøre en wait-payday. Her er jeg nå i Parents, og den sier ok... 'Jeg skal vente på...' Så... venter ikke. Det var bare det jeg skrev. Hvis jeg skal gjøre det riktig, så burde det stått sånn. Så her ser vi Parents står og venter. Scheinprosess avslutter. Og så avslutter parent også. På den måten kan man starte nye prosesser, og så kan de kommunisere med hverandre. Og siden man har en sånn if-test, så kan den nye shell-prosessen gjøre hva som helst. F.eks. så kan man lage en shell-prosess, og så kan man be den om å kjøre Firefox. Og dermed har man en helt ny, uavhengig prosess som kjører dette amperet.", "source": "lecture"}
