{"lecture_id": "os9del13", "chunk_id": "os9del13_0000", "start": 0.0, "end": 226.0, "token_count": 595, "text": "Skal vi se litt på... Linux-arkitektur... Ja... Hovedprinsippet bak denne tegningen er at dette som er inni boksen her, det er Linux-kjernen. Og så ser vi alle applikasjoner og verktøy. De er i use space. Linux-kjernen er delt opp i fem moduler. Som sagt er det ikke objektorientert, men det er modulært. Så det er veldig systematisk satt opp. Men i prinsippet så kan skeduleren der borte endre på ting i... Hvis man skrev kode som var skikkelig hårete, så ville det bli ekstremt komplekst og aldri funke. Det er et enormt svært program. Konklusjonen på oppgaven denne uken er noe sånt som at hvis man... ... i bøker og stabler dem oppå hverandre, og så får man en stabel som er 25 meter høy. Så det er enormt mye kode. Så dette må være veldig modulært og bygd systematisk opp. Det er fem viktige hovedmoduler. Det første vi har sett på veldig mye nå, er alt som har med prosessmanagement, scheduler, multitasking osv., og det er relatert til det vi har her nede, nemlig SEPUT. Det neste punktet vi skal se på, er ram og cash. Cash styres ikke av operativsystemet direkte. Det er hardware-styrt, men alt som har med ram å gjøre, styres av operativsystemet, og det skal vi se på i detalj senere. Vi kommer også til å se på filsystemet og filer av directories, mapper, Alt dette er lagret på harddisk. Det er de tre viktige komponentene. I tillegg har vi alle mulige devices. Sånn som tastatur og terminaler og... Nettverkskort kommer inn i nettverk. Men alle mulige andre devices i USB, f.eks. Det er i prinsippet ganske enkle ting, men det som gjør det vanskelig, er at det er hardware. Så det er veldig mye jobb å skrive drivere til alle mulige typer hardware. Det kom vi ikke så veldig mye inn på. Vi kommer heller ikke inn på nettverk. Så... Mange av dere har nettverk med app. I det kurset, hvor dataingeniører har gitt det, er det det kurset hvor vi ser på nettverk. Tidligere var nettverk en del av OS-kurset, men nå er det et eget kurs.", "source": "lecture"}
